{"date":"2017-09-21T00:00:00.000Z","title":"About the Agile Tour Paris 2016 by a Product Owner","excerpt":"On November 17th took place the 9th edition of the Agile Tour Paris in Microsoft's offices in Issy les Moulineaux - first edition for me.","readingTime":"5mn","authors":["julie"],"categories":[],"content":"\nOn November 17th took place the 9th edition of the Agile Tour Paris in Microsoft's offices in Issy les Moulineaux - first edition for me.\n\n250 people participated in this event. About 30% of them were agile coach trainers, and 50% of the participants considered themselves very good or even excellent in terms of agility. The general level of knowledge of the participants was therefore very high.\n\nMost of the day's conferences and workshops were focused on Agile coaching or advanced Agility techniques.\nWe had the choice between three workshops or a conference in a slot of 1h30. A conference was 45 minutes long, and a workshop 1h30, therefore it was either two conferences or one workshop in one and a half hour. Choosing was quite difficult !\n\nIn this post, I talk about the four conferences I enjoyed the most.\n\n----------\n\n### \"Le code de la Route Agile\" by Virgile Delécolle and Gérard Danièle\n\nThe first conference was about the “code de la Route Agile”, or “Agile’s Highway code” presented by Virgile Delécolle and Gérard Danièle. We had to answer to 30 questions about agility.\nIt was very interactive: we were all connected in a private room on Kahoot, and we answered directly on our phones. We were able to test our knowledge on agility, via more or less serious questions.\nI learned, for example, that the most commonly used agile practice was the retrospective - so do not overlook the importance of it -, or that Excel was the most used tool in Agility.\n\nI ranked 22/52 \\o/\n\n----------\n\n### \"CoP Agile .... quelques clés\" (“CoP Agile… some advice”)by Jean-Claude Grosjean\nA CoP, as for Communauty of Practices, is a group of people where the members ought to commit themselves regularly in activities of knowledge-sharing and learning based on common interests (concept by Etienne Wenger).\n\nThe presentation focused on two parts, WHY and HOW.\nHe gave us 8 pieces of advice to run the CoPs internally in a company.\nJean-Claude Grosjean concluded that CoPs are the most complicated thing to set up regarding Agility.\n\nThis allowed me to draw a parallel with how we work at Eleven Labs. We have a planetary system, a little bit like the Houses of Hogwarts: employees are separated in four different planets. However, we are not dispatched in a planet by common interest (same developing language, same interest for agility, same love for video games…) but by a wheel of fortune.\nThat being said, if one day the planets come to be reformed or if guilds of common interest are born within the planets, we will then have a model close to these CoP!\nYou can find his slides [here](https://www.slideshare.net/jcgrosjean/une-communaut-de-pratiques-agile-qui-marche?ref=http://www.qualitystreet.fr/2016/11/24/les-cles-dune-communaute-agile-qui-marche/){:rel=\"nofollow noreferrer\"}\n\n----------\n\n### \"Kata of systemic representations\", by Arnaud Gervais\n\nIf I have to retain only one thing of this day, it is \"If you do not know which conference to choose, choose the one which title you do not understand.” This conference was my favorite of all.\n\n\nArnaud Gervais is an Agile Coach. He started his presentation with a few quotes - 'the more it changes, the more it stays the same' - then he got to it.\n\nHe took the example of a facilitator who talks too much during a meeting, and all the consequences of this little matter. Then he explained the principles of circular causality and amplifying loop.\nGoing into practice, we took the example of a \"diva\" team member who works on the interesting tasks only, and then we though on the consequences of this behaviour. We came up with counterattacks and levers of actions, in order to avoid the causality of this problem.\nThis workshop was very interesting because it allowed us to map problems, to work directly on them, to de-dramatize them and to avoid conflicting viewpoints, as Arnaud Gervais said very well at the end of the workshop. Thus, one realizes the extent to which a small problem can affect a whole project or a structure only by mapping these problems, which is quite helpful !\n\n----------\n\n### \"JTBD\", by Ricardo Tome\nThis workshop was presented by Ricardo Tome, who is Lean Enterprise Coach at HSBC London and Agile Coach in a London startup, and Speaker \"where people want him\".\nThe JTBD is the acronym of Job To Be Done. It is a very advanced technique, which states that one should not think about the need, but the 'job'. The subtlety was not very easy to grasp at the beginning!\nThere are three different jobs, 'functional job', 'personal job' and 'social job'. If the two first are quite understandable and findable, the latter is the most difficult one to find, but also the most important because it is the one that plays with the emotions. Companies that understand the social job of their product tend to have more success (eg. Apple)\n\n\nHe gave us some tools to find and develop the JTBD, such as the Value Proposition Canvas or the Business Model Canvas.\nThe JTBD is a very advanced technique, very difficult to set up, especially when your job is being a Product Owner, because it is quite tough to explain the concept to clients. However, understanding the Job makes improvements on a product much easier, making the technique very interesting.\n\n----------\n\nI would have loved to participate to more conferences and workshops, such as Silvana Wasitova's \"Building Trust inside a Team\" or Christophe Heral's \"Art of Torture\". All workshops and conferences looked enlightening and entertaining, even if some of them were quite complex for a junior Product Owner like myself.\n\nI really learnt a lot of new concepts and met so much people, I hope I’ll be there next year !\n"}