{"date":"2019-05-09T00:00:00.000Z","title":"Managing translations with localise.biz","excerpt":"In this article I am going to introduce localise.biz - a SaaS tool to manage translations.","readingTime":"5mn","authors":["marishka"],"categories":[],"content":"\n## Introduction\n\nAs part of our project, we needed a translation management tool. We have 3 languages on our site, and the translations are done by the business team (marketing and other).\n\n[Localise.biz](https://localise.biz/) (aka Loco) is a SaaS online translation management service. It offers free and paid subscriptions according to the needs and the size of the project.\n\n### Setup\n\nFirst, we need to create a user account. Once our account is created, we start by creating a project and choose a main language for this project which will serve as a basis for translations. The same user can be part of several projects.\n\n![loco_create]({{site.baseurl}}/assets/2019-05-02-gestion-des-traductions-avec-localise/create.png \"create project\")\n\nWe can then add all the languages we need in our application, whether it be in a standard format, ISO2, or custom languages for more specific needs.\n\nThe interface is quite simple and intuitive.\nWith all the filters availables, it becomes easy to work on this interface without any issues.\n\n![loco_translate]({{site.baseurl}}/assets/2019-05-02-gestion-des-traductions-avec-localise/translate.png \"translate\")\n\n## Features\n\nHere are the reasons that convinced us to choose this tool.\n\n### Implementation of a translation workflow\n\nLoco allows you to manage statuses for assets (an asset is a translation key associated with its translations in all languages).\n\nThis allows us to set up a rather simple translation validation workflow.\nFor example, when the development team creates translation keys, they can put them into *Provisional* status.\n\nThen, when the translations have been done and validated by the people whose responsibility it is, the status is modified, allowing to filter on the assets that are to be translated yet, thus simplifying their work.\n\n![loco_statuses]({{site.baseurl}}/assets/2019-05-02-gestion-des-traductions-avec-localise/status.png \"statuses\")\n\nMoreover, it is possible to assign tags to assets.\nThis was useful for us to prepare releases in particular.\n\n![loco_tags]({{site.baseurl}}/assets/2019-05-02-gestion-des-traductions-avec-localise/tags.png \"tags\")\n\n### Import / export\n\nOf course, when migrating to a new solution, we do not want to create the translation keys one by one...\nLoco has a very complete import / export system with a wide range of formats (JSON, CSV, etc.).\nWe can also use all the filters in our exports. I'll let you take a look at their documentation with all the details if needed.\n\n![loco_export]({{site.baseurl}}/assets/2019-05-02-gestion-des-traductions-avec-localise/export.png \"export\")\n\n### REST API\n\nThe main reason to choose Loco for us was the [REST API](https://localise.biz/api/docs). It allows to manipulate all the data that we are able to modify with the UI (translations, locales, tags ...). In our case, we used only the retrieval of translations.\n\n## Usage\n\nWhen translation files are stored within an application, we sometimes have to deploy it only to update certain translations.\n\nWhen redesigning our website, we decided to store the translation files on a cloud storage to separate the deployment of our applications from the translations update.\n\nThus, we export the contents of Loco to store it in a *bucket* on Google Cloud Platform in JSON files (one file per language). So we have set up a cron that runs regularly on Google App Engine that takes care of that.\n\nBelow is the code:\n\n```js\nconst axios = require('axios');\nconst express = require('express');\nconst { Storage } = require('@google-cloud/storage');\n\nconst app = express();\nconst storage = new Storage({\n  projectId: 'GOOGLE_CLOUD_PLATEFORM_PROJECT_ID',\n});\n\n\napp.get('/translations/b2cwebsite', (req, res,) => {\n  const bucket = storage.bucket('YOUR_BUCKET_NAME');\n  const locales = ['en', 'fr'];\n  let status = 200;\n\n  const client = axios.create({\n    baseURL: 'https://localise.biz',\n    headers: {'Authorization': 'Loco YOUR_LOCALISE_API_KEY'}\n  });\n\n  locales.forEach(function(locale) {\n    client.get('/api/export/locale/'  + locale +  '.json')\n      .then(function (response) {\n        const file = bucket.file(`messages.${locale}.json`);\n        file.save(JSON.stringify(response.data), {\n          contentType: 'application/json',\n          public: true,\n          gzip: true,\n          resumable: false,\n          metadata: {\n            cacheControl: `public, max-age=3600`,\n          },\n        }, function(err) {\n          if (err) {\n            console.error(`Couldn't upload translations file to Google Cloud Storage for locale ${locale}: ${err}`);\n            status = 500;\n          }\n        });\n      })\n      .catch(function (error) {\n        console.error(`Couldn't fetch translations from Localise for locale ${locale}: ${error}`);\n        status = 500;\n      });\n  });\n\n  res.status(status).end();\n});\n```\n\nAs you can see, in just a few lines we get our translation files.\nJust load them into our app and you're done!\n\n## Conclusion\n\nIf you are working on a multi-language site and you are looking for a solution that would satisfy both developers and translators, Localise.biz could be right for you. This solution offers great flexibility, both in the way you manage and export translations, and in the way you manage translations on a daily basis for business users.\n"}