{"date":"2020-11-18T00:00:00.000Z","title":"Munin, Odin's own monitoring","excerpt":"Some people know Munin, the raven from northern mythology. It is in this case a distant cousin that you will discover in this article: Munin, the monitoring tool.","readingTime":"4mn","authors":["jbernard"],"categories":[],"content":"\nFor lovers of Nordic mythology, Munin and Hunin are Odin's two ravens. They watch over every corner of Midgard and then report back to their master. The application we are interested in today bears its name well because it allows monitoring and reporting of the constants of your various servers, and is called Munin as well.\nAfter a quick presentation, we will take a look at the installation process and this tool's various use.\n\n\n## 1. Presentation\n\nMunin is a self-hosted open-source application (code on GitHub) created in 2002 and still actively maintained today. It offers a lot of plugins to monitor many vital elements of your machines such as CPU or RAM usage, load-average or network interface usage. Everything is displayed via a simple and efficient web interface.\n\nThe software saves this information over time and allows a long term visualization of the evolution of the different metrics.\n\nLastly, it has the particularity to manage as many machines as you want thanks to a simple and easy to configure Master/Nodes system.\n\n## 2. Prerequisite\n\n- Have a sudo user on each machine you want to configure\n- Identify the machine where the Master will be available (in this case where the web interface will be exposed)\n\n## 3. Master installation & configuration\n\n### Installation\nLet's proceed directly to the Master installation of Munin server itself:\n\n```\nsudo apt-get update\nsudo apt-get install munin\n```\n\n### Configuration\nOnce this installation is complete, we can proceed to the configuration.\nMunin's configuration can be found in the `munin.conf` file located in at `/etc/munin`. With your favorite text editor, open this configuration file to be able to see the first options we are interested in:\n\n```\ndbdir /var/lib/munin\nhtmldir /var/www/munin\nlogdir /var/log/munin\nrundir /var/run/munin\n```\n\nThe line we are interested in is the `htmldir`. It is in this folder that the static pages and images of the web interface will be stored. Feel free to configure this path according to your needs, depending on the installation of your web server (Nginx, Apache, ...).\nThe second part of the configuration we are interested in is located below, in the same file:\n```\n[localhost.localdomain]\n    address 127.0.0.1\n    use_node_name yes\n```\n\nThis is where we will reference the master and the different nodes in order to monitor them. For example, I chose to rename my master as follows:\n\n```\n[ElevenMaster]\n    address 127.0.0.1\n    use_node_name yes\n```\n\nThe name I chose, `ElevenMaster`, will be displayed on the web interface to describe my machine, in this case the Master of our Munin infrastructure.\nAll that's left to do is to save and close the configuration file then restart the Munin service to take into account this new configuration:\n\n```\nsudo service munin-node restart\n```\n\nThe static files of the web interface should now be available in the folder indicated previously in the configuration (line `htmldir`):\n\n![](/imgs/posts/2020-04-29-munin-monitoring-odin/eleven-master.png)\n\nThe monitoring of your \"Master\" machine is now set up. Now let's see what happens next.\n\n## 4. Node's installation and configuration\n\n### Installation\n\nThe monitoring of your \"Master\" machine is now in place.\nMunin's major takeaway lies in its ability to manage for you a multitude of machines without effort. On a second machine, you just need to install the `munin-node` package and then perform two small configurations: one on the Node side, the other on the Master side.\n\nThe installation of the package first of all:\n\n```\nsudo apt-get update\nsudo apt-get install munin-node\n```\n\n\n### Configuration\n\nYou then need to configure the munin-node to authorize the Master to retrieve the required data. This is done in the configuration file `/etc/munin/munin-node.conf`, on the line authorizing the localhost:\n```\nallow ^127.0.0.1\n```\n\nThis local IP must be replaced by the public IP of the Master server, in RegExp format, which would give for example:\n\n```\nallow ^145\\.78\\.309\\.444$.\n```\n\nNow restart the Munin-node service to enable this configuration:\n\n```\nsudo service munin-node restart\n```\n\nBack to the Master for the last step. We need to add the Node in the list of monitored machines. In the Master configuration file (`/etc/munin/munin.conf`), add the Node following the Master declaration made previously. You will need to specify a name representing the Node and its IP address. Using our example from earlier:\n\n```\n[ElevenMaster]\n    address 127.0.0.1\n    use_node_name yes\n[ElevenNode]\n    address 267.117.81.341\n    use_node_name yes\n```\n\nSave, close the configuration file and once again restart the Munin service to take into account this new Node:\n\n```\nsudo service munin-node restart\n```\n\nAfter a few minutes, by the time Munin retrieves the information from the newly added Node, you should see your second machine appear in the web interface:\n\n![](/imgs/posts/2020-04-29-munin-monitoring-odin/eleven-node.png)\n\nYour instance of Munin is now fully set up. You can configure specific monitoring tools (apache, mysql, nginx, etc) at any time, thanks to [plugins from the community](http://gallery.munin-monitoring.org/).\n"}