{"date":"2021-03-08T00:00:00.000Z","title":"Women in IT","excerpt":"Today is the International Women's Rights Day, and we wanted to take the opportunity to talk to you about a subject that is close to our hearts: women in IT. The purpose of this article is to tell you about our experience to give you a better vision of why there aren't many of us, why some give up, and, above all, how to make that change.\n","readingTime":"9mn","authors":["marishka","marianne"],"categories":[],"content":"\nToday is the International Women's Rights Day, and we wanted to take the opportunity to talk to you about a subject that is close to our hearts: women in IT. Wait, wait! Don't leave right away. The purpose of this article is to tell you about our experience to give you a better vision of why there aren't many of us, why some give up, and, above all, how to make that change. So, if you too want more female colleagues, read on.\n\n## The finding\n\n### Did you know?\nIn the 1980s, almost 40% of computer science students were women. Yes, really!\n\n![40% of computer science students were women](/imgs/posts/2021-03-08-les-femmes-dans-linformatique/first.jpg)\n\nIt is not clear exactly why this trend suddenly changed, but the theory of commercials that have associated personal computers and video games with men and young boys is often put forward.\n\n### And today?\n\nToday, in France, women represent [23%](https://femmes-numerique.fr/les-chiffres-cles/) of employees in digital professions, and only 17% in development.\n\nIn my school year at university, there were about 15 women for 200 students.\n\nOut of 15, at least 6 gave up computer science during their studies or within 2 years.\n\nTo my knowledge, there are only two of us still doing software development.\n\n### How did we get here?\n\nToday still, and even in developed countries, [women are less likely than men to lead an active life, especially full time](https://www.insee.fr/fr/statistiques/4277649?sommaire=4318291#:~:text=En%202018%2C%20les%20femmes%20qui,%2C8%20%25%20pour%20les%20hommes.) - this is related to the place of women in society, which is a broader subject, but which plays a role here too.\n\nAccording to [this study](https://journals.sagepub.com/doi/abs/10.1177/0956797617741719?journalCode=pssa), paradoxically, the more egalitarian a country is, the less women orient themselves towards scientific studies.\nIn countries less well off in terms of gender equality, they engage in scientific studies to ensure a stable and lucrative career.\nConversely, in more egalitarian countries, women have more career choices, so they can leave room for their preferencies.\nThis indicates a real lack of attraction of the profession for women.\n\n**_Women who enter IT world_**\n\nSeveral factors contribute to the lack of women in IT.\n\nFirst, from the 1960s onwards, IT professions were constantly gaining prestige, salaries were attractive, and many men turned to them.\nMen were also favored during [selections in universities](https://digital-society-forum.orange.com/fr/les-actus/1134-comment-l39informatique-a-exclu-les-femmes).\n\nThen, [the appearance of personal computers widened this gap even more](https://www.ritimo.org/Les-femmes-et-l-informatique-histoire-d-une-exclusion-enjeux-de-la ). Computers were expensive, more men worked and knew how to use them, so they bought them for themselves and for their sons.\nIn addition, as mentioned above, the commercials helped reinforce the idea that computers were primarily intended for men and young boys.\nAs a result, the computer was seen as a male tool. In households, girls spent little or no time familiarizing themselves with it.\n\nWhen computers arrived in schools, girls had more difficulty than boys.\nOften, the level of the course was aligned with that of the most seasoned. As a result, girls, for lack of support, dropped out or even reoriented themselves in other fields.\n\n*Was this when the idea was born that women are less good at computer science than men? It's hard to know exactly.*\n\nAt around the same time, the image of the *geek* was built (or generalised, I should say): a young man who lacks social skills, loves video games and computers and who we find a little weird without really knowing why.\nThis image has been conveyed by movies, science fiction novels and TV series. It is also still strongly present in these media. Are you familiar with *The Big Bang Theory*?\n\nAll of this has helped create social and gender stereotypes that influence adolescents in their career choices.\nThese stereotypes are at the origin of various expectations concerning the social behavior and the academic success of women and men. And they are passed on to children from an early age, whether through families or teachers, often unconsciously.\nI invite you to read [this study](https://link.springer.com/article/10.1007/s11218-020-09551-5) if you want to know more.\n\nComputing is a world seen as masculine. Thus, nowadays, in high school (not to say middle school), there are few girls who are interested in science.\n\n**_Those who drop out_**\n\nAs we have just seen, few women choose a career in computer science.\nBut there are also [41%](https://www.ncwit.org/sites/default/files/resources/womenintech_facts_fullreport_05132016.pdf) of women who drop out of IT within the first 10 years.\n\nAmong the reasons that push them to make this decision, we can see this:\n\n![Reasons why women drop out of IT](/imgs/posts/2021-03-08-les-femmes-dans-linformatique/second.png)\n\nThere are women who experience great pressure at work related to [associating certain tasks with a given gender.](Https://hbr.org/2018/11/the-subtle-stressors-making-women-want-to-leave-engineering).\nFor example, there is always the idea that women are better than men in organization and communication skills.\nHowever, there is, at present, [no study](https://www.apa.org/action/resources/research-in-action/share) that would show that women or men are naturally more talented for a given type of task.\n\nHowever, in some companies, people still tend to ask women to take care of such tasks.\nWomen do well, so they are given more and more time for these other tasks.\nLittle by little, often in spite of themselves, women find themselves far removed from their main duties.\n\nThe problem is that other team members often tend to view these skills as less aligned with what it means to be a \"real developer / engineer\".\nWomen, therefore, feel that they have to prove themselves again on their technical skills and find their place in the team once again.\nThis situation creates pressure, adds stress to everyday life, and also impinges on the work-life balance.\n\nIn addition, women are encouraged by their superiors to upgrade their skills in positions that make them abandon development.\nAnd here is the observation:\n\n![Main IT jobs by gender](/imgs/posts/2021-03-08-les-femmes-dans-linformatique/third.png)\n\nWomen are therefore sometimes dissatisfied with their career prospects. They feel that they cannot evolve the way they would like to, and they eventually give up IT and choose another career path.\n\nAnother reason why women quit their IT profession is sexism. Unfortunately it is still very present in our society in general, and not only in IT.\nAt work, it can range from a little awkward remark once in a while to a hostile environment where women don't feel safe.\n\nWe could tell you dozens of situations that have happened to us, but if you have read the article so far, we hope you are not concerned by the subject.\nIf you're curious, [an interesting study](https://socialbuilder.org/wp-content/uploads/2018/10/Enque%CC%82te-Sexisme-dans-les-formations-nume%CC%81riques-true-or-false-.pdf) addressed the subject recently.\nFor example, it shows that 86% of women notice sexist behavior, compared to 58% of men only, so there is a fairly significant gap in the perception of events.\n\n## The change\n\n### Raise awareness from an early age\n\nToday, many schools and universities are taking actions to attract more young women to scientific fields.\nBut often, at that age it is already too late, the desire to avoid these professions is already installed.\nWe must therefore intervene earlier, as soon as possible actually, to prevent reluctance to set in.\n\nHere are some ideas of what you could do yourself.\n\nFor younger children, exposing them to science in general is a good start.\nYou are going to spend a few days with your family? Take the opportunity to do a [simple experiment](https://www.educatout.com/activites/sciences/index.html) while playing with your nieces and nephews.\n\nIf you have 12+ year old girls around you, you can introduce them to computer sciences.\nTry to help them take an interest in it, accompany them in their first steps.\nYou could tell them where to start, where to find relevant resources, and how to find help when needed.\n\nThere are hundreds of MOOCs on the internet, available for free on sites like [Coursera.org](https://www.coursera.org/), [Edx.org](https://www.edx.org/) , [Udemy.com](https://www.udemy.com/).\nMOOCs are a great way to study at your own pace, and they give access to a community where students can seek or give help.\n\nOr why not invite them to do an internship in IT if you have the possibility?\n\n### Having female mentors\n\nAnother approach to make young women want to take an interest in IT is to highlight the contributions made by other women in this field.\n\nAnd [there is a lot to cover](https://www.nytimes.com/2019/02/13/magazine/women-coding-computer-programming.html). You could tell them about Grace Hopper, Margaret Hamilton, Katherine Johnson, Shafi Goldwasser and many more.\nYou could also show them the movie *Hidden Figures* for example.\nGet them to meet your female colleagues who might encourage them to pursue a career in IT.\n\n### A healthier environment for women\n\nIn addition to increasing the number of women who join scientific fields, we must ensure that they feel good there and that they pursue this path.\nFor example, [governments are raising awareness among companies](https://travail-emploi.gouv.fr/IMG/pdf/egalite-femmes-hommes_0518.pdf) on professional equality between men and women.\nObviously, companies in the digital field are the most affected, and they are looking for women to hire.\n\nHowever, even if women are sought after (and sometimes even favored to obtain a position), male colleagues are not necessarily used to working with them.\nAccording to [a study published in 2018 by Cornell University](https://www.franceinter.fr/bien-etre/quand-le-syndrome-du-doute-permanent-revele-les-repercussions-des-stereotypes-men-women), men overestimate their abilities and performance, while women underestimate them.\nOut of habit, women will be less likely to assert their positions, and this is where attitudes will flow that do not trust them or constantly question them.\n\nTo avoid this kind of behavior, you have to adopt a certain amount of mental gymnastics, and ask yourself a few questions before any intervention:\n- Did I listen to my female colleague?\n- Does she have more experience than me on the subject?\n- Did I check for myself before intervening?\n- Do I have real reasons to question her statements?\n\nIn the same way, as a supervisor, you need to pay attention to the desires of progress of your team members, and to avoid allocating tasks to a person based on social stigmatisms and received ideas.\n\nRegarding sexist remarks that may take place at work, even if you are not the author, you can intervene.\nPointing out to the author that a comment is inappropriate and supporting the woman or women around you helps to clean up the environment, and to gradually ensure that these situations do not repeat themselves.\nIf your female colleagues feel supported, they will be less afraid to report inappropriate behaviour, will feel better overall in the team and will be able to contribute better.\n\n## The final word\n\nWomen in IT cannot improve the situation alone, and even if the governments implement actions for gender equality, it is up to each and every one of us to promote these wonderful professions, by breaking misconceptions in the eyes of young girls.\nYou can shake things up: improve everyday life, trust and give confidence to the women who you work with, as you would any colleague.\n\nWe are counting on you so that in a few years we can write an article on the increase in the number of women in IT :)\n\nSee you soon !\n"}