{"date":"2022-08-24T00:00:00.000Z","title":"Symfony, Javascript et traduction : BazingaJSTranslationBundle, comment l'utiliser avec le format ICU ?","excerpt":"Même si de plus en plus d'architectes séparent le back et le front pour qu'ils puissent évoluer indépendamment, certaines applications (souvent du legacy) implémentent le front dans l'application Symfony avec Twig et du Javascript. Nous allons refaire le point sur le fonctionnement des traductions et sur le formattage ICU.","readingTime":"6mn","authors":["marianne"],"categories":["php","javascript"],"content":"Même si de plus en plus d'architectes séparent le back et le front pour qu'ils puissent évoluer indépendamment, certaines applications (souvent du legacy) implémentent le front dans l'application Symfony avec Twig et du Javascript. Nous allons refaire le point sur le fonctionnement des traductions et sur le formattage ICU.\n\n## Comment sont gérés les traductions dans Symfony ?\nDans les nombreux composants proposés par Symfony, il y a celui qui permet de gérer les traductions : [translation](https://symfony.com/doc/current/translation.html).\n\nIl permet de générer les traductions soit par une phrase, soit par une clé dans le PHP (avec le service Translator) ou dans les twigs. Les fichiers de traductions peuvent être en YAML, XML et PHP, et l'emplacement ainsi que la langue par défaut sont définis dans la [configuration](https://symfony.com/doc/current/translation.html#configuration). Ils sont généralement nommés messages.{locale}.yaml.\n```php\n// PHP\nuse Symfony\\Contracts\\Translation\\TranslatorInterface;\n\npublic function index(TranslatorInterface $translator)\n{\n    $translatedByPhrase = $translator->trans('Symfony is great'); // phrase\n    $translatedByKey = $translator->trans('home.welcome'); // phrase\n}\n```\n\n```text\n{# Twig #}\n{% trans %}Symfony is great{% endtrans %}\n{{ welcome.home|trans }}\n```\n\n```yaml\n# translations/messages.fr.yaml\nSymfony is great: J'aime Symfony\nhome:\n    welcome: Bonjour\n```\n\n\nC'est pratique pour pouvoir gérer le texte statique, mais on peut avoir parfois besoin d'afficher des paramètres dans la phrase, ou encore de gérer les pluriels.\n\nPour cela, on peut rajouter des paramètres dans les fonctions, et Symfony possède la variable _%count%_ pour gérer les pluriels (uniquement pour des fichiers au format YAML ou PHP).\n```php\n// PHP\n$translatedWithName = $translator->trans('home.welcome', ['%name%' => $name]);\n$translatedWithCount = $translator->trans('home.notification.message', ['%count%' => $count]);\n```\n\n```text\n{# Twig #}\n{{ welcome.home|trans({'%name%': name}) }}\n{{ home.notification.message|trans({'%count%': count}) }}\n```\n\n```yaml\n# translation\nhome:\n    welcome: Bonjour %name%\n    notification:\n            message: {0}Vous n'avez aucun message|{1}Vous avez un message|]1,Inf[Vous avez %count% messages\n```\n> 👉🏻 Symfony gère les pluriels différemment en fonction de la langue : pour le français, le 0 équivaut au 1, mais pour les autres langues (hormis quelques langues spécifiques comme le russe), le 0 équivaut au pluriel. En effet, on va dire 0 message en français, mais 0 messages en anglais.\n\nIl existe plein d'autres subtilités et de configurations ainsi que des bundles propres pour gérer les solutions Saas dans la documentation officielle.\n\nD'ailleurs, ces solutions Saas utilisent un autre format que celui proposé de base par Symfony : le format ICU.\n\n## Qu'est-ce que le format ICU ?\nLe format ICU (International Components for Unicode) est un format de message largement utilisé dans de nombreux systèmes logiciels de traduction tels que localize.biz (et vous pouvez en apprendre plus sur son utilisation sur l’article [Gestion des traductions avec localise.biz](https://blog.eleven-labs.com/fr/gestion-des-traductions-avec-localise.biz/)), [phrase](https://phrase.com/), [lokalise](https://lokalise.com) ou encore [crowdin](https://crowdin.com/). Ce format permet de gérer des patterns tels que le pluriel.\n\nLe format ne fait pas varier l'utilisation et l'ordonnancement des clés des fichiers de traduction, mais les fichiers doivent être renommés messages.{locale}+intl-icu.yaml et les patterns modifiés.\n\nReprenons l’exemple plus haut d’une traduction incluant le pluriel :\n```yaml\nhome:\n    notification:\n            message: {0}Vous n'avez aucun message|{1}Vous avez un message|]1,Inf[Vous avez %count% messages\n```\nDevient en format ICU sous Symfony\n```yaml\nhome:\n    notification:\n        message: >-\n            count, plural,\n                =0     {Vous n'avez aucun message}\n                one   {Vous avez un message}\n                other {Vous avez # messages}\n            }\n```\n\n\nD’autres patterns existent : la sélection (par exemple l’indication du genre pour afficher le bon pronom), le formatage des dates, des pourcentages ou encore des affichages spécifiques des prix en fonction de la monnaie. Vous pouvez retrouver toutes les possibilités dans la [documentation de Symfony](https://symfony.com/doc/current/translation/message_format.html).\n\n\n## Pour les traductions dans le Javascript, il y a BazingaJSTranslationBundle\n[BazingaJSTranslationBundle](https://github.com/willdurand/BazingaJsTranslationBundle) sert à utiliser les traductions gérées par Symfony. Il va générer un fichier js avec l’ensemble des traductions qui vont pouvoir être ensuite utilisées dans les autres classes js.\n\nPour revenir à notre exemple de traduction sur le nombre de messages dont on doit être notifié, voici ce que cela donnerait :\n```javascript\nTranslator.trans('home.notification.message', {'%count%': countNotifications}, 'messages');\n```\n> ⚠️ Il n’est plus conseillé d’utiliser _Translator.transChoice()_: la fonction _transChoice()_ du composant Translation de Symfony a été dépréciée et supprimée en version 5.\n\nCe bundle permet d'utiliser le format ICU en incluant la librairie externe _intl-messageformat.min.js_, mais malheureusement, tout ne se passe pas comme prévu.\n\n\n## BazingaJSTranslationBundle et format ICU, que se passe-t-il ?\n\nLors d'une de mes missions, je me suis retrouvée devant deux problématiques.\n\nPour la première, il se trouve que certaines traductions comprenaient des tags HTML. Si cela ne posait aucun souci hors ICU, cela le devenait d’un coup. En comparant la version de BazingaJSTranslationBundle avec la dernière sortie et en lisant la dernière [Release Note](https://github.com/willdurand/BazingaJsTranslationBundle/releases/tag/5.0.0), je me suis rendu compte qu’il s’agissait d’un bug connu de ma version 4.*, et qu’elle était réglée en version 5.0. Une simple montée de version a donc résolu ce problème.\n\nConcernant la deuxième, elle est survenue uniquement en mode production : impossible de récupérer le fichier js des traductions ! J’avais une belle erreur 500 😱\n\nJe n'avais eu aucun souci en local, mais parce que les assets ne sont pas générés de la même façon entre la dev et la prod avec BazingaJSTranslationBundle. Pourquoi ? Parce qu’en prod, ça considère que le fichier messages.en+intl-icu.yaml est le même domaine que le fichier messages.en.yaml, et du coup, ça fonctionne !\n\nPlusieurs PRs ont été proposées mais aucune n’a été acceptée pour l’instant (on dirait que la maintenance du bundle est un peu mort), il a fallu que je trouve en [réponse d’une des PRs](https://github.com/willdurand/BazingaJsTranslationBundle/pull/322#issuecomment-975614873) un petit tour de passe-passe (sinon, il allait falloir faire un fork) : rajouter un fichier vide nommé _messages.en.yaml_ en plus du votre fichier en format ICU.\n\n## Conclusion\n\nDe plus en plus d’entreprises utilisent des solutions Saas pour gérer les traductions, et si vous devez faire une migration, vous allez devoir passer par cette passation de format de traduction. La phase est chronophage et fastidieuse, et l’existant peut réserver des surprises avec ce nouveau format. En espérant que cet article vous aura aidé soit à mettre en place des traductions, soit à faire cette migration !\n"}