{"date":"2019-01-14T00:00:00.000Z","title":"Architecture hexagonale","excerpt":"L'architecture hexagonale tend à isoler une application en trois couches distinctes","readingTime":"3mn","authors":["dsuarez"],"categories":["php"],"content":"\nL'infrastructure d'une application, les bases de données, les appels API, de même que les frameworks évoluent\nconstamment. Mais ce n'est pas forcément le cas du besoin métier.\n\nEn partant de ce principe, quelle solution est envisageable afin de rendre une application maintenable dans le temps,\nd'avoir un besoin métier complètement agnostique des choix techniques de son implémentation ?\n\nPour visualiser l’architecture hexagonale on la représente souvent par un hexagone avec au coeur de cet hexagone le\nDomain. La couche du dessus correspond à l’Application et le tout est entouré de l’Infrastructure.\n\n![hexagone]({{site.baseurl}}/assets/2019-01-14-architecture-hexagonale/hexagone.jpg)\n\nL'architecture hexagonale peut être la solution car elle tend à isoler une application en trois couches distinctes :\n\n## Domain\n\nCette couche contient les entités existantes dans le domaine. Dans cette couche on ne se soucie pas de la manière\nd’exposer les données à l’utilisateur ou de la façon dont elles seront stockées.\nLes entrées/sorties se font à l’aide d’interfaces uniquement et respectent le D du principe SOLID avec l’inversion de\ndépendance.\nPour cela il faut garder en tête que le métier ne doit dépendre de rien et donc ne jamais être lié ni à la couche\nApplication, ni à la couche Infrastructure.\n\n## Application\n\nC’est dans cette couche que l’Infrastructure va communiquer avec le Domain par le biais des interfaces. On considère\nici que la couche Application connaît le Domain mais ne doit jamais être liée à l’Infrastructure. C’est là que\npour des raisons métiers on peut enrichir, comparer, filtrer des éléments renvoyés par les interfaces du Domain sans se\nsoucier de l'implémentation côté Infrastructure.\nIl est fréquent de parler dans cette couche de Handler mais également de Use Case métier.\nLes Use Cases métier peuvent utiliser le pattern CQRS pour séparer plus finement les besoins métier d'écriture de ceux de\nlecture.\n\n## Infrastructure\n\nL’architecture hexagonale considère que le Domain se trouve au centre de l’application. De fait, la couche\nd’Infrastructure va pouvoir communiquer et invoquer les objets du Domain par le biais des interfaces.\nAttention, l’infrastructure connaît la couche Application mais non l’inverse !\nDe cette façon, si l’on souhaite changer d’API tierce, faire de la double écriture ou changer de modèle de données, il\nsuffit de recréer un adapter dédié dans la couche Infrastructure en respectant l’interface du Domain.\n\n### Avantages\n\n+ rendre le besoin métier agnostique de son implémentation technique\n+ maintenir\n+ évoluer\n+ testable sans se soucier de l'Infrastructure\n+ respecte le principe d'inversion de dépendance\n\n### Inconvénients\n\n- non recommandé pour une petite application web\n- peut paraître complexe au premier abord\n\nDans une application basée sur l’architecture hexagonale, il est moins pénible de changer de base de données. Lorsque\npar exemple on envisage de changer d’une base Oracle vers Cassandra ou lorsque que l’on souhaite faire une montée de\nversion de Symfony, le coeur de métier étant le même dans la couche Domain, on ne se préoccupe que de l’Infrastructure.\n\nBien que l’on comprenne très rapidement son utilité, l’architecture hexagonale peut prêter à confusion au premier abord et\nelle sera également déconseillée pour les besoins de petit projet.\nCependant, en travaillant dans une architecture hexagonale, il est plus aisé d’envisager la vie long termiste d’une\napplication, de la maintenir, de la tester et de réduire le couplage avec ses sources de données et avec l’exposition à\nl’utilisateur.\nLes changements techniques sont réguliers, les problématiques de montées en charge et les choix de migrations sont\nenvisagés de manière beaucoup plus sereine et paraissent moins pénibles.\nAttention cela ne veut pas dire que le métier reste figé, au contraire, c’est une manière de capitaliser sur celui-ci et\nde l’améliorer.\n\nL’architecture hexagonale peut fonctionner avec le DDD et avec le CQRS, bien que pour ce dernier il puisse\nêtre sujet à quelques adaptations.\n\nSources :\n* http://alistair.cockburn.us/Hexagonal+architecture (under reconstruction)\n* https://jeffreypalermo.com/2008/07/the-onion-architecture-part-1/\n* https://blog.cleancoder.com/uncle-bob/2012/08/13/the-clean-architecture.html\n\nPour renforcer le sujet :\n* https://blog.eleven-labs.com/fr/domain-driven-design/\n* https://blog.eleven-labs.com/fr/cqrs-pattern/\n\n"}