{"date":"2018-03-28T00:00:00.000Z","title":"Codelabs under the hood","excerpt":"À propos d'Eleven Codelabs","readingTime":"15mn","authors":["kelfarsaoui"],"categories":["javascript"],"content":"\nAprès plusieurs mois de travail acharné, nous avons le plaisir de vous annoncer la sortie d'Eleven Codelabs !\n\n![Codelabs]({{site.baseurl}}/assets/2018-03-28-codelabs-under-the-hood/codelabs.png)\n\nAu début de l'été 2017, l'idée d'une plateforme de tutoriels \"Made in Eleven Labs\" a commencé à prendre forme, en même temps que la création du projet sur github. En juillet 2017, douze astronautes se rassemblent pour brainstormer autour des features qui définiront le MVP. Le projet vise à proposer du contenu plus complet et plus didactique que les articles déjà proposés sur le [Blog](https://blog.eleven-labs.com/) : des tutoriels à suivre étape après étape.\n\n### Quelles features ?\n\nAprès la réunion de brainstorm, les features retenues sont les suivantes :\n\n- Une page d'accueil affichant un splash et la liste des cours\n- Une navigation intuitive entre les étapes des tutoriels\n- Un moteur de recherche\n- Le display des progrès de lecture de chaque cours\n\n### Organisation\n\nCodeLabs est un “side-project”, c’est à dire un projet développé par des volontaires sur leur temps libre, il faut donc s’assurer de garder la motivation après la phase de début de conception qui est toujours la plus excitante.\n\nAu delà du maintien de la motivation, pour Codelabs, nous avions un double objectif : obtenir la participation de tous et l’avancée rapide du projet. Mais alors comment concilier ces deux objectifs ? Pour en savoir plus sur la démarche adoptée, vous pouvez vous rendre sur l'article de Maxime\n\n### Static site generation\n\nCréer une application comme celle-ci implique de se confronter à des problématiques complexes, comme le fait de monter une architecture server-side, en maintenant la base de données et en utilisant des moteurs de template. Pour se soustraire à ces difficultés, nous avons opté pour une technique de génération de site statique.\n\nLe concept de génération de site statique repose sur l'aspect serverless d'une application. Quand un utilisateur appelle une page, l'application va chercher le contenu depuis des fichiers stockés en local, plutôt que depuis des scripts server-side, qui eux iraient extraire les données depuis des bases distantes. L'absence de requêtes vers des bases de données, de traitement côté serveur, et de moteurs de templates rendent l'application particulièrement rapide.\n\nTravailler avec des fichiers statiques permet de tirer avantage des features du SCM (Source Code Management, ce qui permet de controller le versioning du contenu. C'est extrêmement prometteur car en se mettant à la place d'un auteur, on  ne peut qu'apprécier la possibilité de garder une trace de l'avancement de l'écriture des tutoriels, de pouvoir rétablir une modification. Dans la pratique c'est toujours mieux de ne pas avoir à se soucier de la perte de son contenu.\n\nUn autre avantage est le fait de ne pas avoir à se soucier non plus de la securité grâce à l'aspect serverless et à l'absence de données utilisateurs, ce qui évite beaucoup de contraintes.\n\n### La stack\n\nLes choix sont multiples lorsqu'il s'agit de définir une stack pour votre projet. Mais chez Eleven Labs nous sommes assez fan de l'ecosystème React, qui rend très accessible un développement web \"moderne\", si l'on considère à quel point cela demande peu d'efforts de construire une expérience utilisateur qualitative. Nous ne couvrirons pas plus en détails cet aspect, car plusieurs articles s'attardent déjà sur React et Redux. Mais vous connaissez le principe ! Webpack, Components, Props, State, Actions, reducers... et tout le toutim.\n\n### Le Workflow\n\nNous voulions garder quelque chose de simple, donc nous avons gardé le process déjà éprouvé du blog :\n\n- Écrire les articles en Markdown\n- Stocker les fichier dans le repo (ce qui permet de bénéficier des avantages du système de Pull requests et de reviews).\n\n### La structure d'un cours\n\nUn tutoriel est structuré, dans son dossier,  par les fichiers suivants :\n\n```txt\n├── course\n|   ├── index.json\n|   ├── index.md\n|   ├── step1.md\n|   ├── step2.md\n|   ├── ...\n```\n\nLe ficher `index.json` contient les metadata d'un tutoriel, voici un exemple :\n\n```json\n{\n  \"title\": \"GraphQL with Apollo\",\n  \"permalink\": \"/en/graphql-with-apollo/\",\n  \"excerpt\": \"In this tutorial we are going to build a GraphQL server using the Apollo framework\",\n  \"slug\": \"graphql-with-apollo\",\n  \"stepTitles\": [\n    \"Introduction\",\n    \"Install GraphQL server\",\n    \"Configure the Database\",\n    \"Create GraphQL types\",\n    \"Resolve queries\",\n    \"Resolve mutations\"\n  ],\n  \"date\": \"2018-03-20\",\n  \"cover\": \"/assets/2018-03-20-graphql-with-apollo/cover.jpg\",\n  \"authors\": [\n    {\n      \"name\": \"Jonathan Jalouzot\",\n      \"username\": \"captainjojo\"\n    }\n  ]\n}\n```\n\n#### Comment charger un tutoriel ?\n\nLe chargement d'un tutoriel se fait en récupérant les fichiers Markdown via des appels `XMLHttpRequest`, le fait que les fichier soient stockés localement, permet d'y accéder statiquement. Quand un lecteur choisit un tutoriel, nous lazyloadons les fichiers `* .md` à la demande de l'utilisateur.\n\n### Génération des composants react\n\nCette partie explique la transformation du Markdown en composants react, ce qui se concrétise par le display d'un tutoriel au lecteur. Cette feature critique devait être traitée avec la plus grande attention. À cause de sa nature sensible, nous ne voulions pas d'une librairie tierce qui assumerait la transformation du Markdown en Composants, même si il en existe un bon nombre. Cette feature étant constitutive de la valeur ajoutée du projet, nous ne pouvions envisager qui puisse éventuellement avoir des problèmes lors d'upgrades, ou de se débattre avec des bugs insolvables. Nous voulions un contrôle total au fil de l'eau.\n\nManager le Markdown signifie que nous devons le parser dans quelque chose plus structuré, qui puisse facilement être interprété, dans l'optique d'avoir plus de contrôle sur notre process d'évolution des composants.\n\n#### Abstract Syntax Tree (AST)\n\n> Un \"Abstract Syntax Tree\", ou seulement \"Syntax tree\", est une représentation en arborescence de la structure syntaxique abstraite du code source écrit dans un langage de programmation.\n> Wikipedia\n\nL'AST est un concept largement répandu dans la génération de code source. Il est utilisé par les compilateurs dans l'analyse de syntaxe, à différentes fins. En premier lieu, l'analyse sémantique permet au compilateur de vérifier si un programme utilise correctement les éléments de langage. Il est aussi utilisé dans le type-checking (ex : Typescript, Flow...) and dans bien d'autres cas.\n\nDans notre contexte, AST est la représentation de la structure du Markdown. Ça fournit un moyen fiable de naviguer à travers les noeuds (Paragraphes, titres, listes...) qui composent un texte en Markdown.\n\nEn voici un exemple :\n\n```md\nhello *world*\n```\n\n\nEt son AST :\n\n```json\n{\n  \"type\": \"Document\",\n  \"children\": [\n    {\n      \"type\": \"Paragraph\",\n      \"children\": [\n        {\n          \"type\": \"Str\",\n          \"value\": \"hello \",\n          \"loc\": {\n            \"start\": { \"line\": 1, \"column\": 0 },\n            \"end\": { \"line\": 1, \"column\": 6 }\n          },\n          \"range\": [0, 6],\n          \"raw\": \"hello \"\n        },\n        {\n          \"type\": \"Emphasis\",\n          \"children\": [\n            {\n              \"type\": \"Str\",\n              \"value\": \"world\",\n              \"loc\": {\n                \"start\": { \"line\": 1, \"column\": 7 },\n                \"end\": { \"line\": 1, \"column\": 12 }\n              },\n              \"range\": [7, 12],\n              \"raw\": \"world\"\n            }\n          ],\n          \"loc\": {\n            \"start\": { \"line\": 1, \"column\": 6 },\n            \"end\": { \"line\": 1, \"column\": 13 }\n          },\n          \"range\": [6, 13],\n          \"raw\": \"*world*\"\n        }\n      ],\n      \"loc\": {\n        \"start\": { \"line\": 1, \"column\": 0 },\n        \"end\": { \"line\": 1, \"column\": 13 }\n      },\n      \"range\": [0, 13],\n      \"raw\": \"hello *world*\"\n    }\n  ]\n}\n```\n\nEn se basant sur cet AST, il devient facile de prédire ce qui se passe ensuite. On sait que parmi chaque propriété de noeud, il y a un `type`, et bien souvent une propriété `children`. Cela nous rappelle les bases du développement React (props, children). Maintenant voyons comment cela va nous aider à générer des composants React.\n\nbien sûr, nous allons créer programmatiquement des composants durant la traversée de l'AST, donc nous devrons être attentifs à la signature de certaines fonctions dans l'API React. en particulier `createElement` et `createFactory` :\n\n```ts\nfunction createElement<P>(\n    type: SFC<P> | ComponentClass<P> | string,\n    props?: Attributes & P | null,\n    ...children: ReactNode[]): ReactElement<P>;\n\nfunction createFactory<P>(type: ComponentClass<P>): Factory<P>;\n```\n\nN.B.: Il y a plusieurs signatures pour ces fonctions, mais ici j'utilise les plus classiques.\n\nComme on peut le voir, `createElement` accepte une string en tant que type, et ce doit être un \"tag name\" en HTML. Donc si on se base sur ces types dans l'AST généré, on a `Document`, `Paragraph`, `Emphasis` et `Str`. On peut alors considérer le mapping suivant :\n\n```js\nconst AST_NODES = {\n  Document: 'div',\n  Paragraph: 'p',\n  Emphasis: 'em',\n};\n```\n\nLe type `Str` est une simple string qui doit être ajoutée à l'HTML en tant que noeud de texte, de srote à ce que nous n'ayons pas de tag name à lui spécifier.\n\nNous allons utiliser `createFactory` afin de créer une fonction qui retourne un composant.\n\n```js\nconst createComponent = ast => React.createFactory(\n  class extends React.Component {\n    static displayName = ast.type;\n    static defaultProps = {};\n\n    shouldComponentUpdate() {\n      return false;\n    }\n\n    render() {\n      return React.createElement(\n        AST_NODES[ast.type], // type\n        {}, // props\n        [], // content\n      );\n    }\n  },\n);\n```\n\n`createComponent`prend un AST et retourne une usine de composants qui créé à son tour un composant react avec un props et un children vides (pour le moment). Mais comment allons nous remplir les blancs ? L'AST est une arborescence, on doit donc réfléchir en termes de récursivité. `createComponent`sera envoyé vers un loop qui parcourra le document de l'AST principal. On doit donc l'appeler encore à l'intérieur des composants qui ont des children dans le but de maintenir le parsing opérationnel jusqu'à ce qu'il atteigne les leafs (`type === ‘Str’`).\n\nMaintenant jetons un oeil à la fonction walk :\n\n```js\nfunction* walk(ast) {\n  if (ast.children) {\n    for (const child of ast.children) {\n      yield child.type === 'Str' ? child.raw : createComponent(child);\n    }\n  }\n}\n```\n\nC'est un simple loop `for of` qui rend le contenu créé, et quand il atteint un noeud Str, il rend simplement sa valeur. Donc lorsqu'on appelle `createElement`, on peut aussi appeler le walk generator, afin qu'il parse le niveau de composants suivant :\n\n```js\n  ...\n  render() {\n    return React.createElement(\n      AST_NODES[ast.type],\n      {},\n      [...walk(ast)],\n    );\n  }\n  ...\n```\n\nComme `createComponent` peut retourner à la fois une fonction (`type !== str`) ou une string (`type === str`), on ne peut pas avoir de fonctions filles d'un composant React, on doit donc les résoudre afin qu'elles puissent extraire les réels composants :\n\n```js\nconst resolveRenderer = renderer => (\n typeof renderer === 'function' ? renderer() : renderer\n);\n\n  ...\n  render() {\n    return React.createElement(\n      AST_NODES[ast.type],\n      {},\n      [...walk(ast)].map(resolveRenderer),\n    );\n  }\n```\n\n#### Comment assembler tout ça\n\n\nOn a créé une usine qui génère les composants React depuis du texte en markdown. Cette usine parse ensuite le markdown en utilisant `markdown-to-ast`, et il traverse récursivement l'arbre dans le but de créer un contenu pour chaque composant :\n\n```js\nimport React from 'react';\nimport { parse } from 'markdown-to-ast';\n\nconst AST_NODES = {\n  Document: 'div',\n  Paragraph: 'p',\n  Emphasis: 'em',\n};\n\nfunction* walk(ast) {\n  if (ast.children) {\n    for (const child of ast.children) {\n      yield child.type === 'Str' ? child.raw : createComponent(child);\n    }\n  }\n}\n\nconst resolveRenderer = renderer => (\n  typeof renderer === 'function' ? renderer() : renderer\n);\n\nconst createComponent = ast => React.createFactory(\n  class extends React.Component {\n    static displayName = ast.type;\n    static defaultProps = {};\n\n    shouldComponentUpdate() {\n      return false;\n    }\n\n    render() {\n      return React.createElement(\n        AST_NODES[ast.type],\n        {},\n        [...walk(ast)].map(resolveRenderer),\n      );\n    }\n  },\n);\n\nconst generateComponents = (md) => [...walk(parse(md))];\n\nconst components = generateComponents('hello *world*');\n\nReactDOM.render(\n  <div>\n    {components.map(renderer => renderer())}\n  </div>,\n  document.getElementById('root'),\n);\n```\n\nCe que vous venez de lire est une version très simplifiée du process de génération dans codelabs. Voyons ce que ça donne :\n\nEt voici la représentation React des composants générés :\n\n![React components result]({{site.baseurl}}/assets/2018-03-28-codelabs-under-the-hood/react-result.png)\n\nVoici le HTML correspondant :\n\n![Html result]({{site.baseurl}}/assets/2018-03-28-codelabs-under-the-hood/html-result.png)\n\n### Déploiement\n\nLe déploiement d'une application comme Codelab est assez complexe. En effet, la problématique est que les développeurs qui travaillent sur le projet sont dispersés dans tout Paris. Il faut donc avoir un [Continuous Delevery](https://continuousdelivery.com/) simple et rapide.\n\nNous avons opté, comme pour notre blog, pour un déploiement lors du merge d'une PR dans Master. Travis permet facilement d'utiliser des scripts de déploiement dans le Cloud lors de cet évènement, notre choix s'est porté sur cette solution.\n\nLe déploiement se fait en deux étapes :\n\n- d'un coté les assets (Images, mais aussi les différents tutos en markdown) dans un [Bucket Google Cloud](https://cloud.google.com/storage/)\n- de l'autre un serveur Nginx via [AppEngine](https://cloud.google.com/appengine/) qui affiche le React.\n\nDans la config travis, que vous trouverez [ici](https://github.com/eleven-labs/codelabs/blob/master/.travis.yml). Vous pouvez voir que dans la partie `deploy` nous utilisons les providers `gae` pour Google App Engine, et `gcs` pour Google Cloud Storage.\n\nC'est assez simple à mettre en place, il suffit de suivre la documentation :\n- [`gae`](https://docs.travis-ci.com/user/deployment/google-app-engine/)\n- [`gcs`](https://docs.travis-ci.com/user/deployment/gcs/)\n\nDans notre cas nous déployons dans le Bucket le dossier `_posts` qui contient les assets, ainsi que les tutos en markdown. Puis dans le App Engine, le dossier Nginx qui va déployer une machine docker avec Nginx et le code React.\n\n\n\n"}