{"date":"2016-12-01T00:00:00.000Z","title":"Créer votre premier package pour Atom","excerpt":"# Introduction à Atom","readingTime":"9mn","authors":["vcomposieux"],"categories":["javascript"],"content":"\n# Introduction à Atom\n\n[Atom](https://atom.io) est un éditeur de texte (principalement utilisé pour du code){:rel=\"nofollow noreferrer\"} multi-plateforme développé par la société GitHub et qui s'appuie sur un autre framework développé par GitHub : <a href=\"http://electron.atom.io/\">Electron</a>, qui permet de développer des applications natives pour chaque système d'exploitation à partir de code Javascript.\n\nLe grand intérêt d'Atom est qu'il peut être étendu très facilement avec un peu de code Javascript et c'est ce que nous allons voir dans cet article. Ainsi, tout le monde peut écrire son \"package\" pour Atom.\n\nAussi, sa communauté très active compte déjà un bon nombre de packages : `5 285` au moment où j'écris cet article.\nVous pouvez les retrouver à l'URL suivante : [https://atom.io/packages](https://atom.io/packages){:rel=\"nofollow noreferrer\"}\n\nSi toutefois vous ne trouvez pas votre bonheur dans les packages déjà proposés, vous pouvez alors écrire le votre et nous allons voir qu'il n'y a rien de compliqué.\n\n# Générer son premier package\n\nPour créer votre premier package, rassurez-vous, vous n'allez pas partir de rien. En effet, nous allons utiliser la commande fournie par le package `Package Generator` natif à Atom.\nPour se faire, il vous suffira de naviguer dans : `Packages` -> `Package Generator` -> `Generate Atom Package`.\n\nLors de la génération, vous pouvez choisir le langage que vous souhaitez utiliser pour développer votre package, entre `Javascript` et `Coffeescript`. Cet article est rédigé en Javascript.\n\nAtom vous ouvrira alors une nouvelle fenêtre à l'intérieur de votre nouveau package, nommé `my-package`.\n\n# Structure d'un package\n\nNous allons maintenant détailler la structure par défaut du projet :\n\n```\n├── CHANGELOG.md\n├── LICENSE.md\n├── README.md\n├── keymaps\n│   └── my-package.json         <- Raccourcis clavier enregistrés par votre package\n├── lib\n│   ├── my-package-view.js\n│   └── my-package.js           <- Point d'entrée de votre package\n├── menus\n│   └── my-package.json         <- Déclaration des menus que votre package ajoute dans Atom\n├── package.json                <- Fichier descriptif et de dépendances de votre package\n├── spec                        <- Répertoire de tests (Jasmine) de votre package\n│   ├── my-package-spec.js\n│   └── my-package-view-spec.js\n└── styles                      <- Feuilles de styles utilisées par votre package\n└── my-package.less\n```\n\nLe premier élément à renseigner est le fichier `package.json`  qui doit contenir les informations relatives à votre package tel que son nom, sa version, license, mots clés pour trouver votre package et également ses librairies de dépendances.\nNotez également la présence dans ce fichier d'une section `activationCommands`  qui vous permet de définir la commande exécutée lors de l'activation de votre package.\n\nNous avons ensuite le fichier `keymaps/my-package.json`  qui vous permet d'enregistrer des raccourcis clavier dans votre application, de façon très simple :\n\n```json\n{\n  \"atom-workspace\": {\n    \"ctrl-alt-p\": \"my-package:toggle\"\n  }\n}\n```\n\nPassons maintenant au point d'entrée de votre package. Il s'agit de ce qui se trouve dans `lib/my-package.js`.\nDans ce fichier est exporté un objet par défaut qui contient une propriété `subscriptions`  et des méthodes `activate()`  et `deactivate()`  notamment.\n\nLors de l'activation de notre package (dans la méthode `activate()` ), nous allons enregistrer dans notre propriété `subscriptions`  un objet de type [CompositeDisposable](https://atom.io/docs/api/latest/CompositeDisposable){:rel=\"nofollow noreferrer\"}  qui nous permettra d'ajouter et d'éventuellement plus tard, supprimer des commandes disponibles dans notre package :\n\n```js\nactivate(state) {\n  this.subscriptions = new CompositeDisposable();\n  this.subscriptions.add(atom.commands.add('atom-workspace', {\n    'my-package:toggle': () => this.toggle()\n  }));\n}\n```\n\nNotre commande étant enregistrée, nous pouvons dès maintenant l'exécuter en ouvrant la palette de commande : `My Package: Toggle`.\n\nCelle-ci va exécuter le code contenu dans la méthode `toggle()`  de votre classe, soit dans le package par défaut, afficher une petite fenêtre en haut de l'écran.\nVous pouvez ajouter autant de commandes que vous le souhaitez et surtout, découper votre code comme vous le sentez.\n\n## Ajouter des paramètres dans mon package\n\nVous avez la possibilité d'ajouter des paramètres à votre package et ceci est rendu possible grâce au composant [Config](https://atom.io/docs/api/latest/Config){:rel=\"nofollow noreferrer\"}</a>.\n\nIl vous suffira d'ajouter une propriété `config`  à votre classe en définissant un objet avec la définition de chaque élément que vous souhaitez voir apparaître dans vos paramètres :\n\n```json\nconfig: {\n  \"gitlabUrl\": {\n    \"description\": \"If you rely on a private Gitlab server, please type your base URI here (default: https://gitlab.com).\",\n    \"type\": \"string\",\n    \"default\": \"https://gitlab.com\"\n  }\n}\n```\n\nLa configuration offre un grand nombre de valeurs disponibles (`boolean` , `color` , `integer` , `string` , ...) ce qui permet de laisser un grand nombre de choix à vos utilisateurs.\nLes paramètres de votre package apparaîtront alors pour votre package, sous Atom :\n\n![Gitlab URL Parameter](/imgs/posts/2016-12-05-create-atom-package/gitlab-url.png)\n\nVous pourrez alors, à tout moment dans votre code, obtenir dans votre package la valeur définie par l'utilisateur (ou la valeur par défaut fournie si aucune valeur n'a été renseignée) via :\n\n```js\nlet gitlabUrl = atom.config.get('gitlabUrl');\n```\n\n# Tour d'horizon des composants\n\nVous pouvez maintenant commencer à développer votre package, nous allons donc parcourir les différents composants qui sont à votre disposition et que vous pourrez utiliser dans votre package !\n\n## TextEditor : Agissez sur l'éditeur de texte\n\nAvec le composant `TextEditor` , vous allez pouvoir insérer du texte dans votre éditeur, enregistrer le fichier, jouer sur l'historique des actions (aller en avant ou arrière), déplacer le curseur dans l'éditeur, copier/coller dans le presse-papier, jouer sur l'indentation, scroller, etc ...\nQuelques commandes en exemple, ici pour insérer du texte à une coordonnée donnée et enregistrer le fichier :\n\n```js\neditor.setCursorBufferPosition([row, column]);\neditor.insertText('foo');\neditor.save();\n```\n\n## ViewRegistry et View : Créez et affichez votre propre fenêtre\n\nCes composants vont vous permettre de créer votre fenêtre à l'intérieur d'Atom et de l'afficher.\nVous disposez d'un exemple d'utilisation du composant `View`  dans le package généré par défaut :\n\n```js\nexport default class MyPackageView {\n    constructor(serializedState) {\n      // Create root element\n      this.element = document.createElement('div');\n      this.element.classList.add('my-package');\n\n      // Create message element\n      const message = document.createElement('div');\n      message.textContent = 'The MyPackage package is Alive! It\\'s ALIVE!';\n      message.classList.add('message');\n      this.element.appendChild(message);\n    }\n\n    // ...\n}\n\nlet myPackageView = new MyPackageView(state.myPackageViewState);\nlet modalPanel = atom.workspace.addModalPanel({\nitem: myPackageView.getElement(),\nvisible: false;\n});\n\nmodalPanel.show();\n```\n\n## NotificationManager et Notification : Informez vos utilisateurs via des notifications\n\nVous avez également la possibilité de rendre des notifications dans l'éditeur de plusieurs niveaux, avec les commandes suivantes :\n\n```js\natom.notifications.addSuccess('My success notification');\natom.notifications.addInfo('My info notification');\natom.notifications.addWarning('My warning notification');\natom.notifications.addError('My error notification');\natom.notifications.addFatalError('My fatal error notification');\n```\n\n## GitRepository\n\nCelui-ci est très intéressant : vous pouvez en effet accéder à toutes les propriétés du repository Git actuellement utilisé par l'utilisateur.\nVous pourrez alors obtenir (entre autres) la branche actuellement utilisée, obtenir l'URL du remote, voir si un fichier est nouveau ou modifié ou encore accéder au diff.\n\n```js\nlet repository = atom.project.getRepositoryForDirectory('/path/to/project');\n\nconsole.log(repository.getOriginURL());               // -> git@github.com:eko/atom-pull-request.git\nconsole.log(repository.getShortHead());               // -> master\nconsole.log(repository.isStatusNew('/path/to/file')); // -> true\n```\n\n## Encore bien d'autres choses à découvrir ...\nJe vous ai présenté les composants les plus courants mais je vous invite à visiter la documentation de l'API si vous souhaitez aller plus loin : [https://atom.io/docs/api/latest/AtomEnvironment](https://atom.io/docs/api/latest/AtomEnvironment){:rel=\"nofollow noreferrer\"}\n\n# Tester votre package\n\nNous en arrivons au moment de tester notre package, et pour cela, Atom utilise [Jasmine](https://jasmine.github.io){:rel=\"nofollow noreferrer\"}\n\nVotre package vient déjà avec un fichier de test pré-défini :\n\n```js\nimport MyPackageView from '../lib/my-package-view';\n\ndescribe('MyPackageView', () => {\n  it('has one valid test', () => {\n    expect('life').toBe('easy');\n  });\n});\n```\n\n\nLes tests Jasmine doivent être structurés de la façon suivante :\n\n* `describe()`  : Une suite de test commence par une fonction describe qui prend un nom en premier argument et une fonction en deuxième argument,\n* `it()`  : Une spécification est ajoutée par ce mot clé, il doit être contenu à l'intérieur d'une suite de test,\n* `expect()`  : Il s'agit d'une assertion, lorsqu'on s'attend à avoir un résultat donné.\n\nC'est maintenant à vous de jouer et de tester votre logique applicative.\n\nVous pouvez lancer les specs via le menu d'Atom : `View`  -> `Packages`  -> `Run Package Specs`.\n\n# Publier votre package\n\nNotre package est maintenant prêt à être publié !\n\n![Publish](/imgs/posts/2016-12-05-create-atom-package/publish.gif)\n\nPour se faire, nous allons utiliser l'outil CLI installé avec Atom : `apm`.\n\nAprès avoir pushé votre code sur un repository Github, rendez-vous dans le répertoire de votre package et jouez la commande suivante :\n\n```bash\n$ apm publish --tag v0.0.1 minor\n\nPreparing and tagging a new version ✓\nPushing v0.0.1 tag ✓\n...\n```\n\nLa commande va s'occuper de créer et pusher le tag de la version spécifiée et référencer cette version sur le registry d'Atom.\nFélicitations, votre package est maintenant publié et visible à l'URL : `https://atom.io/packages/<votre-package>` !\n\n# Intégration continue\n\nAfin de vous assurer que votre package fonctionne toujours sur la version stable d'Atom mais également pour anticiper et tester également la version bêta, vous pouvez mettre en place [Travis-CI](https://travis-ci.org){:rel=\"nofollow noreferrer\"} sur le repository de votre code avec le fichier suivant :\n\n```yaml\nlanguage: objective-c\n\nnotifications:\n  email:\n    on_success: never\n    on_failure: change\n\nscript: 'curl -s https://raw.githubusercontent.com/nikhilkalige/docblockr/develop/spec/atom-build-package.sh | sh'\n\nenv:\n  global:\n    - APM_TEST_PACKAGES=\"\"\n\n  matrix:\n    - ATOM_CHANNEL=stable\n    - ATOM_CHANNEL=beta<\n```\n\n# Conclusion\n\nJe trouve personnellement qu'il s'agit d'une vraie révolution de pouvoir interagir à tel point avec l'éditeur de texte, l'outil utilisé la plupart du temps par les développeurs.\nL'API d'Atom est déjà très riche et est très simple à utiliser, c'est très certainement la raison pour laquelle la communauté offre déjà un bon nombre de packages.\n\nComme pour toute librairie, inutile de réinventer la roue et de créer des doublons dans les packages, l'idée est vraiment d'ajouter des fonctionnalités à Atom afin d'enrichir notre expérience utilisateur d'Atom.\n"}