{"date":"2019-09-11T00:00:00.000Z","title":"Domotiser son espace de travail - Partie 2","excerpt":"L'objectif de cet article est de domotiser simplement et efficacement son espace de travail avec home-assistant (partie 2).","readingTime":"7mn","authors":["pouzor"],"categories":[],"content":"\nNous avons vu dans le précédent [article]({{site.baseurl}}/fr/domotize-your-workspace/) comment configurer HA, avec le plugin Gitlab afin de créer notre premier dashboard. Cependant, nous n'avons pas vu encore grand chose en relation avec la domotique... Il est temps de s'y mettre.\n\n\n## Le plan\n\nCe qui est compliqué avec la domotique, ce n'est pas la réalisation, ni même la techno, mais bien souvent de savoir ce que l'on va faire, c'est à dire \"Comment je peux améliorer mon quotidien, de manière automatique, avec des interactions IRL\".\n\nDans ce tuto, nous allons voir comment utiliser des Philips Hue, ainsi qu'une Google Home pour \"animer\" notre open space.\n\n\nMais si jamais vous avez du temps et du budget, voici quelques autres idées :\n- Mesurer le niveau sonore de l'open space et avertir en cas de dB trop important\n- Faire couler automatiquement le café à l'heure du stand-up\n- N'éteindre les machines de dev que lorsque tout les développeurs sont partis le soir\n- Utiliser un nerf sur tourelle pour tirer automatiquement sur la personne qui fait planter la CI\n- ...\n\n\nDu coup dans ce tuto, deux use-cases :\n- Allumer une lampe de bureau, pendant 5 secondes, en fonction du statut de la CI (rouge ou vert).\n- Avoir un message vocal, via la google home, en fonction du statut de la CI.\n\n\n## Configuration du scénario Hue\n\n\nPremière étape, nous allons ajouter l'intégration Philips Hue sur notre HomeAssistant. Celle-ci existe par défaut, et lorsque vous êtes sur le même reseau wifi, nous pouvons même le configurer automatiquement avec \"l'assistant intégration\" d'HA.\n\nRendez-vous dans la partie Configuration / Intégrations / + , puis cherchez Philips Hue. Suivez la procédure affichée (pression sur le bouton sur le hub ect...).\n\n\n![](/imgs/posts/2019-09-11-domotize-your-workspace-part-2/domo-part2-1.png)\nUne fois l'installation terminée, si tout ce passe correctement, vous devriez voir l'ensemble de vos ampoules hue s'afficher. Vous pouvez les attribuer à une pièce, mais cette partie n'est pas nécessaire pour ce tuto.\n\n\n![](/imgs/posts/2019-09-11-domotize-your-workspace-part-2/domo-part2-2.png)\n\n\nPour ma part, je vais utiliser l'ampoule \"Bureau\" pour ce tuto. Pour voir votre ampoule et commencer à interagir avec elle, vous pouvez retourner sur le dashboard, puis en haut à droite, choisir \"Entités inutilisées\".\nVous devriez voir ceci :\n\n![](/imgs/posts/2019-09-11-domotize-your-workspace-part-2/domo-part2-3.png)\n\nEt si vous cliquez dessus (je vous laisse tester l'interface hue plutot fonctionnelle) :\n\n![](/imgs/posts/2019-09-11-domotize-your-workspace-part-2/domo-part2-4.png)\n\nNotre lampe étant maintenant configurée, nous allons pouvoir interagir automatiquement avec elle en fonction des résultats de la CI. Sur la [page](https://www.home-assistant.io/components/light/) de documentation des entities \"light\", nous pouvons voir que nous avons de nombreuses fonctionnalités accessibles, comme la possibilité bien sûr de pouvoir allumer/éteindre l'ampoule mais aussi de pouvoir set la couleur (rgb) ect...\n\nCela va donc se passer de nouveau dans le fichier `automations.yaml`.\n\n\n```yaml\n# automations.yaml\n- trigger:\n    platform: state\n    entity_id: sensor.test_gitlab_projet_x\n  condition:\n    - condition: state\n      entity_id: sensor.test_gitlab_projet_x\n      state: 'failed' #if CI failed\n  action:\n    - service: light.turn_on #Action to turn on light\n      data:\n        entity_id: light.bureau #entity to turn on\n        brightness: 255\n        rgb_color: [255,0,0] #red color (RGB)\n    - delay:\n        seconds: 5 #wait 5 sec\n    - service: light.turn_off #then turn off light\n      data:\n        entity_id: light.bureau\n\n- trigger:\n    platform: state\n    entity_id: sensor.test_gitlab_projet_x\n  condition:\n    - condition: state\n      entity_id: sensor.test_gitlab_projet_x\n      state: 'success'\n  action:\n    - service: light.turn_on\n      data:\n        entity_id: light.bureau\n        brightness: 255\n        rgb_color: [0,255,0]\n    - delay:\n        seconds: 5\n    - service: light.turn_off\n      data:\n        entity_id: light.bureau\n\n```\n\nOn définit donc deux nouvelles automations, une pour le 'failed' et l'autre pour le statut 'success'. Pour ces deux automations, nous allons allumer la lampe, mettre la bonne couleur en fonction du résultat de la CI, attendre 5 secondes puis éteindre la lumière.\n\nRelancez votre home assistant et attendez votre prochain commit sur gitlab. Pensez juste que le plugin Gitlab est en \"pull\" sur les données, donc il peut y avoir un peu de délai entre la fin de la CI et le lancement de l'automation.\n\n\n\n## Configuration du scénario Vocal\n\nDe la même manière que pour la partie précédente, nous allons commencer par ajouter l'élément \"Cast\" de google. Nous allons donc aller dans la partie Configuration / Intégrations / + , puis chercher \"Cast\" et suivre la procédure pour ajouter les devices Google (chromecast, home...). Dans notre cas, c'est notre Google Home qui nous intéresse.\n\n![](/imgs/posts/2019-09-11-domotize-your-workspace-part-2/domo-part2-5.png)\n\n\nEnsuite, nous allons activer le component text-to-speech dans la configuration, puis redémarrer HA.\n\n```yaml\n# configuration.yaml\n# Text to speech\ntts:\n  - platform: google_translate\n```\n\nPour tester que notre configuration est bonne, nous pouvons call le service directement depuis la page des services `http://localhost:8123/developer-tools/service`\n\n![](/imgs/posts/2019-09-11-domotize-your-workspace-part-2/domo-part2-6.png)\n\nSi tout est bon, nous pouvons donc ajouter les nouvelles automations :\n\n```yaml\n# automations.yaml\n- trigger:\n    platform: state\n    entity_id: sensor.test_gitlab_projet_x\n  condition:\n    - condition: state\n      entity_id: sensor.test_gitlab_projet_x\n      state: 'failed' #if CI failed\n  action:\n    - service: tts.google_translate_say\n      entity_id: \"all\"\n      data:\n        message: 'ah ah ah, you didn't say the magic word'\n    - service: light.turn_on #Action to turn on light\n      data:\n        entity_id: light.bureau #entity to turn on\n        brightness: 255\n        rgb_color: [255,0,0] #red color (RGB)\n    - delay:\n        seconds: 5 #wait 5 sec\n    - service: light.turn_off #then turn off light\n      data:\n        entity_id: light.bureau\n\n- trigger:\n    platform: state\n    entity_id: sensor.test_gitlab_projet_x\n  condition:\n    - condition: state\n      entity_id: sensor.test_gitlab_projet_x\n      state: 'success'\n  action:\n    - service: tts.google_translate_say\n      entity_id: \"all\"\n      data:\n        message: 'GG, it's all Green ready to prod'\n    - service: light.turn_on\n      data:\n        entity_id: light.bureau\n        brightness: 255\n        rgb_color: [0,255,0]\n    - delay:\n        seconds: 5\n    - service: light.turn_off\n      data:\n        entity_id: light.bureau\n```\n\nPlus d'informations sur le [tts](https://www.home-assistant.io/components/tts/)\n\n\nC'est tout pour ce tuto, vous pouvez trouver les sources du code sur [github](https://github.com/eleven-labs/home-assistant/tree/part-2)\n"}