{"date":"2017-06-28T00:00:00.000Z","title":"Envoyer des push notifications via Amazon SNS en Swift 3","excerpt":"Envoyer des push notifications via Amazon SNS en Swift 3","readingTime":"15mn","authors":["ibenichou"],"categories":[],"content":"\nAujourd’hui, nous allons nous intéresser aux push notifications sur iOS à partir d’Amazon SNS en swift 3.\n\n*Prérequis* :\n\n* Avoir un compte Apple développeur ;\n* Avoir un compte Amazon\n\nPour info, pas de panique, la phase théorique est longue mais nécessaire afin que vous compreniez bien la logique derrière tout ça (personnellement, je préfère voir l’ensemble et comprendre le pourquoi du comment, au lieu de reproduire bêtement sans réellement comprendre ce que je fais).\n\n# Sommaire\n\n* Qu’est ce que les push notifications ?\n* APNs\n* Application\n* Configuration Apple\n* Amazon SNS\n* Conclusion\n\n# Qu’est ce que les push notifications ?\n\nBon à part si votre téléphone est un 3310 (best phone ever <3 ), vous avez obligatoirement eu l’occasion de recevoir une notification de la part d’une application. Aujourd’hui, cette fonctionnalité est très utilisée par la plupart des applications, donc il est “indispensable” de savoir comment ça marche et comment la mettre en place. Rassurez-vous, nous allons voir tout ça ensemble.\n\nIl existe deux types de push notifications:\n\n1. **Locale** : : votre application configure les détails de notifications localement et transmet ses informations au système qui gère la livraison de la notification lorsque celle-ci n’est pas au premier plan (foreground) ;\n2. **Remote** (distante) : avec les notifications à distance, vous utilisez l’un de vos serveur pour envoyer les données à vos utilisateurs via le **service Apple Push Notification** (APNs).\n\nPour l’utilisateur, il n’y a pas de différence entre une notification dite “locale” et une notification dite “à distance”. Les deux types de notifications ont la même apparence par défaut.\n\nVous pouvez personnaliser l’apparence dans certains cas, mais surtout vous choisissez comment vous souhaitez que l’utilisateur soit informé. Plus précisément, vous choisissez l’une des options suivantes pour la livraison de la notification :\n\n* Une alerte ou une bannière sur écran ;\n* Un badge sur l’icône de votre application ;\n* Un son qui accompagne une alerte, une bannière ou un badge.\n\n*À noter* : il faut toujours utiliser les notifications “locales” et “à distance” judicieusement pour éviter d’agacer l’utilisateur. Le système permet aux utilisateurs d’activer et de désactiver la présentation des alertes, des sons et des badges par application.\n\nBien que les notifications puissent toujours être envoyées à votre application, le système notifie l’utilisateur uniquement aux options actuellement activées. Je m’explique, si l’utilisateur désactive complètement les notifications, les APNs ne fournissent pas les notifications de votre application sur le périphérique de l’utilisateur et la programmation des notifications locales échoue toujours.\n\n# Apns\n\nApple nous indique qu’il s’agit d’un service robuste, sécurisé et hautement efficace pour les développeurs afin de propager des informations aux périphériques iOS.\n\nLors du lancement initial de votre application sur l’iphone d’un utilisateur, le système établit automatiquement une connexion IP accréditée, chiffrée et persistante entre votre application et l’APNs. Cette connexion permet à votre application d’effectuer une configuration pour lui permettre de recevoir des notifications.\n\nL’autre partie de la connexion permet l’envoi de notifications. Le “canal” persistant et sécurisé entre un serveur provider et les APNs nécessite une configuration dans votre compte de développeur en ligne et l’utilisation de certificats cryptographiques fournis par Apple. Un serveur provider est un serveur que vous déployez, gérez et configurez pour fonctionner avec les APNs.\n\n<img src=\"/imgs/posts/2017-06-28-push-notification-ios-amazon-sns/remote_notif_simple_2x.png\" />\n\n1. Votre provider peut envoyer des demandes de notification aux APNs ;\n2. Les APNs transmettent les payloads de notification correspondants à chaque périphérique ciblée ;\n3. À la réception d’une notification, le système fournit le payload à l’application appropriée sur l’appareil et gère les interactions avec l’utilisateur.\n\nSi une notification arrive et que l’appareil est sous tension mais que l’application ne fonctionne pas, le système peut alors toujours afficher la notification.\n\nToutefois, si l’appareil est éteint lorsque les APNs envoient une notification, les APNs retiennent la notification et tentent de la renvoyer plus tard.\n\nVotre provider a les responsabilités suivantes pour échanger avec les APNs :\n\n* Recevoir via l’APNs, des tokens uniques et spécifiques par device ainsi que d’autres données pertinentes provenant des instances de votre application sur les devices utilisateurs ;\n* Déterminer, selon la conception de votre système de notification lorsque des notifications à distance doivent être envoyées à chaque appareil ;\n* Création et envoi de demandes de notification aux APNs. Chaque demande contient un payload et des informations de livraison. Les APNs fournissent ensuite les notifications correspondantes aux appareils visés en votre nom ;\n\nBien évidemment vous pouvez avoir plusieurs providers\n\n<img src=\"/imgs/posts/2017-06-28-push-notification-ios-amazon-sns/remote_notif_multiple_2x.png\" />\n\nVous l’aurez vite compris : c’est un sujet vaste et complexe. Rassurez-vous, il existe énormément de services qui vous facilitent la tâche concernant la partie provider.\n\nVoici une petite liste non exhaustive des services les plus répandus :\n\n* Firebase (Gratuit)\n* Amazon Simple Notification Service – SNS (0,50 USD par million)\n* Urbanairship\n* Twilio\n* …\n\nDans notre article, nous allons utiliser Amazon SNS. Amazon propose des services très utilisés par les devops afin, pour la plupart du temps, de créer l’architecture serveur de votre projet. C’est donc plus simple de centraliser tous vos services.\n\nAvant de configurer Amazon, nous allons coder un peu l’application. C’est parti !\n\n# Application\n\nVotre application doit être configurée au moment du lancement pour prendre en charge les notifications distantes. Plus précisément, vous devez configurer votre application à l’avance si elle fait l’une des opérations suivantes :\n\n* Affiche les alertes, émet des sons ou badges d’icône en réponse à une notification d’arrivée ;\n* Affiche des boutons d’action personnalisés avec une notification.\n\nCela signifie que vous devez configurer votre support de notification au plus tard dans l’application via la méthode `didFinishLaunchingWithOptions`.\n\nCréez une “Single View Application” sous Xcode\n\n<img src=\"/imgs/posts/2017-06-28-push-notification-ios-amazon-sns/create_app_xcode.png\" />\n\nEnsuite, il va falloir activer les notifications de votre application. Pour cela, il suffit de cliquer dans la rubrique “Capabilities” et d’activer “Push notifications”, et pour finir dans “Background Modes”, checker “Remote notifications”.\n\n<img src=\"/imgs/posts/2017-06-28-push-notification-ios-amazon-sns/conf_push_xcode.png\" />\n\nRappel :\n\nChaque fois que votre application se lance, elle doit s’inscrire auprès des APNs. Les méthodes à utiliser sont différentes selon la plate-forme, mais dans tous les cas, cela fonctionne de cette manière :\n\n1. Votre application demande à être enregistrée auprès des APNs ;\n2. Lors d’une inscription réussie, l’APNs envoie un jeton de périphérique spécifique à l’appareil ;\n3. Le système délivre le device à votre application en appelant une méthode dans votre délégué d’application ;\n4. Votre application envoie le jeton du périphérique au fournisseur associé de l’application.\n\nRécupérer le token auprès des APNs.\n\nPour initialiser l’enregistrement auprès des APNs, il suffit d’appeler la méthode registerForRemoteNotifications` de l’objet UIApplication.\n\nAppelez cette méthode au moment du lancement dans le cadre de votre séquence de démarrage normale. La première fois que votre application appelle cette méthode, l’objet de l’application contacte les APNs et demande le jeton du périphérique spécifique à l’application en votre nom.\n\nLe système appelle de manière asynchrone l’une des deux méthodes de délégation d’application suivantes, selon le succès `didRegisterForRemoteNotificationsWithDeviceToken` ou l’échec `didFailToRegisterForRemoteNotificationsWithError`.\n\nL’objet de l’application contacte les APNs uniquement lorsque le jeton du périphérique a changé. Si votre device token change pendant que votre application tourne, l’objet de l’application appelle la méthode `didRegisterForRemoteNotificationsWithDeviceToken`.\n\n**Attention : /!\\ CECI NE MARCHE PAS SUR SIMULATEUR /!\\ Veuillez brancher votre iphone pour tester votre code.**\n\n```swift\nimport UserNotifications\n\n// ...\n\nfunc application(_ application: UIApplication, didFinishLaunchingWithOptions launchOptions: [UIApplicationLaunchOptionsKey: Any]?) -> Bool {\n    // Override point for customization after application launch.\n\n    // Configure les interactions utilisateur\n    self.configureUserInteractions()\n\n    // Enregistrement avec les APNs\n    UIApplication.shared.registerForRemoteNotifications() // L'objet application = UIApplication.shared (singleton)\n\n    return true\n}\n\nfunc application(_ application: UIApplication, didRegisterForRemoteNotificationsWithDeviceToken deviceToken: Data) {\n    // ...\n\n    // Envoi le token vers votre serveur.\n    print(\"\\n\\n /**** TOKEN DATA ***/ \\(deviceToken) \\n\\n\")\n\n    let deviceTokenString = deviceToken.reduce(\"\", {$0 + String(format: \"%02X\", $1)})\n    print(\"\\n\\n /**** TOKEN STRING ***/ \\(deviceTokenString) \\n\\n\")\n    self.forwardTokenToServer(token: deviceTokenString)\n}\n\nfunc application(_ application: UIApplication, didFailToRegisterForRemoteNotificationsWithError error: Error) {\n    print(\"Error: \\(error.localizedDescription)\")\n}\n\nfunc application(_ application: UIApplication, didReceiveRemoteNotification userInfo: [AnyHashable : Any]) {\n    print(userInfo)\n}\n\n// ...\n\n// MARK: Send Token to server\nextension AppDelegate {\n    func forwardTokenToServer(token: String) {\n        // ...\n    }\n}\n\n// MARK: User interactions\nextension AppDelegate {\n    func configureUserInteractions() {\n        // iOS 10 support\n        if #available(iOS 10, *) {\n            UNUserNotificationCenter.current().requestAuthorization(options:[.badge, .alert, .sound]){ (granted, error) in }\n\n            return\n        }\n\n        // iOS 8/9 support\n        UIApplication.shared.registerUserNotificationSettings(UIUserNotificationSettings(types: [.badge, .sound, .alert], categories: nil))\n    }\n}\n```\n\nDans la méthode `didFinishLaunchingWithOptions`, je fais appel à une méthode custom (configureUserInteractions) afin de demander l’autorisation à l’utilisateur de recevoir des notifs de l’application. On remarquera que dans cette méthode j’ai ajouté une condition en fonction de la version de l’OS de l’iphone.\n\n*A noter* : depuis iOS10, un nouveau framework appelé UserNotifications a été introduit et doit être importé au début afin d’avoir accès à la classe `UNUserNotificationCenter`.\n\nJe me suis permis également d’ajouter un petit bout de code (dans didRegisterForRemoteNotificationsWithDeviceToken) afin de printer le token reçu par l’APNs.\n\nLorsque votre application reçoit une push notification c’est par la méthode `didReceiveRemoteNotification`. Cependant cette méthode existe sous la forme fetchCompletionHandler, qui permet de gérer le cas background.\n\nC’est à vous de développer la logique réelle qui s’exécute lorsqu’une notification génère une interaction. Par exemple, si vous avez une application messenger, une notification push « nouveau message » doit ouvrir la page de discussion pertinente et faire apparaître la liste des messages à partir du serveur. Utilisez userInfo qui contiendra toute donnée que vous envoyez à partir de votre backend d’application, tel que l’ID de chat, dans l’exemple de messagerie.\n\n# Configuration Apple\n\nComme mentionné plus haut, nous devons générer un certificat SSL pour le client de notification push qui permet à votre provider de notification de se connecter aux APNs.\n\nNb : Chaque App ID est requis pour avoir son propre certificat SSL client.\n\nLe certificat SSL client généré est un certificat universel qui permet à votre application de se connecter aux environnements de développement et de production.\n\nPour générer un certificat SSL de client universel, il faut :\n\n1. Accéder à Certificates\n2. Cliquer sur le button (+) à droite\n<img src=\"/imgs/posts/2017-06-28-push-notification-ios-amazon-sns/ios_notif_cert01.png\" />\n3. Sélectionner dans la partie développement “Apple Push Notification service SSL (Sandbox)” et cliquer sur “Continue”. Bien évidemment, si vous devez mettre en production vous devez sélectionner la partie “production”.\n<img src=\"/imgs/posts/2017-06-28-push-notification-ios-amazon-sns/capture-d-ecran-2017-05-01-a-17.31.52.png\" />\n4. Choisir L’App ID qui match avec votre bundle ID et cliquer sur “Continue”.\n<img src=\"/imgs/posts/2017-06-28-push-notification-ios-amazon-sns/capture-d-ecran-2017-05-01-a-17.37.58.jpg\" />\n<img src=\"/imgs/posts/2017-06-28-push-notification-ios-amazon-sns/capture-d-ecran-2017-05-01-a-17.35.17.jpg\" />\n5. Apple vous demande de créer un “Certificate Signing Request” (CSR)\nPour générer manuellement un certificat, vous avez besoin d’un fichier de demande de signature de certificat (CSR) à partir de votre Mac.\nPour créer un fichier CSR, suivez les instructions ci-dessous:\n    1. Ouvrez l’application “Keychain Access”.\n    2. Cliquez sur Trousseaux > Assistant de certification > Demandez un certificat à une autre autorité de certificat (cf: screenshot)\n    <img src=\"/imgs/posts/2017-06-28-push-notification-ios-amazon-sns/capture-d-ecran-2017-05-01-a-17.56.30.jpg\" />\n    3. Dans la fenêtre Informations sur le certificat, entrez les informations suivantes :\n        1. Votre adresse email\n        2. Dans le champ Nom commun, créez un nom pour votre clé privée (par exemple, Pepito Dev Key).\n        3. Le champ Adresse de l’adresse CA doit être laissé vide.\n        4. Pour “La requête est”, selectionnez “Enregistrée sur le disque”\n        5. Cliquez sur continuer\n6. Uploader votre fichier .certSigningRequest précédemment créé.\n7. Votre certificat est prêt, téléchargez-le.\n<img src=\"/imgs/posts/2017-06-28-push-notification-ios-amazon-sns/capture-d-ecran-2017-05-01-a-18.05.22.jpg\" />\n\nEncore un effort c’est presque fini !\n\nMaintenant, nous devons transformer notre fichier aps_development.cer en fichier .p12 pour Amazon SNS, afin que celui-ci le convertisse en .pem.\nPour se faire, c’est très simple :\n\n1. Double-cliquez sur votre fichier précédemment créé. Ça l’ajoutera dans votre application Keychain.\n<img src=\"/imgs/posts/2017-06-28-push-notification-ios-amazon-sns/capture-d-ecran-2017-05-01-a-18.13.54.jpg\" />\n2. Clique droit sur celui-ci et cliquez sur Exporter\n<img src=\"/imgs/posts/2017-06-28-push-notification-ios-amazon-sns/capture-d-ecran-2017-05-01-a-19.09.52.png\" />\n3. Choisissez bien le format .p12, puis l’application Keychain vous demandera un mot de passe.\n<img src=\"/imgs/posts/2017-06-28-push-notification-ios-amazon-sns/capture-d-ecran-2017-05-01-a-18.18.55.png\" />\n\nBien évidemment vous pouvez utiliser openssl en cli afin d’exporter votre .cer en .pem :\n\n```shell\n$ openssl x509 -in aps_development.cer -inform DER -out myapnsappcert.pem\n```\n\nPour vérifier que tout est en ordre, il suffit d’aller sur la liste des App IDs, de cliquer sur l’ID de votre App puis sur “Edit”. Dans la partie Push notification, vous devriez voir que vous avez bien un certificat dans la partie Development.\n<img src=\"/imgs/posts/2017-06-28-push-notification-ios-amazon-sns/capture-d-ecran-2017-05-01-a-18.22.00.png\" />\n\n\nEnfin fini ! Je vous l’accorde cette partie est fastidieuse et lourde. Il ne manque plus que la partie Amazon SNS.\n\n# Amazon SNS\n\nAmazon SNS est un service web qui coordonne et gère la diffusion ou l’envoi de messages à des clients ou à des endpoints abonnés. Il existe deux types de clients :\n\n1. Les éditeurs (publishers), également appelés producteurs (producers) ;\n2. Les abonnés (subscribers), également appelés consommateurs (consumers).\n\nLes publishers communiquent de façon asynchrone avec les subscribers en produisant et en envoyant un message à une rubrique (topic), qui est un point d’accès logique et un canal de communication.\n\nLes subscribers (par exemple, des serveurs web, des adresses e-mail, des files d’attente Amazon SQS, des fonctions AWS Lambda) consomment ou reçoivent le message ou la notification via l’un des protocoles pris en charge (Amazon SQS, HTTP/S, e-mail, SMS, Lambda) lorsqu’ils sont abonnés au topic.\n\n<img src=\"/imgs/posts/2017-06-28-push-notification-ios-amazon-sns/sns-how-works.png\" />\n\nLorsque vous utilisez Amazon SNS, vous créez une rubrique (topic) et définissez des stratégies d’accès à cette dernière de manière à déterminer quels publishers et subscribers peuvent communiquer avec le topic.\n\nLes publishers envoient des messages aux topics qu’ils ont créés ou à ceux sur lesquels ils sont autorisés à publier. Plutôt que d’inclure l’adresse d’une destination spécifique dans chaque message, les publishers envoient un message au topic. Amazon SNS établit une correspondance entre le topic et la liste des abonnés à ce topic, puis remet le message à chacun d’eux.\n\nChaque topic possède un nom unique qui identifie le point de terminaison d’Amazon SNS de manière à ce que les publishers puissent publier des messages et que les subscribers puissent s’inscrire pour recevoir des notifications.\n\nLes subscribers reçoivent tous les messages publiés dans les topics auxquels ils sont abonnés, et tous les subscribers à un topic reçoivent les mêmes messages.\n\n**Etape 1: Création d’un topic**\n1. Connectez-vous à la console AWS , cliquez sur “Create topic”\n\n<img src=\"/imgs/posts/2017-06-28-push-notification-ios-amazon-sns/sns_c_app.jpg\" />\n\n2. Renseignez un nom.\n\n**Etape 2 : Inscription de votre application mobile auprès d’Amazon SNS**\n\n1. Cliquez sur “Create platform application”\n\n<img src=\"/imgs/posts/2017-06-28-push-notification-ios-amazon-sns/sns_c_s.jpg\" />\n\n2. Indiquez un nom à votre application\n3. Dans la zone “Push notification platform”, sélectionnez la plateforme auprès de laquelle l’application est inscrite. Dans notre cas nous choisissons “Apple development”.\n4. Dans la zone “Push certificate type”, sélectionnez “iOS push certificate”\n5. Choisissez le fichier .p12 créer ultérieurement\n6. Entrez votre mot de passe et cliquez sur “load credentials”\n<img src=\"/imgs/posts/2017-06-28-push-notification-ios-amazon-sns/capture-d-ecran-2017-05-01-a-19.19.53.jpg\" />\n\n**Etape 3 : Ajoutez notre token à notre application**\n\nAvant de nous abonner à un topic, il faut ajouter notre token généré à notre application.\n\nConnectez votre iphone, buildez votre projet et vous verrez votre token dans la console.\n\nPour ajouter votre token :\n\n1. Ouvrez la console AWS ;\n2. Allez dans la rubrique Application et sélectionnez votre application précédemment créée ;\n3. Cliquez sur  “Create platform endpoint” et ajoutez votre token.\n\nUne fois votre token enregistré, veuillez copier l’Endpoint ARN qui nous servira pour la partie suivante.\n\n**Etape 4 : Abonnement à un topic**\n\nPour recevoir les messages publiés dans un topic, vous devez abonner un endpoint à ce topic. Un endpoint est une application mobile, un serveur web, une adresse e-mail ou une file d’attente Amazon SQS.. qui peut recevoir des messages de notification d’Amazon SNS. Une fois que vous avez abonné un endpoint au topic et que l’abonnement est confirmé, le endpoint reçoit tous les messages publiés dans ce topic.\n\n1. Ouvrez la console AWS ;\n2. Cliquez sur la rubrique topic et sélectionnez votre topic ;\n3. Cliquez sur “Create subscription”, sélectionnez comme protocol application et collez votre Endpoint ARN.\n\n**Etape 5 : Publier un message**\n\nRien de plus simple, il vous suffit de sélectionner votre topic et de cliquer sur publish.\n\nAmazon met à votre disposition un json generator si vous ne savez pas comment écrire le payload.\n\nRésultat :\n\n<img src=\"/imgs/posts/2017-06-28-push-notification-ios-amazon-sns/img_0562.png\" />\n\n# Conclusion\n\nLa mise en place de push notifications n’est pas un sujet hyper complexe, mais nécessite néanmoins un peu de connaissances. Une fois que vous avez compris le système de certificat (.pem/.p12) qui permet d’identifier chaque application, le reste est plutôt simple (pour l’exemple que j’ai utilisé).\n"}