{"date":"2015-10-16T00:00:00.000Z","title":"generator-gulp-angular 1.0.0 stable released","excerpt":"Intro","readingTime":"3mn","authors":["mehdy"],"categories":["javascript"],"content":"\nIntro\n=====\n\nIt has now been more than a year since I ([@Swiip](https://twitter.com/Swiip)), quickly followed by [@zckrs](https://twitter.com/Zckrs), started working on our Yeoman generator. Today we’re celebrating the release of our first major and stable version : [generator-gulp-angular 1.0.0](https://www.npmjs.com/package/generator-gulp-angular){:rel=\"nofollow noreferrer\"}.\n\nAt first we simply wanted to make a good merge of [generator-gulp-webapp](https://github.com/yeoman/generator-gulp-webapp) and [generator-angular](https://github.com/yeoman/generator-angular){:rel=\"nofollow noreferrer\"} as I worked on Angular and got tired of Grunt's verbosity. Then, the project popularity started to increase and so did its ambition.\n\nPhilosophy\n==========\n\nWe followed all the precepts of Yeoman adding our own:\n\n-   Provide a well written seed project following the best recommendations in terms of folder structure and code style.\n-   Offer lots of options to enable the user to start instantly with the best tooling and optimization adapted to the latest technologies.\n-   Use the concept of automatic injection in different parts of the project: scripts tags both vendor and sources in the index.html, styles files, vendor, css or preprocessed.\n-   Provide a test coverage, as perfect as possible, of the code of the generator but also of the generated code.\n\nTechnologies supported\n======================\n\nWe are not joking around when we talk about this being a stable version. We integrated lots of technologies and languages, from Coffee to Typescript, from Sass to Stylus. The amount of combinations exceeds several millions! We wrote tests, documentation and fixed issues for 12 minor versions and 2 release candidates, to be able to deliver a perfectly configured seed project, no matter the options you choose.\n\n![technologies-gga](/imgs/posts/2015-10-16-generator-gulp-angular-1-0-0-stable-released/generator-gulp-angular-logo.png)\n\nOptimization served\n===================\n\nWe integrated many optimizations for your web application using some Gulp plugins :\n\n-   *browserSync*: full-featured development web server with livereload and devices sync\n-   *ngAnnotate*: convert simple injection to complete syntax to be minification proof\n-   *angular-templatecache*: all HTML partials will be converted to JS to be bundled in the application\n-   *ESLint*: The pluggable linting utility for JavaScript\n-   *watch*: watch your source files and recompile them automatically\n-   *useref*: allow configuration of your files in comments of your HTML file\n-   *uglify*: optimize all your JavaScript\n-   *clean-css*: optimize all your CSS\n-   *rev*: add a hash in the file names to prevent browser cache problems\n-   *karma*: out of the box unit test configuration with karma\n-   *protractor*: out of the box e2e test configuration with protractor\n\n2.0.0 on the road...\n====================\n\nBut the v1 is not the end of the road. While maintaining the v1 branch, we started a new Github organization called [FountainJS](https://github.com/FountainJS){:rel=\"nofollow noreferrer\"} targeting a futuristic v2 version. As the context of the build tools has greatly evolved over a year, it will be a reboot of the code base.\nThe major selling point will be to use Yeoman's generators composition, to upgrade to Gulp 4 and to write it in ES6. Finally, I hope to open new horizons in terms of options: dependency management for sure, but also, why not Web frameworks (someone talked about React?) and also a backend.\n\nGo try out [generator-gulp-angular](https://www.npmjs.com/package/generator-gulp-angular) v1.0.0 release! Any feedbacks, issues, or investment on the new  [FountainJS](https://github.com/FountainJS) project will always be appreciated. [generator-gulp-angular-logo](https://www.npmjs.com/package/generator-gulp-angular){:rel=\"nofollow noreferrer\"}\n\n"}