{"date":"2019-05-02T00:00:00.000Z","title":"Gestion des traductions avec localise.biz","excerpt":"Dans cet article je vais vous présenter localise.biz - un outil de gestion de traduction en SaaS.","readingTime":"5mn","authors":["marishka"],"categories":[],"content":"\n## Introduction\n\nDans le cadre de notre projet, nous avions besoin d'un outil de gestion de traduction. Nous avons 3 langues sur notre site, et les traductions sont faites par l'équipe métier (marketing et autre).\n\n[Localise.biz](https://localise.biz/) (Loco pour les familiers) est un service SaaS de gestion de traduction en ligne. Il propose des abonnements gratuits et payants selon les besoins et la taille du projet.\n\n### Mise en place\n\nTout d'abord, il faut créer un compte utilisateur. Une fois notre compte créé, nous commençons par créer un projet et choisissons une langue principale pour ce projet qui servira de base pour les traductions. Un même utilisateur peut faire partie de plusieurs projets.\n\n![loco_create]({{site.baseurl}}/assets/2019-05-02-gestion-des-traductions-avec-localise/create.png \"create project\")\n\nNous pouvons ensuite ajouter toutes les langues dont nous avons besoin dans notre application, que ce soient des langues au format standard, ISO2, ou custom pour des besoins un peu plus spécifiques.\n\nL'interface est assez simple et intuitive, et il est facile de travailler dessus sans s'y perdre grâce à tous les filtres disponibles.\n\n![loco_translate]({{site.baseurl}}/assets/2019-05-02-gestion-des-traductions-avec-localise/translate.png \"translate\")\n\n## Fonctionnalités\n\nVoici les raisons qui nous ont convaincus de choisir cet outil.\n\n### Mise en place d'un workflow de traduction\n\nLoco permet de gérer des statuts pour les assets (un asset étant une clé de traduction associée aux traductions dans toutes les langues).\n\nCeci nous permet de mettre en place un flux de validation des traductions assez simple.\nPar exemple, lorsque l'équipe de développement crée les clés de traduction, elle peut les mettre en statut *Provisional*.\n\nEnsuite, lorsque les traductions ont été faites et validées par les gens dont c'est la responsabilité, le statut est modifié, permettant ainsi de filtrer sur les assets qui sont à traduire et en simplifiant leur travail.\n\n![loco_statuses]({{site.baseurl}}/assets/2019-05-02-gestion-des-traductions-avec-localise/status.png \"statuses\")\n\nDe plus, il est possible d'assigner des tags aux assets.\nCeci nous a été utile pour préparer les releases notamment.\n\n![loco_tags]({{site.baseurl}}/assets/2019-05-02-gestion-des-traductions-avec-localise/tags.png \"tags\")\n\n### Import / export\n\nBien sûr, lorsqu'on migre sur une nouvelle solution, on n'a pas envie de créer les clés de traduction une par une...\nLoco a un système d'import / export d'assets très complet avec un large choix de formats (JSON, CSV, etc.).\nOn peut aussi utiliser tous les filtres dans nos exports. Je vous laisse regarder leur documentation avec tous les détails si besoin.\n\n![loco_export]({{site.baseurl}}/assets/2019-05-02-gestion-des-traductions-avec-localise/export.png \"export\")\n\n### API REST\n\nLa raison principale de choisir Loco a été [l'API REST](https://localise.biz/api/docs). Elle permet de manipuler toutes les données sur lesquelles nous avons la main (les traductions, les locales, les tags...). Dans notre cas, nous n'avons utilisé que la récupération des traductions.\n\n## Utilisation\n\nLorsque les fichiers de traduction sont stockés au sein d'une application, il nous arrive de devoir la déployer uniquement pour mettre à jour certaines traductions.\n\nLors de la refonte de notre site, nous avons fait le choix de stocker les fichiers de traduction sur un storage en cloud pour dissocier le déploiement de nos applications de la mise à jour des traductions.\n\nAinsi, nous exportons le contenu de Loco pour le stocker dans un *bucket* sur Google Cloud Plateform dans des fichiers au format JSON (un fichier par langue). Nous avons donc mis en place un cron qui tourne régulièrement sur Google AppEngine qui s'occupe de ça.\n\nVoici le code associé :\n\n```js\nconst axios = require('axios');\nconst express = require('express');\nconst Storage = require('@google-cloud/storage');\n\nconst app = express();\nconst storage = new Storage({\n  projectId: \"L_ID_DU_PROJET_GOOGLE_CLOUD_PLATEFORM\",\n});\n\n\napp.get('/translations/b2cwebsite', (req, res,) => {\n  const bucket = storage.bucket('LE_NOM_DE_VOTRE_BUCKET');\n  const locales = ['en', 'fr'];\n  let status = 200;\n\n  const client = axios.create({\n    baseURL: 'https://localise.biz',\n    headers: {'Authorization': 'Loco VOTRE_CLEF_API_LOCO' }\n  });\n\n  locales.forEach(function(locale) {\n    client.get('/api/export/locale/'  + locale +  '.json')\n      .then(function (response) {\n        const file = bucket.file(`messages.${locale}.json`);\n        file.save(JSON.stringify(response.data), {\n          contentType: 'application/json',\n          public: true,\n          gzip: true,\n          resumable: false,\n          metadata: {\n            cacheControl: `public, max-age=3600`,\n          },\n        }, function(err) {\n          if (err) {\n            console.error(`Couldn't upload translations file to Google Cloud Storage for locale ${locale}: ${err}`);\n            status = 500;\n          }\n        });\n      })\n      .catch(function (error) {\n        console.error(`Couldn't fetch translations from Localise for locale ${locale}: ${error}`);\n        status = 500;\n      });\n  });\n\n  res.status(status).end();\n});\n```\n\nComme vous pouvez le constater, en quelques lignes seulement nous obtenons nos fichiers de traduction.\nIl suffit de les charger dans notre application et le tour est joué !\n\n## Conclusion\n\nSi vous travaillez sur un site multi-langues et cherchez une solution qui permettrait de satisfaire aussi bien les devs que les traducteurs, Localise.biz pourrait vous convenir. Cette solution offre une grande souplesse, que ce soit dans la façon de gérer et exporter les traductions, que dans la façon de gérer les traductions au quotidien pour le métier.\n"}