{"date":"2017-11-22T00:00:00.000Z","title":"Commencer avec Ansible, cas concret pour initialiser un VPS","excerpt":"Découvrons Ansible en créant un script qui permet d'initialiser un VPS (appliquer les règles de base + sécurité)","readingTime":"6mn","authors":["nkania"],"categories":[],"content":"\n## Commencer avec Ansible\n\nQuoi de mieux qu'un cas concret pour découvrir et apprendre à utiliser un nouvel outil ? On va donc voir ensemble comment se lancer avec Ansible et ne plus répéter manuellement les mêmes étapes pour chaque nouveau serveur. Cet article va donc se baser sur un précédent qui vous présentait [les bases de la sécurisation d'un nouveau serveur](\n/fr/securiser-facilement-son-vps-en-quelques-etapes/).\n\nC'est parti !\n\n### Introduction\n\nAnsible est un outil qui permet d'automatiser le provisionning de serveur (jouer des commandes sur ceux-ci). Le but est donc de vous faire gagner du temps lorsque vous devez administrer vos systèmes et éviter les tâches répétitives. Il ne nécessite que peu de choses pour fonctionner : python et openssh (on peut donc l'utiliser sur presque tous les systèmes d'exploitation). De plus il utilise le langage YAML pour gérer ses configurations, qui est très simple d'utilisation.\n\n### Installation\n\nBon, pour cette partie rien de spécial, je vous renvoie sur la doc afin que vous puissiez [installer Ansible sur votre OS](http://docs.ansible.com/ansible/latest/intro_installation.html#installing-the-control-machine){rel=\"nofollow noreferrer\"}.\n\n### Configuration\n\nLa première chose à faire, c'est d'ajouter l'adresse ip ou hostname de notre serveur dans le fichier hosts de Ansible :\n\n```bash\n# vim /etc/ansible/hosts\n```\n\nDans mon exemple j'utilise un VPS chez OVH avec comme distrib ubuntu 16.04, l'installation se fait de base avec juste un user root et une authentification par password, du coup pour tester la connexion on va utiliser la commande suivante :\n\n```bash\n# ansible hostname -m ping -u root --ask-pass\n```\n\nSi comme moi vous recevez l'erreur `/bin/sh: 1: /usr/bin/python: not found\\r\\n` pas de soucis c'est juste qu'il faut installer le package python-minimal sur son serveur avec la commande suivante (pour ubuntu) :\n\n```bash\n# sudo apt install python-minimal\n```\n\n### Script\n\nMaintenant qu'Ansible a accès à notre serveur on peut passer aux choses sérieuses, à savoir notre configuration à proprement parler (Playbook dans le langage Ansible), les choses que l'on veut installer sur notre serveur et les configurations que l'on souhaite modifier.\n\n```yaml\n---\n- hosts: all\n  vars:\n    username: username\n    password: *******\n  tasks:\n    - name: Upgrade packages\n      apt: upgrade=safe\n\n    - name: Install base packages\n      apt:\n        name: \"{{ item }}\"\n        state: present\n        update_cache: yes\n      with_items:\n        - fail2ban\n        - iptables-persistent\n\n    - name: Add non-root user\n      user:\n        name: \"{{ username }}\"\n        password: \"{{ password }}\"\n        shell: /bin/bash\n        update_password: on_create\n        state: present\n\n    - name: Disable root login\n      lineinfile:\n        dest: /etc/ssh/sshd_config\n        regexp: \"^PermitRootLogin\"\n        line: \"PermitRootLogin no\"\n        state: present\n\n    - name: Restart ssh\n      service:\n        name: ssh\n        state: restarted\n\n    - name: Add iptables v4 rules\n      action: copy src=iptables.rules dest=/etc/iptables/rules.v4 owner=root group=root mode=0644\n\n    - name: Add iptables v6 rules\n      action: copy src=iptables.rules dest=/etc/iptables/rules.v6 owner=root group=root mode=0644\n\n    - name: Restart iptables-persistent\n      service:\n        name: netfilter-persistent\n        state: restarted\n\n```\n\nOn voit que le script est séparé en plusieurs parties :\n\n - hosts : permet de déclarer les hosts (ou groups) sur lesquels le playbook doit se jouer.\n\n - vars : ici on déclare nos variables, dans notre cas username et password. Pour username il s'agit de l'utilisateur qu'Ansible va créer plus loin et le password est un hash du password à assigner à cet utilisateur. Pour générer ce hash vous pouvez utiliser la commande suivante :\n\n```python\n# python -c 'import crypt; print crypt.crypt(\"mon password\", \"$1$SomeSalt$\")'\n```\n\n - tasks : les différentes étapes que notre playbook va devoir jouer :\n\n  - Mettre à jour la distribution installée\n  - Installer les paquets dont on a besoin (ici : fail2ban et iptables-persistent)\n  - Ajout un nouvel utilisateur qu'on utilisera pour se connecter en ssh au serveur par la suite\n  - Désactiver le fait que le compte root puisse se connecter via ssh\n  - Redémarrer le serveur ssh pour prendre en compte nos modifications\n  - Ajouter nos règles iptables v4\n  - Ajouter nos règles iptables v6 (si notre serveur possède une ipv6 bien entendu)\n  - Redémarrer le service iptables-persistent (attention dans mon cas j'ai testé sur une ubuntu qui a renommé le service iptables-persistent en netfiler-persistent !)\n\nCela reste minimaliste, on peut bien entendu étoffer le playbook afin de changer le port ssh, rajouter des règles fail2ban, etc. Mais le but ici est simplement de vous présenter l'outil et son fonctionnement.\n\nJe vous ai mis un exemple concret de répertoire Ansible ici : [github.com/snroki/ansible](https://github.com/snroki/ansible){:rel=\"nofollow noreferrer\"}\n\nLe répertoire possède plusieurs fichiers :\n\n- main.yml (qui est le fichier que j'ai recopié au dessus) : permet de définir les tasks qu'Ansible va devoir effectuer (une bonne pratique est de séparer les différentes \"étapes\" en plusieurs fichiers)\n- ansible.cfg : permet d'indiquer à Ansible qu'il faut qu'il utilise le fichier hosts de ce dossier et qu'il ne doit pas vérifier le ou les host(s) auxquels il doit se connecter\n- iptables.rules : les règles iptables qu'on veut exécuter sur nos serveurs\n- hosts : le fichier qui contient la liste des serveurs où exécuter Ansible\n\n### Exécution du playbook\n\nVous pouvez cloner le repository ci-dessus ou créer le votre. Une fois fait voici la commande à exécuter afin de lancer Ansible :\n\n```bash\n# ansible-playbook main.yml -uroot --ask-pass\n```\n\nSi tout se passe bien vous devriez vous retrouver avec un récap qui vous indique ce qu'il s'est passé.\n\nVous pouvez maintenant vous connecter à votre serveur en utilisant le username et password indiqués plus haut !\n\nC'est tout pour cet article, si vous avez des questions/remarques n'hésitez pas !\n\nSeeya !\n"}