{"date":"2020-03-25T00:00:00.000Z","title":"La Guerre du Backlog n'aura pas lieu (PART I)","excerpt":"Quelques méthodes de priorisation du Backlog pour gagner des batailles, vous faire des alliés et pacifier le développement du Produit !","readingTime":"10mn","authors":["mapo"],"categories":["agile"],"content":"\n\nJackpot, vous venez de décrocher un nouveau poste de PO ou PM. Mais dès vos premiers jours, c’est le drame… le backlog compte bien plus de 150 items, nombre maximum recommandé par le Scrum Guide, et sont tous marqués d’une étiquette rouge Must Have ou d’une Priorité Highly Important…\n\nLes feedbacks et suggestions de nouvelles fonctionnalités de vos utilisateurs pleuvent et la rétention de vos clients est en jeu…\n\nL’équipe commerciale vous abreuve de ces fonctionnalités, qui si elles étaient développées très rapidement, pourraient leur permettre de closer des deals…\n\nLes investisseurs ne jurent que par cette fonctionnalité et votre big boss vous annonce : “On met tout de côté, il faut absolument prioriser cette feature pour les convaincre d’avancer avec nous !”…\n\nVous vous y perdez, entre la priorisation d’un backlog Produit, backlog Tech et backlog bug…\n\nVoici des éléments déclencheurs -parmi tant d’autres- d’une **Guerre du Backlog**. Vous voilà donc engagé, tels les deux soldats britanniques Schofield et Blake, dans une bataille à proprement parler impossible. Vous êtes investi d’une mission qui pourrait bien empêcher une attaque dévastatrice sur le Produit !\n\nEt pour vous lancer dans cette véritable course contre la montre, vous faire des alliés et pacifier le développement du Produit, voici trois premières **méthodes de priorisation du Backlog** qui pourront très certainement vous accompagner.\n\n\n![](/imgs/posts/2020-03-25-la-guerre-du-backlog-n-aura-pas-lieu/Scoffield & Blake.jpg)\n\n\n## Tactique numéro 1 : l’oeil de MoSCoW\n\nLes éléments de votre backlog ne sont pas encore priorisés ou vous voulez rebattre les cartes et vérifier les priorités établies. Une priorisation MoSCoW peut être un premier angle d’attaque simple.\n\nIl s’agit de classer les éléments de votre backlog dans les catégories suivantes :\n\n- **M – Must have** : les éléments vitaux pour votre produit\n\n- **S – Should have** : les éléments importants, mais pas vitaux pour votre produit\n\n- **C – Could have** : les éléments qui pourront être développés s’ils n’ont pas d’impacts sur les tâches vitales\n\n- **W – Won’t have** : éléments avec moins ou pas de valeur immédiate et qui pourront être réévalués dans une version ultérieure du produit\n\nMais comment procéder pour ne pas obtenir tous les éléments de votre backlog en Must Have ?\n\n\n### Préparation du conseil de guerre\n\n**1.**  **Regroupez vos forces en un seul et même bataillon lors d’un atelier**. Équipes métier, Sales, Marketing, Support client… Assurez-vous d’avoir un échantillon représentatif des différentes parties prenantes autour de la table, y compris les décideurs pour ne pas revenir sur les priorités établies quelques jours seulement après l’atelier.\n\nN’hésitez pas à inclure l’équipe de développement à cet atelier pour leur donner une meilleure vision produit mais également afin qu’ils puissent partager la complexité technique de tel ou tel élément du backlog aux parties prenantes en cas de difficulté d’arbitrage\n\n**2.**  **Préparer et afficher sur des post-its les éléments du backlog à prioriser**, les post-its doivent être visibles par tous les participants\n\n**3.**  Afficher sur un board les **catégories Must, Should, Could et Won't** dans lesquelles les participants devront placer les post-its\n\n\n### Déroulement du conseil de guerre\n\nLes participants sélectionnent des post-it et viennent les placer dans les différentes catégories, dans un premier temps sans échanger.\nIls devront dans un second temps échanger sur les post-its qui font débat. Il est important de bien cadrer l’atelier pour équilibrer le nombre de post-its dans les différentes catégories. Si trop de tickets sont encore en Must Have ou Should Have, demandez aux participants de débattre à nouveau sur les éléments en Must Have pour n’en garder qu’un nombre défini. Répétez l’opération sur les Should Have jusqu’à l’obtention d’un nombre cohérent d’éléments dans chaque catégorie.\n\n\n![](/imgs/posts/2020-03-25-la-guerre-du-backlog-n-aura-pas-lieu/MoSCoW.jpg)\n\n\n*Cette méthode peut s’avérer inefficace si les différentes parties prenantes manquent d’objectivité ou si les relations sont très conflictuelles entre les différents services. Elle présente néanmoins l’intérêt d’aligner tous les métiers sur des objectifs communs lors d’un atelier assez simple à mettre en place. Cet atelier pourra être répété à intervalle régulier et est un bon moyen d’engager vos parties prenantes !*\n\n\n\n## Tactique numéro 2 : la business value, cheval de Troie du backlog\n\nEt si la valeur business, l’utilité d’un élément du backlog, devenait un élément clé de votre stratégie de priorisation du backlog ? Avec la business value, on va un peu plus loin que dans la méthode MoSCoW en scorant tous les éléments du backlog sur la valeur business de la même manière que vous estimez des points de complexité avec l’équipe de développement.\n\n\n### Business Value : Késako ?\n\nÀ vous de trouver la définition la plus adaptée à votre produit, il peut s’agir de la **valeur** :\n\n- **Commerciale** : acquisition client, upsell, rétention etc...\n\n- **Corporate** : chiffre d’affaires, notoriété, image de marque...\n\n- **Métier** : gain en efficacité, moins de support utilisateur...\n\n- **Utilisateur** (Customer Value) : le produit est plus friendly, présente les fonctionnalités clés pour son utilisation au quotidien, la satisfaction utilisateur est bonne...\n\n- **Client** : valeur du produit pour celui qui achète le produit ou service qui n’est pas forcément le end-user comme par exemple les tableaux de bord, le ROI de l’outil etc…\n\nL’idéal est de prendre en compte l’ensemble de ces éléments lors de l’estimation de la business value d’un élément du backlog et ce en réunissant bien les différentes parties prenantes.\n\n\n### Construisez le cheval de Troie\n\n**1.**  Préparez vos **éléments de backlog à scorer** et votre jeu de **carte de poker planning**\n\n**2.**  Regroupez vos parties prenantes lors d’un **atelier**\n\n**3.**  1, 2, 3 - Scorez : comme dans une session de poker planning qu’on peut appeler ici **priority poker**, un élément du backlog est présenté et les participants choisissent une carte numérotée pour estimer la valeur business\n\n**4.** Si les valeurs choisies divergent, les participants échangent et démarrent ce challenge collectif de prioriser telle ou telle US\n\n*Astuce : si vous êtes à distance, le poker planning ou priority poker est toujours possible sur [Voting Poker](http://www.votingpoker.com/) ou [Planitpoker](https://www.planitpoker.com/)*\n\n\n### Infiltrez le cheval dans l’enceinte du backlog\n\nLa business value va donner du sens à l’équipe. Pourquoi cette US est prioritaire par rapport à une autre ? Je dois choisir entre deux US à développer dans le sprint en cours, et si je commençais par celle qui a le plus de valeur business ?\nVous pouvez ainsi décider de rajouter cet indicateur sur vos US dans Jira à l’aide d’un champ personnalisé (custom fields).\n\nCela vous permettra de mesurer la valeur business créée, de l’afficher, de communiquer sur celle-ci. La business value est un indicateur bien plus intéressant que la vélocité qui a d’ailleurs pour vocation à rester interne à l’équipe de développement. Vous pouvez tout à fait créer un **burnup Chart dédié à la valeur créé dans le sprint.**\n\nLa business value est une méthode de priorisation assez puissante et qui reste somme toute assez simple à mettre en place. Elle permettra au PO ou PM de **justifier factuellement la priorisation des fonctionnalités auprès des différentes parties prenantes, acteurs eux-même de la définition de la business value.**\n\nEn tant que PO, la business value vous permettra également de **communiquer auprès des différentes parties prenantes sur les tâches techniques** qui font partie intégrante des éléments du backlog et qui étaient jusqu’ici obscurs pour eux. “Il faut faire une migration vers telle techno, mais pourquoi ?” Les ateliers de priority poker vous permettront de mettre en lumière l’importance des tâches techniques aux équipes métiers.\n\nLa business value pourra enfin améliorer la **perception de l’équipe de développement** qui ne sera plus uniquement un centre de coût mais un **centre de création de valeur.**\n\n\n### Le talon d’Achille\n\nAttention la business value doit nécessairement être réévaluée régulièrement, à l’aune de l’arrivée d’un nouveau concurrent sur le marché, d’une évolution dans les comportements des utilisateurs, d’une demande de nouvelle fonctionnalité à prioriser etc… **L’indicateur de la business value n’est jamais figé !**\n\nPar ailleurs, soyez vigilants à ce que la business value ne devienne pas un indicateur de performance de l’équipe car la vélocité en terme de business value sera forcément amenée à décroître à mesure que vous allez dépiler les éléments du backlog.\n\n## Tactique numéro 3 : WSJF, partisan du moindre effort !\n\nSi la tactique MoSCoW ou la priorisation par la business value ne portent pas leurs fruits, **la méthode WSJF**, issue de SaFe, peut faire ressortir des priorités dans la multitude de fonctionnalités en Must Have de votre backlog ! Le WSJF a pour objectif de faire ressortir les **features les plus importantes et les plus courtes / rapides à développer** en top de votre backlog. Si vous hésitez donc entre plusieurs fonctionnalités Highly Important pour le business, le WSJF peut vous faire gagner une bataille.\n\n\n### Estimez vos chances de victoire\n\nLe calcul de l’indicateur WSJF tiendra compte des valeurs suivantes :\n\n-   **Business value** : la valeur métier de la fonctionnalité estimée avec les parties prenantes\n\n-   **Niveau d’urgence** : la fonctionnalité doit-elle être livrée rapidement ? Quelle criticité pour cette fonctionnalité ?\n\n-   **Réduction des risques / Facilitation des développements** : sécurisation de l'application, système de déploiement qui n'implique aucune interruption de service par exemple\n\n-   **Taille de la fonctionnalité à développer** : points de complexité estimés par l’équipe de développement\n\nPour chacune des valeurs, vous pourrez utiliser la suite de Fibonacci pour les noter.\n\n![](/imgs/posts/2020-03-25-la-guerre-du-backlog-n-aura-pas-lieu/WSJF.jpg)\n\nUne fois les différentes valeurs notées, vous voilà prêt pour le grand calcul.\n\n\n### Calculez vos chances de victoire\n\nOn calcule d’abord le coût du délai pour chacune des fonctionnalités : **Coût du délai = Business value + Niveau d’urgence + Réduction des risques**\n\nVous y êtes presque, plus qu’une division pour obtenir le résultat : **WSJF = Coût du délai / Taille de la fonctionnalité**\n\n\n### Une variante plus simple\n\nSi la criticité ou la réduction du délai est difficile à mesurer sur votre produit, vous pouvez tout à fait utiliser uniquement la business value : **Business Value / Taille de la fonctionnalité**\n\nCela peut vous permettre de prioriser simplement des User Stories avec des Business Values sensiblement proches en fonction de la facilité à développer et rapidité à livrer une feature.\n\n*Pour résumer, la méthode WSJF peut donc vous aider à légitimer vos choix et votre priorisation notamment auprès des équipes dirigeantes, des équipes métier. Cependant le calcul des différents indicateurs peut se révéler chronophage donc vous pouvez choisir de ne l’utiliser que sur des Epics ou Roadmap Features.*\n\n\n## CONCLUSION\n\nLes méthodes RICE, KANO et des ruses de Sioux en termes d'organisation feront l'objet d'un second article à découvrir très prochainement ! Le story mapping et l'impact mapping sont également des méthodes très efficaces à explorer.  Mais retenez que le plus important est de trouver la méthode qui fonctionne avec vos parties prenantes, votre équipe, votre produit. **Alors restez agiles, testez, changez, mixez les méthodes en fonction de vos objectifs et de la maturité de votre produit !** La priorisation d'un backlog ne se fait pas en un seul plan séquence à la Sam Mendes, alors **itérez !** et ne manquez pas la suite de la Guerre du Backlog n'aura pas lieu !\n\nEt enfin rappelez-vous que **la communication et l’engagement des différents corps de métier dans la stratégie produit sont clés**. En termes de priorisation, il n’y a pas d’ennemis, il faut avant tout **faire front avec toutes les parties prenantes** pour développer un produit qui apporte une plus grande satisfaction aux utilisateurs !\n\n\n## RÉFÉRENCES\n\n- [https://www.visual-paradigm.com/scrum/prioritize-backlog-with-moscow/](https://www.visual-paradigm.com/scrum/prioritize-backlog-with-moscow/)\n- [https://www.youtube.com/watch?v=WInTWb94WUg](https://www.youtube.com/watch?v=WInTWb94WUg)\n- [https://techbeacon.com/app-dev-testing/prioritize-your-backlog-use-weighted-shortest-job-first-wsjf-improved-roi](https://techbeacon.com/app-dev-testing/prioritize-your-backlog-use-weighted-shortest-job-first-wsjf-improved-roi)\n- [http://blog.ai3.fr/wsjf-priorisez-simplement-votre-backlog/](http://blog.ai3.fr/wsjf-priorisez-simplement-votre-backlog/)\n"}