{"date":"2019-12-04T00:00:00.000Z","title":"Les Chroniques de l’Agile Tour 2019 par Eleven Labs","excerpt":"L’escouade agile d’Eleven Labs s’est déplacée le 2 décembre jusqu’à Porte de Charenton pour assister aux différents talks et workshops de l’Agile Tour 2019.","readingTime":"21mn","authors":["mae","rcourbo","mapo"],"categories":["agile"],"content":"\nL’escouade agile d’Eleven Labs s’est déplacée le 2 décembre jusqu’à Porte de Charenton pour assister aux différents talks et workshops de l’Agile Tour 2019.\n\nVous retrouverez donc ci-dessous les différentes chroniques de l’équipe, composées d’une présentation et d’un avis personnel sur les ateliers qui nous ont le plus marqués au cours de la journée !\n\n## Sommaire\n\n - [Dashlane : Technical investment and dual track organization](#how-to-support-both-business-&-technical-investment-through-a-dual-track-organization)\n - [S’aligner pour réussir : de la stratégie à la Value Stream Map](#s-aligner-pour-reussir-de la-strategie-a-la-value-stream-map-guillaume-morin)\n - [Le Scrum Master Toolkit](#scrum-master-toolkit-sweta-mistry)\n - [Booster vos événements Scrum avec les Liberating Structures](#booster-vos-evenements-scrum-avec-les-liberating-structures-philippe-pushmann)\n - [KPI vs KBI](#key-performance-indicator-vs-key-business-indicator-jean-sebastien-sladecek)\n - [Boostez votre Time to Market en dansant le Limbo](#boostez-votre-time-to-market-en-dansant-le-limbo-younes-jaaidi)\n - [Quand notre représentation nous empêche d’être agile](#quand-notre-representation-nous-empeche-d-etre-agile-nicolas-delahaye)\n - [Petit guide de CNV à l'usage des honnêtes gens](#petit-guide-de-cnv-a-l-usage-des-honnetes-gens-laetitia-thernier)\n\n\n## \"How to support both business & technical investment through a dual track organization\"\n\nGuillaume Maron, Co-founder et CTO de chez Dashlane a ouvert la journée avec ce premier talk sur l’investissement technique dans l’agilité et les différentes organisations adoptées par leurs équipes en interne au fur et à mesure du temps et des effectifs.\n\nLa société **voit le jour** en 2009, et c’est en 2014 que les équipes adoptent **l’agilité “by the book”**. En 2016 sont mis en place des **OKR** afin de se fixer des objectifs business d’entreprise.\n\nEn 2017, les **“Feature teams”** voient le jour. Mais très vite, les objectifs étant trop flous et éloignés des équipes de développement vis-à-vis de leur vision produit, en 2018 l’organisation passe en **“Mission teams”**. Ce qui permet à chacun de se projeter plus facilement.\n\nEnfin, en 2019, en complément de ces “Mission teams” est ajoutée une organisation en **“Dual Track”**, suite au constat de la dette technique qui ne fait qu’augmenter. Il n’est donc plus question de passer 2 jours par-ci par-là pour se pencher sur la question, mais clairement de dédier une “Platform team” de 25% des effectifs dev à cette dette technique. Une rotation a été instaurée pour que ces effectifs changent régulièrement et une **“Technical Roadmap”** sur 3 mois leur permet de ne pas tomber dans les travers des tâches qui ne finissent jamais.\n\nGlobalement, l’objectif donné n’est pas de la faire baisser, ni de l’augmenter, mais de la rendre **“neutre”**.\n\nMais pour que tout cela puisse fonctionner il faut avant tout que l’entreprise, dans sa manière de fonctionner et de penser, s’agilise à tous les niveaux :\n\n-   Opérationnel avec des équipes de développement en agile (scrum, kanban…)\n-   Tactique en adoptant une posture de “Lean” tout au long du développement des produits\n-   Stratégique en mettant en place des objectifs (OKR) qui servent le produit et la technique\n-   Culturel en construisant petit à petit une vraie culture de l’innovation\n\n\n***L'avis de Maeva :** Sujet très intéressant que ceui de la dette technique, bien souvent mis à la trappe par les directions métiers ou les CTO non avertis. Et qui fait pâtir aussi bien le produit que les équipes quand on la laisse faire sa vie. Bien plus compliquée à mettre en place dans des petites équipes, et probablement imparfaite, la dynamique adoptée pour trouver une organisation pouvant répondre le mieux possible à la dette technique - fléau commun à tout produit logiciel - a le mérite de se pencher sur la question.*\n\n\n\n## S’aligner pour réussir : de la stratégie à la Value Stream Map - Guillaume Morin\n\nOn connait plutôt bien la Customer Journey Map qui consiste à cartographier l’ensemble des actions et interactions qu’un client va avoir avec une entreprise durant le processus d’achat d’un produit ou d’un service. Mais la Value Stream Map, on est moins familiers et ça nous intéresse !\n\nGuillaume Morin - CEO de Monsieur Guiz - et son associé nous ont présenté ce concept issu du Lean Management, au travers d’un cas concret : un de leur client dans l’hôtellerie a souhaité retirer les comptoirs dans son hôtel pour créer un accueil plus chaleureux.\n\nLe constat après un POC : allongement du temps d’attente, double saisie sur l’application mobile mise à disposition du réceptionniste, difficulté à gérer des demandes particulières pour le réceptionniste… Un accueil pas beaucoup plus chaleureux, donc.\n\n**Étape 1 : Définition de la valeur client et alignement**\n\nL’équipe de Monsieur Guiz s’est attaqué aux problèmex d’alignement des objectifs en allant interroger les Product Owners et les différentes parties prenantes avec des questions simples :\n\n-   Sur quoi tu travailles en ce moment ?\n-   Quel est le problème que tu cherches à résoudre ?\n-   Avec quelles équipes collabores-tu ?\n-   Quel segment de clients cela concerne-t-il ?\n-   Est-ce que les features arrivent jusqu’en production ? Si non, pourquoi ?\n\nUn objectif clair est ressorti : Faciliter la vie du réceptionniste et réduire le temps d’attente du client\n\n**Étape 2 : Définir une boussole chiffrée**\n\nPar exemple, le temps de récupération des clefs par le client\n\n**Étape 3 : Créer la value Stream Map Produit**\n\nIls ont réuni les différentes parties prenantes pour les faire travailler de concert sur leur Value Stream Map. La VSM est une technique de design et d’analyse du flow d’informations et des différents process qui permettent de délivrer un produit au client.\n\nIls ont donc fait mapper aux équipes (à l’aide de post-its) toutes les étapes nécessaires pour arriver à la création d’un produit ou la livraison d’une feature. Concrètement : qui passe la balle à qui ?\n\nL’objectif : commencer à faire échanger les parties prenantes, cartographier toutes les étapes pour produire une feature/un produit, faire connaître les processus par tous, identifier les étapes qui ralentissent le process et faire s’aligner les équipes pour réussir !\n\n**Étape 4 - Les tops problèmes à régler et les tâches associées**\n\nIls ont procédé de la même manière pour cartographier les problèmes identifiés tout au long du parcours client et les tâches associées qui apportent le maximum de valeur au client. Ils ont ensuite redispatché les problèmes et tâches aux différentes étapes identifiées dans la Value Stream map.\n\nLe résultat : une Value Stream Map Produit et Value Stream Map Client alignées !\n\n***L'avis de Marion :** Une méthode très intéressante quand un besoin de rapprocher le développement des objectifs business se fait sentir. Il semble en effet permettre d’aligner toutes les parties prenantes vers un objectif commun et être un bon point de départ pour faire ouvrir les yeux sur la nécessité de revoir les process et l’implication des différentes parties prenantes aux différentes étapes de développement d’un produit qui a de la valeur pour le client !*\n\n\n## Scrum Master Toolkit - Sweta Mistry\n\nSweta Mistry (Agile coach CSM, CSP et CSPO), venue tout droit de New York pour nous former, nous a embarqués dans une session ultra interactive avec pour but d’étoffer notre boîte à outils Scrum.\n\nOn a commencé en pratique avec des techniques pour engager l’audience :\n\n- “Stop talking” quand l’oratrice lève la main, tous les participants lèvent la main et arrêtent leur discussion jusqu’à ce que tout le monde ait la main levée,\n- “Shout out”, Sweta nous demande d’exprimer notre sentiment sur un concept ou un exercice en criant un mot\n- “Popcorn” une personne se lève et dit un mot, puis une autre personne se lève et dit un mot, comme des petits popcorn qui éclatent chacun à leur tour dans la salle !\n- “Pairs”, par groupe de 2, auto-constitués, on échange sur nos attentes de la session dans un temps défini.\n\n\nBien échauffés, on enchaîne sur les Liberating Structures. Des micro-structures qui permettent de faciliter les meetings et les conversations. Il en existe 33 qui sont détaillées dans l’ouvrage que Sweta nous recommande : The Surprising Power of Liberating Structures: Simple Rules to Unleash A Culture of Innovation d’[Henri Lipmanowicz](https://www.amazon.com/Henri-Lipmanowicz/e/B00LT8JGN4/ref=dp_byline_cont_book_1).\n\nOn découvre notamment l’”Impromptu Networking”, qui nous permet de créer des liens avec les participants du meetup, et les règles qui s’appliquent à toutes les liberating structures, à savoir :\n\n-   Une invitation structurante de la personne qui lead le meet-up : une consigne claire comme par exemple, \"partagez une problématique du quotidien et ce que vous attendez du meetup\"\n-   Un agencement de l’espace adéquat et le matériel nécessaire\n-   Une distribution des rôles définie : les participants choisissent eux-même leur partenaire dans la salle par exemple\n-   Une configuration des groupes définie : par pair\n-   Une séquence définie, un temps alloué : 2 mins par round / 5 rounds\n\nSweta nous conseille d’approfondir sans plus attendre les [Liberating Structures](http://www.liberatingstructures.com/) et le concept de [Training from the back of the room](https://bowperson.com/sharons-articles/) de Sharon Bowman's qui consiste en tant que formateur ou animateur à donner les instructions pertinentes aux participants puis à se mettre en retrait pour les laisser apprendre en faisant.\n\nOn continue à remplir notre boîte à outils avec les 6 TRUMPS :\n\n-   Faites bouger fréquemment vos participants, toutes les 10 à 20 minutes, ça oxygène le cerveau !\n-   Faites parler vos participants pour les aider à apprendre ;\n-   Faites écrire pour permettre à votre assistance de processer l’information ;\n-   Plus vous ferez court, plus les participants mémoriseront les informations. Ainsi, divisez vos contenus en petits segments, faites un networking impromptu puis reprenez une session de partage de contenu ;\n-   Variez les formats, les contenus, les images. Notre cerveau remarque le changement et ignore les informations qui semblent similaires ;\n-   Utilisez des visuels ! La mémoire à long terme des images semble illimitée et le cerveau crée facilement des scénarios à partir d’images !\n\n\nOn parlera enfin d’intelligence émotionnelle qu’Howard Gardner décrit ainsi “Your EQ is the level of your ability to understand other people, what motivates them and how to work cooperatively with them” et contrairement au quotient intellectuel, eh bien l’intelligence émotionnelle ça se travaille nous dit Sweta ! On apprend donc qu’on pourra améliorer notre Self-awareness, notre Self-regulation, notre Motivation, notre empathie et nos Social skills.\n\n***L'avis de Marion** On repart en effet avec beaucoup de pratiques très concrètes dans notre petit baluchon, que l’on aura pu tester en live ! Pas sûr qu’on puisse toutes les mettre en pratique dans nos rétros, démos etc... mais ca nous donne beaucoup d’idées pour engager, faire participer, mieux communiquer, mieux réagir... On est resté un peu sur notre faim car on aurait aimé en savoir plus sur le mind maps, le story mapping, l’impact mapping… Et finalement, ce n’est pas qu’un Toolkit de Scrum Master mais des pratiques qui peuvent aider tous ceux qui animent des événements, des meetups ou une équipe !*\n\n## Booster vos événements Scrum avec les Liberating Structures - Philippe Pushmann\n\nLa journée a commencé par une première présentation de Philippe Pushmann de la société Avanade, un conférencier habitué de l'Agile Tour puisque j'avais déjà eu l'occasion de l'écouter en 2017.\n\nPour cette session 2019, le sujet était : les liberating structures.\n\nAfin d'animer de manière innovante et stimulante vos réunions, vos process, les liberating structures vous permettent d'optimiser la communication avec vos équipes.\n\nEn effet, par l'intermédiaire de petits exercices, vous allez permettre à vos collègues de se sentir investis et, par voie de conséquence, d'améliorer l'efficacité collective.\n\nThéoriquement, le Scrum, c'est génial. On est, pour la plupart, d'accord. Dans la pratique aussi, vous me direz, mais très souvent nous pouvons nous retrouver dans une certaine routine face aux différents meetings qui rend les participants moins alertes et, de fait, moins efficaces.\n\nAfin de casser cette routine, il ne faut pas hésiter à agrémenter vos réunions de ces liberating structures.\n\nJe vais vous vous parler de celle qui m'a paru la plus simple et applicable, selon moi.\n\nIl s'agit du Triz, que l'on pourrait, par exemple, mettre en place lors d'une rétrospesctive de sprint.\n\nDemandez à vos interlocuteurs ce qui pourrait engendrer le pire résultat vis-à-vis de vos objectifs.\n\nDans un deuxième temps, faites les réfléchir sur les choses que vous faites actuellement qui pourraient engendrer certains résultats décrits dans la première étape.\n\nEt, enfin, dernière étape, déterminez des actions qui vous permettraient de stopper ces effets néfastes.\n\nIl y a en tout 35 petits ateliers très intéressants que je ne vais pas détailler parce que le but n'est pas de refaire toute la présentation mais vous pouvez les retrouver facilement sur le site liberatingstructures.fr.\n\n\n***L’avis de Renaud :** J'ai vraiment beaucoup aimé cette présentation. Dans mon quotidien de Product owner, je me suis souvent demandé comment sortir de cette routine qui s'était installée et dont je voyais l'impact sur l'efficacité déclinante de nos échanges.\nJ'ai enfin trouvé des réponses à ce problème et je vais m'empresser d'expérimenter tout ça !*\n\n\n## Key Performance Indicator vs Key Business Indicator - Jean-Sébastien Sladecek\n\nJean Sébastien Sladecek, Directeur Services-Conseils chez CGI est venu à l’Agile Tour nous parler d’une manière plus réaliste et surtout plus humaine d’évaluer les performances d’une équipe produit.\n\nDans les organisations d’aujourd’hui, on pense performance avant de penser humain - un facteur bien en amont de la livraison.\n\nPourquoi de ce fait ne pas être à l’écoute du réel besoin des équipes pour améliorer la performance ? Et surtout, pourquoi ne pas penser les **KPIs (acronyme pour Key Performance Indicators)** au service de l’équipe et non pas au service du manager ?\n\nLa première chose importante est de vous poser cette question avant de mettre en place ce type de métriques : que voulez-vous réellement savoir à travers les KPIs ?\n\nEst-ce que vous faites est pertinent ? est-ce quec’est collaboratif ? Fluide ? À quel moment êtes-vous complètement bloqué ?\n\nCar avant de penser performance, livraison dans les temps, et payer le moins cher possible, il est important de partir d’un constat simple mais vrai : est-ce que chaque membre de l’équipe doit avoir la même performance ?\n\nDans une équipe de football, par exemple, est-ce qu’on pourrait attendre que tous les joueurs d’une équipe soient évalués selon leur même performance ?\n\nLa réponse est non, évidemment. Pour certains ce seront les buts, pour d’autres les passes décisives, ou encore la défense de son propre but. Mais avant même tout cela, il ne faut pas oublier la collaboration entre chaque joueur, la discipline liée au sport en lui-même, et la compréhension et maîtrise des règles qui a permis à chacun d’être dans l’équipe.\n\nQu’est-ce que la performance, donc ? Notre intervenant nous l’a traduite de la manière suivante : la performance est une situation optimale afin que les individus qui composent l’équipe puissent s’exprimer à 100% de leur capacité (sénior, comme junior).\n\nEt cette performance est affectée par plusieurs facteurs communs à toutes les équipes, comme par exemple : la maturité de l’équipe, le niveau d’expérience propre des joueurs, la situation mentale personnelle à l'instant T, le désir de dépassement de chacun, l’engagement de l’équipe dans le projet.\n\nQuel comportement attendre de l’équipe qui pourrait donc faire l’objet de nos désormais **KBIs (acronyme pour Key Business Indicators)** : la motivation, l’engagement, la responsabilité, la confiance entre eux et dans l’équipe, l’amélioration continue, le partage de connaissance, l’écoute et l’empathie, le nombre de rires, etc..\n\nPour en savoir plus sur le sujet, une vidéo résume très bien l’ensemble : “[Performance VS Trust](https://www.youtube.com/watch?v=YPDmNaEG8v4)”.\n\n***L'avis de Maeva :** Le sujet n’est pas nouveau dans l’agilité : se tromper pour s’améliorer, éviter de passer plus de temps à estimer qu’à réaliser ou encore faire comprendre à son client / sa direction qu’il ne sert à rien de courir après les points d’effort. Cela reste cependant très intéressant de pouvoir mettre des indicateurs de performance plus réalistes, plus humains et non plus liés juste à de la production. Et surtout, de pouvoir engager d’une manière plus saine l’équipe dans la volonté d’atteindre des objectifs sans risquer de les démotiver avec des demandes parfois lunaires. *\n\n\n\n## Boostez votre Time to Market en dansant le Limbo - Younes Jaaidi\n\nYounes Jaaidi est venu nous présenter les avantages de l’**Extreme Programming**, dont les principes ont été re-façonnés par Kent Beck. Technique qu’il a lui-même mise en place dans sa société Marmicode.fr.\n\nIl a en effet rapidement fait face au constat que ses développeurs (lui y compris) codaient chacun dans leur coin sur leur propre branche, et perdaient du temps à faire des reviews de code entre eux beaucoup trop longues. Et au moment de merger une semaine de travail, se retrouvaient avec **bien trop de conflits** à gérer.\n\nIls se sont donc lancés dans l’Extreme Programming : tout le monde sur la même branche et parfois même sur le développement des mêmes features. La volonté étant de favoriser le **pair programming**, le **pair testing** & le **collective ownership**. En soit, l’implication et l’appartenance commune de tous les développeurs dans le même code.\n\n\nMais comment réussir à travailler avec une seule branche commune ?\n\nEn faisant de l’intégration continue, nous a-t-il répondu, qui permet notamment de :\n\n-   Résoudre le problème de symétrie du code\n\n-   Eviter le Git Spaghetti\n\n-   Mettre en place un collective ownership plus important\n\n-   Réduire le work in progress d’une feature (car tout le monde est dessus en même temps)\n\n\n\nCe qui pour autant ne permet tout de même pas d’éviter tous les conflits, notamment en faisant des push sur la même branche et en écrasant le travail de l’autre !\n\nYounes Jaaidi nous a donc présenté le **shared programming** à travers le principe du Limbo : quel est le plus petit commit qu'il soit possible de faire, au même titre que, jusqu’où est-il possible de se baisser au Limbo ?\n\n\nDans sa vision du développement, un commit ne doit pas être une feature, mais doit contribuer à une feature. Et l’avantage de ce système est d’embarquer les développeurs dans une communication constante entre eux tout au long de la journée, permettant d’éviter autant les doublons que parfois les erreurs.\n\n\nEn poussant encore plus loin, ils se sont d’ailleurs essayés au **“Timeboxed TDD”**. Chaque commit est timeboxé, et si pour le développer cela vous prend plus de 30 mins : c’est que c’était probablement une mauvaise idée. HOP, c’est revert.\n\n\n***L'avis de Maeva :** Technique un peu drastique qui doit peut-être bien fonctionner dans des petites équipes de développeurs qui se connaissent déjà. Mais je vois d’ores et déjà plusieurs barrières. La première est l’effort constant et au quotidien de communication imposé entre individus. Nous sommes tous humain, il arrivera donc forcément un moment où ce ne sera pas le bon jour et où potentiellement la productivité chutera.\nJe pense également que cela implique parfois de passer plus de temps à échanger machinalement et moins de temps à produire réellement, pPour plus d’efficience par la suite, peut-être, et c’est intéressant dans le cas d’un produit qui se cherche. Mais probablement beaucoup moins dans des équipes où la direction du produit est déjà bien travaillée en amont.*\n\n## Quand notre représentation nous empêche d’être agile - Nicolas Delahaye\n\nNicolas Delahaye, coach professionnel, nous fait débuter notre voyage agile au travers d’une session de talk et d’échanges centrée sur nos mécanismes de perception et comment ils peuvent influencer notre état d’esprit agile.\n\nIl démarre son propos sur l’Allégorie de la caverne de Platon, vous savez cette “demeure” souterraine où des hommes sont enchaînés ! Allez, on revient un peu sur le concept : “ces hommes n'ont jamais vu directement la source de la lumière du jour. Des choses et d'eux-mêmes, ils ne connaissent que les ombres projetées sur les murs de leur caverne.”\n\nImaginez maintenant que l'un d'entre eux soit libéré de ses chaînes et accompagné de force vers la sortie, il sera d'abord cruellement ébloui et souffrira de tous les changements. S'il persiste, il s'accoutumera et pourra voir “le monde supérieur”, ce que Platon désigne comme “les merveilles du monde intelligible”. S’il retourne dans la caverne, on peut imaginer que les autres hommes seront incapables de comprendre ce qui lui est arrivé et refuseront de le croire : “Ne le tueront-ils pas ?”.\n\nUn petit retour en cours de philo pour nous rappeler que notre cerveau est un modeleur de la réalité, que nous avons tous une perception différente du monde et que “la carte n’est pas le territoire”. C'est un des présupposés de la PNL (on parle bien ici de Programmation neuro-linguistique), c'est aussi une phrase empruntée à Alfred Korzybski.\n\nOui mais comment tout ceci s’applique-t-il à l’état d’esprit Agile ?\n\nPour faire le lien, Nicolas Delahaye nous présente le Fixed Mindset et le Growth Mindset de Carol S. Dweck. Une personne ayant un Fixed Mindset aura tendance à éviter les challenges, à abandonner plus rapidement face aux obstacles, à considérer les efforts comme vains, à ignorer les critiques, à se sentir menacée par le succès des autres etc... Une personne ayant un Growth Mindset est plus dans une configuration apprenante qui lui apportera résilience, capacité d’adaptation, volonté d’embrasser les challenges et d’apprendre de ses erreurs...\n\nDans un contexte Scrum, un Fixed Mindset pourra avoir des biais qui inciteront par exemple à vouloir planifier un backlog sur 10 sprints, à faire un refinement qui serve uniquement au Product Owner pour insister sur un chiffrage, à supprimer les rétros considérées comme “inutiles”, à pointer du doigt les erreurs, ou à considérer que les erreurs viennent de l’extérieur (d’autres parties prenantes) etc…\n\nVous l’aurez compris, l’Aile a donc besoin de talents avec un Growth Mindset pour lui permettre de faire face au Monde empirique et complexe dans lequel Scrum a été créé !\n\n***L'avis de Marion :** Une prise de hauteur intéressante sur l’état d’esprit appliqué à l’agile qui nous amène à questionner notre interprétation et la manière dont nous sommes amenés à résoudre nos problématiques. S’il semble évident que des Scrum Masters, Product Managers ou Product Owners doivent acquérir le Growth Mindset, comment procéder ? Pour aller plus loin que la théorie, quelques pistes :\n-[Developing a Growth Mindset with Carol Dweck](https://www.youtube.com/watch?v=hiiEeMN7vbQ)\n-[25 Simple Ways To Develop A Growth Mindset](https://www.teachthought.com/learning/25-simple-ways-develop-growth-mindset/)*\n\n## Petit guide de CNV à l'usage des honnêtes gens - Laetitia Thernier\n\nLa Communication Non Violente (CNV) : voilà un concept qui valait bien un atelier lors de cet Agile Tour 2019 animé de mains de maître par Laetitia Thernier et Geoffrey Groff.\n\nL'exercice se déroule en six phases, pourquoi six ? Vous allez très vite le savoir.\n\n**Première étape** : en binôme, commencer par faire connaissance avec votre partenaire du jour. C'est toujours utile de savoir à qui l'on s'adresse !\n**Deuxième étape** : partons sur une situation qui nous crée de l'inconfort.\n**Troisième étape** : la phase d'observation. À tour de rôle, on expose notre situation pendant que notre binôme prend note de ce qui se révèle être des faits, des sentiments et des jugements.\n**Quatrième étape** : les sentiments. Quels sont ceux ressentis lors de cette situation ?\n**Cinquième étape** : quel est mon besoin non satisfait ?\n**Sixième étape** : quelle demande aimeriez-vous faire afin de régler ce problème ?\n\nRéfléchissez à comment réagir face à un refus de l'interlocuteur, pensez à remercier, et voilà ! Maintenant, vous savez comment aborder une situation compliquée ! Un problème inconfortable au travail, une situation conflictuelle personnelle...\n\n***L'avis de Renaud :** Cette méthode s'applique à tous les contextes. Selon nos conférenciers et moi-même au sortir de cet atelier, nous avons à faire à un vrai art de vivre !*\n\n## Conclusion\nC’est sur ces ateliers qui nous ont le plus marqués que se terminent nos chroniques de l’Agile Tour 2019 ! Un sentiment partagé d’un événement moins orienté Product Ownership que l’année précédente, mais de plus en plus Agile à tous les niveaux - et particulièrement vers le Scrum Mastering. Ce qui n’en fait pas moins un événement intéressant, et qui peut-être intéressera au fil du temps des profils plus techniques sur l’agilité !\n"}