{"date":"2019-04-17T00:00:00.000Z","title":"Les nouveautés d'ES6 Partie I","excerpt":"Cet article est le premier d'une série visant à vous présenter les nouveautés apportées par l'ES6 et ce qu'elles comportent d'intéressant.","readingTime":"11mn","authors":["mehdidr"],"categories":["javascript"],"content":"\nDepuis maintenant quelques années, le monde du JavaScript évolue à une vitesse sans pareille. Même le meilleur des développeurs ne peut réussir à suivre toutes les évolutions, que ce soient des librairies, des frameworks, ou des mises à jour du langage en lui-même.\nIl y a cependant un standard qui évolue chaque année, que chaque développeur JavaScript se doit de connaître : l'ECMAScript.\n\nECMAScript est un ensemble de normes régissant les langages de script tels que JavaScript, qui est l'implémentation de l'ECMAscript la plus populaire, établie en 1997. Il modifie la façon d'appréhender certaines notions, et certaines façons d'écrire du JS. Nous en sommes actuellement à la 8ème version (sortie en 2017), mais je vais aujourd'hui vous parler d'ES6, de son vrai nom ECMAScript 6.\n\n## Pourquoi ES6 ?\n\nCette 6ème édition est créée pour améliorer le langage, notamment dans la création d'applications complexes et de librairies partagées par ces applications. Ce but est atteint notamment par la création des modules (ne vous inquiétez pas si vous ne savez pas ce que c'est, on voit ça dans la deuxième partie ;) ), mais aussi par l'ajout de features rendant la compilation plus simple (comme par exemple `Math.fround()` ou `Math.imul()`).\n\nUn autre but affiché était d'améliorer l'interopérabilité, notamment en adoptant des standards lorsque c'est possible.\nPar exemple, l'utilisation des classes, basée sur le constructor des fonctions, ou encore les arrow functions empruntées à CoffeeScript.\n\nLe problème d'une nouvelle implémentation de cette importance, c'est que le Web est vaste et qu'il existe toutes sortes de code, dont certains très vieux. Il faut donc que l'upgrade se fasse de manière automatique et surtout imperceptible. C'est pour cela que ES6 est une surcouche d'ES5, c'est-à-dire que rien n'est supprimé.\n\nUn autre problème se trouve dans les navigateurs : il faut que l'upgrade soit compatible avec tout les navigateurs utilisés. À ce problème existe deux solutions : soit attendre des années que tous les utilisateurs utilisent un navigateur capable de le supporter (si cela ne vous paraît pas viable, c'est normal !), soit de [transpiler](https://fr.wikipedia.org/wiki/Compilateur_source_%C3%A0_source) l'ES6 en ES5.\n\nMais pourquoi vous parler d'ES6 en particulier, et non des versions précédentes ou suivantes ? Car ES6 marque un tournant dans l'histoire du JavaScript. C'est à partir de cette version que les publications d’ECMAscript deviennent annuelles (ce qui est une énorme avancée pour JS, ES5 ayant été publié en 2009, soit 6 ans auparavant !) et sont désormais appelées en fonction de leur année de sortie : ES7 est appelé ES2016, ES8 est appelé ES2017, etc...\n\nJe vais donc vous présenter certaines des nouveautés apportées par ES6, et vous présenter leurs avantages par rapport à ce qui se faisait auparavant.\n\n## \"const\" et \"let\"\n\nEn ES5, la déclaration d’une variable se fait via le mot clé `var`. Le [scope](https://blog.lesieur.name/les-contextes-d-execution/) de ces variables est soit global (si défini en dehors d’une fonction), soit local (si déclaré à l’intérieur d’une fonction), mais ne prend pas en compte les blocs (par exemple une condition, ou une boucle).\n\n```javascript\nvar globalVariable = 'I am global !';\n\nfunction functionName() {\n    var localVariable = 'I am local !';\n}\n\nconsole.log(globalVariable); // output 'I am global !'\nconsole.log(localVariable); // output undefined\n```\n\nEn ES6, deux nouveaux mots clés ont été ajoutés pour déclarer une variable : `const` et `let`.\n\n### À propos de \"const\" ###\n\n`const` permet de déclarer une variable à assignation unique bindée lexicalement : c’est-à-dire que l'identifiant utilisé pour déclarer la variable ne peut pas être réaffecté, et sera scopé au niveau du bloc (la portée de la variable est limitée au bloc dans lequel elle est déclarée).\n\n```javascript\nfunction example() {\n  const foo = \"bar\"\n\n  if (true) {\n    const foo // SyntaxError, la variable a besoin d'être assignée\n    const foo = \"foobar\"\n    foo = \"reassign\" // SyntaxError, la variable ne peut pas être réassignée\n    console.log(foo) // \"foobar\", la variable appartient au scope du bloc if\n  }\n  console.log(foo) // \"bar\", la variable appartient au scope de la fonction \"example\"\n}\n```\n\nCependant, il faut bien faire attention car une variable `const` est constante (seems legit) au niveau référence : les types primitifs (number, string, boolean) bloquent sa réassignation, mais les valeurs à l’intérieur d’un tableau ou d'un objet sont modifiables.\n\n```javascript\nconst obj = {};\nobj.prop = 123;\nconsole.log(obj.prop); // 123\n```\n\n### Concernant \"let\" ###\n\n`let` quant à lui fonctionne de la même façon que `const` sans avoir cette assignation unique, et ressemble donc au fonctionnement de `var`, le scope mis à part.\n\n```javascript\nlet x = 1;\n\nif( x === 1 ) {\n    let x = 2\n\n    console.log(x) // output 2\n}\n\nconsole.log(x) // output 1\n```\n\n⚠️ Les variables déclarées avec `var` sont affectées par le *hoisting*, un mécanisme qui va lire toute les déclarations et les remonter au début du scope de la fonction lors de l’exécution de code. Plus de détails [ici](http://www.adequatelygood.com/JavaScript-Scoping-and-Hoisting.html).\n\nLorsqu'une `var` est déclarée, elle est immédiatement initialisée et sa valeur est à ce moment égale à `undefined`. C'est lorsque l'exécution atteint la déclaration de la variable que sa valeur est spécifiée par l'*initializer* (l'assignement donné à cette variable). S'il n'y a pas d'*initializer*, la variable reste égale à `undefined`.\n\nLes variables `let` et `const` ne fonctionnent pas de la même manière : elles ont une *Temporal Dead Zone* (TDZ). Lorsqu'elles sont déclarées, un espace mémoire est créé au sein du bloc mais la variable n'est pas initialisée. C'est lorsque l'exécution atteint la variable qu'elle est initialisée, avec pour différence entre `let` et `const` que `const` doit obligatoirement avoir un *initializer*.\n\nPour les anglophones, voici un article qui parle plus en détails de la [Temporal Dead Zone](http://jsrocks.org/2015/01/temporal-dead-zone-tdz-demystified).\n\n## Arrow function\n\nL’ES6 apporte une nouvelle façon d’écrire des fonctions, appelée arrow function (ou fat arrow).\nEn dehors du fait que la syntaxe soit plus concise, les arrow functions ne créent pas leurs propres valeurs pour `this` (contrairement aux fonctions classiques qui ne récupèrent pas le `this` du bloc parent) : elles partagent leur valeur avec leur scope parent, ce qui permet d’éviter d’avoir à binder le « this ».\n\n```javascript\n// ES5\nfunction UiComponent() {\n    var _this = this; // (A)\n    var button = document.getElementById('myButton');\n    button.addEventListener('click', function () {\n        console.log('CLICK');\n        _this.handleClick(); // (B)\n    });\n}\nUiComponent.prototype.handleClick = function () {\n    ···\n};\n\n\n// ES6\nfunction UiComponent() {\n    var button = document.getElementById('myButton');\n    button.addEventListener('click', () => {\n        console.log('CLICK');\n        this.handleClick(); // (A)\n    });\n}\n```\n\nLorsque l’on a qu’un seul argument au sein d’une arrow function, il n’est pas obligatoire de mettre des parenthèses :\n\n```javascript\nconst function = parameter => expression\n```\n\nLes accolades sont nécessaires si la function exécute du code avant de retourner son résultat :\n\n```javascript\nconst function = parameter => {\n    // do some stuff\n    return expression\n}\n```\n\n## Symbol\n\nLes symbols sont un nouveau type primitif (comme Number, String et Boolean) apporté par ES6. Ils sont créés uniquement à partir des *factory function* (les fonctions qui ne sont ni des classes ni des constructeurs).\n\n```javascript\nvar sym1 = Symbol();\nvar sym2 = Symbol(\"toto\");\nvar sym3 = Symbol(\"toto\");\n```\n\nÀ chaque fois que la fonction est appelée, un nouvel et unique symbol est créé : cela signifie que deux symbols ne seront jamais égaux, même si leur valeur est la même.\n\n```javascript\nSymbol(\"toto\") === Symbol(\"toto\"); // false\n```\n\nLe principal intérêt des symbols se trouve principalement dans leur utilisation avec les objets : il est possible de les assigner comme clé, ce qui nous permet de créer des clés uniques qui ne rentreront jamais en conflit avec d'autres clés.\n\n## Generators\n\nToutes les nouveautés apportées par ES6 ne sont pas que des fonctionnalités. Il y a, parmi ces nouveautés, les generators, qui sont une nouvelle façon de boucler sur une collection en JavaScript. Les generators comprennent en réalité deux protocoles.\n\n### Le protocole itérateur ###\n\nLe protocole itérateur définit une façon standard pour produire une suite de valeurs, ainsi qu'une valeur de retour. Un objet est un itérateur lorsqu'il implémente une fonction `next()` qui retourne un objet avec deux propriétés : la `value` (qui correspond à la valeur courante lors de l'itération), et `done` (un booléen qui indique si on a atteint la fin de l'itération ou non).\n\n    Ce sont les appels successifs à la méthode `next()` qui permettent donc de traverser et récupérer les valeurs d'un objet, comme montré dans cet exemple d'un tableau qui contiendrait deux valeurs (a et b) :\n\n```javascript\niteratorArray.next();\n// -> Object {value: \"a\", done: false}\niteratorArray.next();\n// -> Object {value: \"b\", done: false}\niteratorArray.next();\n// -> Object {value: undefined, done: true}\n```\n\n### Le protocole itérable ###\n\nLe protocole itérable permet aux objets de définir leur comportement lors d'une itération (car ils n'en ont pas nativement, contrairement aux tableaux). Un objet est un itérable s'il implémente une méthode particulière qui va retourner l'itérateur. Cette méthode doit être définie en utilisant le symbole `[Symbol.iterator]`.\n\n    Pour reprendre l'exemple précédent, voici l'itérable d'un tableau :\n\n```javascript\nconst arr = [\"a\", \"b\"];\nconst iteratorArray = arr[Symbol.iterator]();\niteratorArray.next();\n// -> Object {value: \"a\", done: false}\niteratorArray.next();\n// -> Object {value: \"b\", done: false}\niteratorArray.next();\n// -> Object {value: undefined, done: true}\n```\n\nSans ces protocoles, une bonne partie des fonctionnalités (comme le spread ou le destructuring) ne pourrait pas exister :\n\n```javascript\nconst arr = [\"a\", \"b\"];\n\n// La syntaxe à laquelle on pense immédiatement est la syntaxe « for... of »\n// qui permet de boucler sur les valeurs des Iterables.\nfor (val of arr) {\n  console.log(val);\n}\n\n// Le spread qui permet d'insérer facilement des valeurs dans un Array\n// utilise des Iterables.\n[\"0\", ...arr, \"1\"]; // 0, a, b, 1\n\n// Le destructuring avec le pattern Array\nconst [x, y] = arr; // x = 'a',  y = \"b\"\n```\n\nVoici un [article](http://2ality.com/2015/02/es6-iteration.html) qui vous permettra de creuser si le sujet vous intéresse.\n\n## Classes\n\nL'ajout des classes en JavaScript est juste une façon d'utiliser les constructeurs de manière plus lisible et accessible.\n\nEn ES5, on implémente le constructeur de la fonction directement :\n\n```javascript\nfunction Person(name) {\n    this.name = name;\n}\nPerson.prototype.describe = function () {\n    return 'Person called '+this.name;\n};\n```\n\nAlors qu'en ES6 on utilise une classe :\n\n```javascript\nclass Person {\n    constructor(name) {\n        this.name = name;\n    }\n    describe() {\n        return 'Person called '+this.name;\n    }\n}\n```\n\nLa syntaxe pour les getters et les setters reste la même qu'en ES5 :\n\n```javascript\nclass MyClass {\n    get prop() {\n        return 'getter';\n    }\n    set prop(value) {\n        console.log('setter: '+value);\n    }\n}\n```\n\nUne sous-classe hérite d'une autre classe grâce à l'utilisation du mot clé `extends`.\n\nSi l'on construit un constructeur dans une sous-classe, on doit utiliser `super()` avant `this`.\n\n```javascript\nclass Animal {\n  constructor(name) {\n    this.name = name;\n  }\n\n  makeSound() {\n    console.log(this.name + ' make some noise.');\n  }\n}\n\nclass Dog extends Animal {\n  constructor(name) {\n    super(name); // appelle le constructeur parent avec le paramètre\n  }\n  makeSound() {\n    console.log(this.name + ' bark.');\n  }\n}\n```\n\n⚠️ Contrairement aux fonctions, les classes ne bénéficient pas du hoisting. Il est donc nécessaire de déclarer la classe avant de l'instancier :\n\n```javascript\nconst p = new Rectangle(); // ReferenceError\n\nclass Rectangle {}\n```\n\nVoici un [article](https://medium.com/@robertgrosse/how-es6-classes-really-work-and-how-to-build-your-own-fd6085eb326a) (en anglais !) qui pourrait vous intéresser si vous cherchez à comprendre ce qui se passe en coulisses, ou [celui-ci](http://exploringjs.com/es6/ch_classes.html#ch_classes) pour creuser le sujet et voir toutes les subtilités des classes.\n\n## Conclusion\n\nCet article est loin d'être exhaustif (comme vous pouvez le voir [ici](http://tc39wiki.calculist.org/es6/)), et se concentre sur certaines des nouvelles fonctionnalités les plus utilisées. Il a principalement pour but de donner des premières pistes de compréhension sur les concepts abordés (car il serait possible d'écrire un article entier sur chacune des fonctionnalités), mais n'hésitez pas à vous documenter plus en profondeur !\nPar ailleurs, une deuxième partie arrive bientôt pour parler d'autres fonctionnalités très utilisées, comme le spread operator, le destructuring, ou les modules.\n"}