{"date":"2020-03-04T00:00:00.000Z","title":"Entretien utilisateur, mène ton enquête comme Benoit Blanc","excerpt":"Faire des entretiens avec ses utilisateurs ne s’improvise pas. C’est un exercice qui se prépare et qui est plus difficile qu’il n’y paraît. Cet article va vous présenter une méthode pour vous aider dans cette tâche","readingTime":"9mn","authors":["psur-eleven"],"categories":["agile"],"content":"\n## Introduction\nL’entretien utilisateur doit vous aider à prendre de meilleures décisions, en analysant méthodiquement les besoins de vos utilisateurs, au lieu de vous baser sur vos intuitions. Nullement censé remplacer les analyses quantitatives, il permettra en revanche de combler les angles morts de ces dernières en se concentrant davantage sur la qualité. Vous aurez une vision plus complète et juste des besoins des utilisateurs.\n\nFaire des entretiens avec ses utilisateurs ne s’improvise pas. C’est un exercice qui se prépare et qui est plus difficile qu’il n’y paraît.\n\nJe vais vous présenter une méthode, séparée en trois parties (avant, pendant et après l’entretien) pour vous aider dans cette tâche. Il faudra faire preuve de rigueur, d’empathie et de la perspicacité de Benoit Blanc.\n\n![](https://medias.spotern.com/spots/w640/308/308177-1582796703.jpg)\n\n## Avant l'entretien\n### Composez votre équipe\n\nDans l'idéal, composez une équipe de 3 personnes pour cet entretien.\n\n*L’interrogateur :* vous êtes celui qui mène l’entretien et devez être concentré à 100% dessus.\n\n*Le scribe :* son rôle est de retranscrire l’entretien et de noter les informations supplémentaires qui lui sembleront pertinentes, telles que les émotions que laisse transparaître l'utilisateur.\n\n*L'observateur :* son rôle, comme son nom l’indique, est d’observer l’entretien, mais avec une certaine distance. Il n’intervient pas, sauf à la fin s’il a des questions supplémentaires (on y reviendra). Je conseille de proposer ce rôle à un profil différent du vôtre, comme à l’un de vos devs. Il vous apportera une vision différente et pourrait vous proposer des solutions auxquelles vous n’auriez pas pensé.\n\n### Trouvez les bons utilisateurs\n\nCiblez d'abord un type d'utilisateur (en fonction de vos personas) qui pourra vous apporter des renseignements utiles en fonction du sujet. Ensuite, il existe une multitude de moyens pour les trouver : emailing, fans et haters sur les réseaux sociaux, etc...\n\nEssayez de faire au moins 5-6 entretiens par type d’utilisateurs (ou persona) que vous aurez identifié, vous pourrez déjà commencer à dégager des tendances. Au-delà d’un certain nombre, les entretiens ne vous apporteront plus autant de renseignements et vous perdrez du temps au lieu de vous concentrer sur leur analyse et les actions à mener.\n\nPour trouver les bons utilisateurs à interviewer, il faut d'abord définir les objectifs de vos entretiens, les questions auxquelles il vous faut des réponses. Ensuite, assurez-vous de contacter seulement les utilisateurs qui répondent à vos besoins. Il existe une multitude de moyens pour les trouver : emailing, fans et haters sur les réseaux sociaux, etc... Si vous êtes en manque d’inspiration, je vous mets un lien renvoyant à une liste de [95 idées pour trouver vos utilisateurs](https://jasonevanish.com/2013/08/11/95-ways-to-find-your-first-customers-for-customer-development-or-your-first-sale/).\n\n### Préparez votre questionnaire\n\nRéalisez un brainstorming d'une vingtaine de questions avec votre équipe et gardez-en une dizaine seulement, celles qui vous paraissent les plus pertinentes.\n\nQuelques critères à respecter pour vous guider. Vos questions doivent :\n- être ouvertes, donc impossible de répondre par oui ou par non (d’où le nom de l’article) ;\n- tourner autour de 3 sujets fondamentaux : la valeur client, les points de frustration (appelés pain points plus souvent) et la motivation ;\n- challenger vos hypothèses.\n\nIl ne faut pas influencer l'utilisateur. Lors de votre entretien, essayez de rester le plus neutre possible, que ce soit dans vos questions, mais aussi dans vos réactions. Au lieu de demander \"Quelles difficultés éprouvez-vous à accéder à cette information ?\", dites plutôt \"Comment accédez-vous à cette information ?\"\n\nVous trouverez ci-dessous quelques exemples de questions types à poser durant votre entretien :\n- “Comment faites-vous cela aujourd’hui ?” Cela vous permettra de savoir quelle fonctionnalité il utilise pour arriver à sa fin, s’il utilise votre produit ou celui d’un compétiteur\n- “Qu’est-ce qui est le plus frustrant dans ce produit/cette fonctionnalité ?”\n- “Si vous aviez une baguette magique, qu’est-ce que vous aimeriez pouvoir faire (sur notre plateforme/avec notre produit/avec cette fonctionnalité) et qui n’est pas possible aujourd’hui ?”\n- “Est-ce que vous pouvez me donner un exemple ?”\n- “Si cette fonctionnalité/ce produit était disponible aujourd’hui, est-ce que vous l’utiliseriez/l'acheteriez ?”\n\n## Pendant l'entretien\n\n![](https://www.klatsch-tratsch.de/wp-content/uploads/2019/12/knives_out__daniel-craig_szenenbilder_18-300dpi.jpg)\n\n### L'accueil\n\nPremier réflexe, remerciez toujours l'utilisateur pour le temps accordé, pour avoir fait le déplacement (s'il se déplace dans vos bureaux par exemple). Je sais, ça paraît évident, mais on peut vite oublier les règles de base si l'on est stressé ou que c'est la première fois que l'on fait ce genre d'entretien.\n\nDemandez à votre interlocuteur s'il vous autorise à enregistrer la conversation. Rassurez-le sur le fait que cela restera anonyme et que cela est destiné à un usage en interne uniquement, et non pas à des fins publicitaires.\n\n### Mettez votre interlocuteur à l’aise\n\nCommencez par des questions basiques. En quoi consiste son rôle, avec quelle fréquence utilise-t-il votre produit, comment il en a entendu parler, etc... Le but est de le rassurer et de le mettre en confiance avant d’attaquer les questions à plus forte valeur ajoutée, celles qui vous intéressent vraiment. Essayez de faire passer ce moment comme une conversation informelle, votre interlocuteur sera plus détendu et par conséquent plus enclin à partager son point de vue et ses motivations.\n\n### Dans le vif du sujet\n\n**Ouvert d’esprit tu seras**\nUn point important avant d’attaquer les questions que vous vous êtes notées : cette liste n'est pas un script que vous devez suivre à la lettre. Voyez-là plutôt comme un cadre, des points d'ancrage pour recentrer l'entretien si besoin.\n\nAussi, faites preuve d'ouverture d'esprit. Vous êtes ici pour écouter votre utilisateur, alors montrez-lui que vous vous sentez privilégié et chanceux de pouvoir écouter ce qu'il a à dire, il n’en sera que plus enclin à partager son expérience avec vous. Et surtout (!) on évite de vendre son produit ou son idée \"hein, hein elle est bien ma feature !\"\n\n**L’arsenal du détective**\nEn tant que questionneur, vous devez penser comme un détective et trouver quel motif se cache derrière les réponses de votre utilisateur. Pourquoi éprouve-t-il de la peine à trouver telle information ? Pourquoi veut-il absolument cette fonctionnalité ?\nUne technique directement issue de The Lean Startup d’Eric Ries (un must read, si vous ne l’avez toujours pas lu) et très pratique pour comprendre les motivations profondes de vos utilisateurs est celle des **5 Whys**. Cette technique consiste à demander “Pourquoi” cinq fois d'affilé aux réponses de votre interlocateur. Pour plus d'information sur cette technique, je vous ai mis un lien vers un [article qui détaille les étapes à suivre](https://kanbanize.com/lean-management/improvement/5-whys-analysis-tool/).\n\nAssurez-vous de valider les informations que vous communique l'utilisateur. Pour cela, vous pouvez pratiquer **l’écoute active**. Cela consiste à écouter attentivement l’autre, dans un climat de confiance et de respect et de faire preuve d’empathie. La reformulation, qui fait partie de cette technique, est très utile pour s’assurer que l’on a bien compris le message de notre interlocuteur et le valider avec lui.\n\nPar ailleurs, une personne ne vous livrera pas toutes les informations d'un coup généralement. C’est donc votre rôle de lui donner un petit coup de pouce en la **relançant**/lui demandant des spécifications (le fameux “vous avez un exemple ?” vu plus tôt) :\n\nExemple :\n\n*L’utilisateur :* “J’ai trouvé l’application vraiment facile à utiliser”\n*L’interrogateur :* “Qu’est-ce qui rend cette application ergonomique ?”\n*L’utilisateur :* “Et bien, l’interface n’était pas polluée avec trop d’informations…”\n\n\nEnfin, si vous avez un observateur avec vous, laissez-lui un peu de temps à la fin pour qu'il puisse poser ses questions. De par sa position plus distante, il aura peut-être perçu certaines informations que vous n'avez pas relevées et pourra approfondir les points qu'il juge intéressant de creuser.\n\n\n**On échange les rôles**\nUne fois cette étape terminée, il est temps d'inverser les rôles et de proposer à votre interlocuteur de vous poser des questions à son tour. D'une part, c'est un moyen de l'engager encore plus (peut-être l'occasion de sécuriser un beta testeur héhé), d'autre part, il pourrait soulever un point pertinent auquel vous n'aviez pas pensé.\n\n## Après l'entretien\n\nRemerciez l’utilisateur pour le temps accordé (super basique, je sais) et passez au débrief avec votre équipe. Est-ce que l’entretien vous a appris de nouvelles choses ? A-t-il confirmé des tendances que vous aviez déjà observées ? Vous pouvez également faire votre autocritique, surtout lors des premiers essais. Est-ce que vous aviez la bonne attitude ? Avez-vous réussi à mettre l’utilisateur à l’aise ? Êtes-vous resté seulement en surface ou êtes-vous parvenu à creuser davantage ?\n\nEnsuite ? Ne vous précipitez pas sur votre ordinateur, prenez le temps de réfléchir à cet entretien et laissez mariner. Puis, partagez avec votre équipe ce que vous avez appris, ce qui vous a surpris, les pain points des utilisateurs, ou au contraire, les fonctionnalités les plus utiles. Cela permettra à tous les membres de votre équipe d’avoir une meilleure compréhension des besoins utilisateurs (vous avez une place privilégiée, proche de l’utilisateur, ce qui n’est pas le cas de tout le monde).\n\nN’hésitez pas à varier les formats lors de la présentation des résultats de votre analyse. Ci-dessous quelques exemples de supports :\n\n*User journey map :* cela illustrera toutes les actions menées par votre utilisateur en partant d’un point A pour arriver jusqu’à un point B\n*Personas :* particulièrement utile pour décrire les différents types d’utilisateurs, leurs motivations, frustrations et pour justifier les user stories qui en découlent\n*Présentation classique :* communiquez le rapport que vous avez réalisé, mais incluez si possible des exemples, des citations, des situations concrètes, afin d’engager votre audience.\n\n## Conclusion\n\nL’entretien utilisateur est un outil très puissant pour définir le besoin de vos utilisateurs, leurs pain points et identifier des opportunités pour orienter vos futurs développement (a.k.a. ne pas faire perdre de temps à vos devs, a.k.a. économiser du temps et de l’argent, a.k.a. se concentrer sur des fonctionnalités qui apporteront de la valeur à vos utilisateurs).\n\nMême en suivant ce guide, vous ferez des erreurs lors de vos premiers essais, mais persistez et apprenez de vos erreurs. Dans tous les cas, faites preuve d’ouverture d’esprit, d’empathie et gardez toujours cette âme de détective pour trouver les motivations profondes de vos utilisateurs.\n\n"}