{"date":"2020-04-29T00:00:00.000Z","title":"Munin, le monitoring des dieux","excerpt":"Certains connaissent Munin, le corbeau de la mythologie nordique. C'est en l'occurrence un lointain cousin que vous allez découvrir dans cet article : L'outil de monitoring Munin.","readingTime":"4mn","authors":["jbernard"],"categories":["architecture"],"content":"\nPour les amateurs de mythologie nordique, Munin et Hunin sont les deux corbeaux d’Odin. Ils surveillent les moindres recoins de Midgard et rapportent ensuite à leur maître. L’application qui nous intéresse aujourd’hui porte donc bien son nom car elle permet le monitoring et le reporting des constantes de vos différents serveurs, et est baptisée Munin.\nAprès une rapide présentation, nous nous attarderons sur le processus d'installation de cette dernière et sur son utilisation.\n\n\n## 1. Présentation\n\nMunin est une application self-hosted open-source (code sur GitHub) créée en 2002 et encore activement maintenue à ce jour. Elle propose une foule de plugins permettant de monitorer de nombreux éléments vitaux des vos machines comme l’usage des CPU ou de la RAM, le load-average ou encore le taux d’utilisation des interfaces réseaux. Le tout est affiché via une interface web sobre et efficace.\n\nLe soft sauvegarde ces informations sur la durée et permet une visualisation sur une longue période de l’évolution des différentes métriques.\n\nEnfin, il a la particularité de gérer autant de machine que vous le souhaitez grâce à un système de Master/Nodes simples et faciles à configurer.\n\n## 2. Pré-requis\n\n- Avoir un utilisateur sudo sur chaque machine que vous souhaitez configurer\n- Identifier la machine destinée à disposer du Master (en l'occurrence là où sera exposée l’interface web)\n\n## 3. Installation et configuration du Master\n\n### Installation\nPassons directement à l’installation de Munin sur le serveur Master à proprement parler :\n\n```\nsudo apt-get update\nsudo apt-get install munin\n```\n\n### Configuration\nUne fois cette installation terminée, nous pouvons passer à la configuration.\nLa configuration de Munin se trouve dans le fichier `munin.conf` localisé dans le dossier `/etc/munin`. Avec votre éditeur de texte préféré, ouvrez ce fichier de configuration pour pouvoir visualiser les premières options qui nous intéressent :\n\n```\ndbdir     /var/lib/munin\nhtmldir   /var/www/munin\nlogdir    /var/log/munin\nrundir    /var/run/munin\n```\n\nLa ligne qui nous intéresse ici est le `htmldir`. C’est dans ce dossier que seront stockées les pages et images statiques de l’interface web. N’hésitez pas à configurer ce chemin selon vos besoin, en fonction de l’installation de votre serveur web (Nginx, Apache, …)\nLa seconde partie de la configuration qui nous intéresse se situe plus bas, dans ce même fichier :\n```\n[localhost.localdomain]\n    address 127.0.0.1\n    use_node_name yes\n```\n\nIl s’agit ici de l’endroit où nous allons référencer le master et les différents nodes afin de les monitorer. Par exemple, j’ai choisi de renommer mon master comme suit :\n\n```\n[ElevenMaster]\n    address 127.0.0.1\n    use_node_name yes\n```\n\nLe nom que j’ai choisi, `ElevenMaster`, sera donc affiché sur l’interface web pour décrire ma machine, en l'occurrence le Master de notre infrastructure Munin.\nIl ne reste plus qu'à sauvegarder et fermer le fichier de configuration puis relancer le service Munin pour prendre en compte ces nouvelles configurations :\n\n```\nsudo service munin-node restart\n```\n\nLes fichiers statiques de l’interface web devraient maintenant être disponibles dans le dossier indiqué précédemment dans la configuration (ligne `htmldir`) :\n\n![](/imgs/posts/2020-04-29-munin-monitoring-odin/eleven-master.png)\n\nLe monitoring de votre machine “Master” est donc bien en place. Voyons maintenant la suite.\n\n## 4. Installation et configuration d’un Node\n\n### Installation\n\nLe monitoring de votre machine “Master” est donc maintenant en place.\nL'intérêt majeur de Munin réside dans sa capacité à gérer pour vous une multitude de machine sans effort. Sur une seconde machine, il suffit donc d’installer le package `munin-node` puis de procéder à deux petites configurations : l’une du côté du Node, l’autre du côté du Master.\n\nL’installation du package tout d’abord :\n\n```\nsudo apt-get update\nsudo apt-get install munin-node\n```\n\n\n### Configuration\n\nIl vous faut ensuite configurer le munin-node pour autoriser le Master à récupérer les données requises. Cela se passe dans le fichier de configuration `/etc/munin/munin-node.conf`, au niveau de la ligne autorisant le localhost :\n```\nallow ^127.0.0.1$\n```\n\nIl faut remplacer cette IP locale par l’ip publique du serveur Master, au format RegExp. Ce qui donnerait par exemple :\n\n```\nallow ^145\\.78\\.309\\.444$\n```\n\nRelancez maintenant le service Munin-node pour prendre en compte cette configuration :\n\n```\nsudo service munin-node restart\n```\n\nDe retour sur le Master pour la dernière étape, il nous faut ajouter le Node dans la liste des machine monitorée. Dans le fichier de configuration du Master (`/etc/munin/munin.conf`), ajoutez le Node à la suite de la déclaration du Master faite précédemment. Il vous faudra y indiquer un nom représentant le Node ainsi que l’adresse IP de ce dernier. En reprenant notre exemple de tout à l’heure :\n\n```\n[ElevenMaster]\n    address 127.0.0.1\n    use_node_name yes\n[ElevenNode]\n    address 267.117.81.341\n    use_node_name yes\n```\n\nSauvegardez, fermez le fichier de configuration et une fois de plus relancez le service Munin pour prendre en compte ce nouveau Node :\n\n```\nsudo service munin-node restart\n```\n\nAu bout de quelques minutes, le temps que Munin récupère les informations du Node fraîchement ajouté, vous devriez voir apparaître votre seconde machine dans l’interface web :\n\n![](/imgs/posts/2020-04-29-munin-monitoring-odin/eleven-node.png)\n\nVotre instance de Munin est maintenant en place. Vous pouvez à tout moment configurer des outils de monitoring spécifiques (apache, mysql, nginx, etc) grace aux [plugins issus de la communauté](http://gallery.munin-monitoring.org/), il y a beaucoup de choses très utiles.\n"}