{"date":"2015-12-21T00:00:00.000Z","title":"PHP 7 - Le petit guide qui ne trompe pas","excerpt":"> Dans la vie, il n'y a pas que Symfony — Un collègue","readingTime":"7mn","authors":["aandre"],"categories":["php"],"content":"> Dans la vie, il n'y a pas que Symfony — Un collègue\n\nLes frameworks sont indispensables au monde des entreprises, mais occultent parfois les évolutions d'un langage. C'est le cas de PHP 7, qui même si sa sortie est largement relayée, est caché derrière d'autres projets portés par le langage. À l'aube d'un changement potentiellement radical dans la façon de développer en PHP, il est important de souligner les évolutions apportées et leurs conséquences.\n\n# PHP 6\n\nEn premier lieu, évoquons le fait que nous soyons passés de PHP 5 à PHP 7.\nPHP 6 a existé de 2005 à 2014.\n\nParmi les fonctionnalités prévues dans cette version on peut évoquer :\n\n*   Support de l'UTF-8\n*   Support natif des annotations\n*   Multi-thread & meilleur support 64 bits\n\nNéanmoins, aucune version stable n'est jamais sortie, même si de nombreux livres sur le sujet sont sortis durant ces quelques années. Afin d'éviter toute confusion avec PHP 6, la nouvelle version de PHP est donc passée à 7.\n\n# Les origines de PHP 7\n\nAfin de comprendre l'origine de PHP 7, il est nécessaire de parler des problèmes de performance de l'interpréteur PHP. Clairement orienté pour le web, le langage souffre néanmoins de nombreux défauts, notamment lorsqu'il est question de performance et de rapidité d'exécution.\n\nConfrontés à ces problèmes, la société Facebook ; reposant sur PHP ; lance en 2008 l'initiative d'un projet basé sur PHP avec plusieurs améliorations, autant situées au niveau des paradigmes du langage, que sur son exécution. Le projet viendra finalement à terme sous le nom de HHVM, et sera utilisé en production par la société, en multipliant par deux la vitesse d'exécution du langage, via une transformation en [bytecode](https://en.wikipedia.org/wiki/Bytecode){:rel=\"nofollow noreferrer\"} du code source.\n\nÉtant distribué librement, HHVM fait son chemin depuis quelques années comme alternative non-officielle au moteur PHP, employé ça et là par quelques sociétés, mais également cité dans de nombreux benchmarks.\n\nAfin d'endiguer la montée d'HHVM, la communauté des développeurs du moteur PHP se doit de répondre avec une solution officielle. S'il s'agit au départ d'un nettoyage des API, la branche dérive rapidement sur une refonte du moteur nommé \"PHP-NG\" (New Generation). Cette branche sera par la suite réintégrée à la branche principale du projet en 2014. Au même moment, PHP 6 sera officiellement annulé et l'intégration de ce nouveau moteur permettra la création de PHP 7.\n\n# Les nouveautés\n\nLa refonte du moteur est une des nouveautés majeures de PHP 7 puisqu'il multiple par deux la vitesse d'exécution du code source. Mais de nombreuses fonctionnalités ont été proposées, parfois acceptées, et parfois refusées. Cet article se veut être un résumé des changements majeurs et non une liste exhaustive.\n\n## Spaceship operator\n\nNon sans humour, l'opérateur de comparaison introduit a en effet une ressemble visuelle importante avec un vaisseau spatial : <=> . Son intérêt est néanmoins tout autre, il permet de comparer deux variables d'une façon beaucoup plus simplifiée que ce qui était proposé auparavant. Si les deux opérandes sont égales, l'opérateur renverra 0, 1 si l'opérande de gauche est plus grande, -1 sinon.\n\n```php\n<?php\n// PHP 5\nusort($r, function($a, $b) {\n  if ($a < $b) {\n    return -1;\n  } elseif ($a > $b) {\n    return 1;\n  }\n\n  return 0;\n});\n// PHP 7\nusort($r, function($a, $b) {\n  return $a <=> $b;\n});\n```\n\nUn opérateur qui simplifie donc la vie des développeurs. Cependant, l'importance de cet opérateur est négligeable sur du code orienté objet, celui-ci se contentant de comparer les valeurs des attributs. Il aurait été intéressant de créer une interface de type Comparable comme ce qu'il existe en Java, afin de mieux gérer la comparaison entre objets.\n\n##  Null coalesce operator\n\nAutre opérateur ajouté, il sert deux buts : les tests et l'affectation. Jusqu'ici, il fallait tester l'existence d'une variable avant de l'affecter à une autre par le biais d'une condition (en général un ternaire). Ici, l'opérateur simplifie encore une fois le travail des développeurs :\n\n```php\n<?php\n// PHP 5\n$foo = isset($bar) ? $bar : 'baz';\n// or\n$foo = 'baz';\nif (isset($bar)) {\n  $foo = $bar;\n}\n// PHP 7\n$foo = $bar ?? $baz;\n```\n\n## Les classes anonymes\n\nLargement inspiré de Java, les classes anonymes font leur entrée en PHP 7\\. Une suite logique à l'introduction des fonctions anonymes en PHP 5.3\\. Tout comme les classes définies, elle acceptent l'héritage, l'implémentation et l'usage des traits. L'avantage est multiple mais reste spécifique.\nOn peut évoquer une simplification des mocks dans les tests unitaires, ou une alternative à la lourdeur de la norme PSR (qui recommande la création d'un fichier par classe) dans certains cas :\n\n```php\n<?php\nuse Psr\\Log\\LoggerInterface,\n\n$foo->setLogger(new class implements LoggerInterface {\n  public function log($level, $message, array $context = array()) {\n    // do something\n  }\n\n  // etc.\n});\n```\n\n## Scalar Type Hinting\n\nPHP a toujours été reconnu pour son typage faible et sa permissivité parfois extrême, qui peut mener à des incohérences et de nombreuses heures de debug. Dans cette nouvelle version de PHP, le typage fort est probablement l'une des plus importantes évolutions du langage, et ce n'est pas sans débats que celle-ci a été intégrée. Il aura en effet fallu pas moins de 5 propositions pour faire accepter cette fonctionnalité.\n\nLe but est d'autoriser le typage des types primitifs (ou scalaires) en argument des méthodes ou fonctions, comme c'est déjà le cas pour les objets, les tableaux et les fonctions anonymes. Étant donné le changement majeur apporté, il a été décidé que ce typage fort serait optionnel. Pour l'activer, il faudra utiliser l'instruction : \"declare(strict_types=1);\". Par ailleurs cette instruction doit être la première après avoir déclaré le tag \"\n\nIl est important de préciser que de l'autocast peut-être réalisé dans certains cas par le moteur, et qu'il reste possible de forcer le cast manuellement lors de l'appel d'une fonction ou méthode.\n\nUn exemple de contournement :\n\n```php\n<?php\ndeclare(strict_types=1);\n\nfunction mySum(float $a, float $b)\n{\n  return $a + $b;\n}\n\necho mySum((float) \"1.0\", (float) \"2\");\n```\n\n## Types de retour\n\nSouvent associée au Scalar Type Hinting, cette fonctionnalité est pourtant différente et fonctionne en toute circonstances, quelque soit la valeur ou la présence du \"declare(strict_types=1|0)\". Il s'agit ici d'une nouvelle implémentation et non d'une amélioration de l'existant comme pour le typage d'arguments. Sont supportés en retour de méthodes les types primitifs ainsi que les différentes classes, mais également les mots-clé \"self\" et \"parent\".\n\nNous noterons deux choses supplémentaires qui sont importantes à prendre en compte :\n\n*   Aucun type \"void\", mais il n'est pas exclu que celui-ci ne soit rajouté dans une prochaine version ;\n*   Retourner null dans une fonction ou méthode dont le retour est typé soulève une erreur. Cependant, une discussion est ouverte sur un objet potentiellement nul, dont la syntaxe serait ?MyObject.\n\nExemple de syntaxe :\n\n```php\n<?php\n\n// pas de typage en entrée, cela peut donc lever une erreur\n// (cf. le nouveau système d'exception plus bas)\nfunction bar($a, $b) : int\n{\n  return $a + $b;\n}\n```\n\n## Throwable\n\nEnfin, dernière modification majeure, le changement du système d'exceptions.\nJusqu'ici tout était géré par exceptions, en PHP 7, le mécanisme a été scindé en deux : exceptions d'un côté (Exception), erreur de l'autre (Error), les deux implémentant l'interface Throwable. Le but étant de pouvoir _catcher_ certaines erreurs propres au moteur, par exemple une division par 0, ou encore un problème de typage comme nous avons pu le voir plus haut. On peut donc faire l'hypothèse que la plupart des exceptions relèveront du code métier.\n\nUn point important est qu'il est impossible d'implémenter directement l'interface Throwable, il faudra impérativement hériter d'Exception, mais il sera possible d'utiliser l'interface lors du typage, pour _catcher_ les erreurs et les exceptions de la même manière. Vous pouvez consulter la liste des erreurs prédéfinies [ici](http://php.net/manual/en/reserved.exceptions.php){:rel=\"nofollow noreferrer\"}.\n\n## Sortie\n\nLa première release stable est sortie le 3 décembre 2015, et un premier patch correctif (7.0.1) a été diffusé le 17 décembre. Étant donné les nombreux changements apportés par cette nouvelle version, il reste à savoir combien de temps l'adoption de PHP 7 prendra par le monde professionnel. Sachant que certains systèmes d'informations tournant encore sur PHP 4, d'autres sur des versions de PHP plus récentes, mais souvent obsolètes, il n'est pas improbable que la migration prenne plusieurs années.\n"}