{"date":"2021-11-03T00:00:00.000Z","title":"Développer et publier un paquet sur npmjs","excerpt":"Dans cet article, nous allors voir ensemble comment développer et publier un paquet sur npmjs.","readingTime":"6mn","authors":["ygherbi"],"categories":["javascript"],"content":"![logo-npm](/imgs/posts/2021-11-03-publication-npmjs/npm-logo.png)  \n  \n  \nDe nos jours, en tant que développeurs front nous sommes constamment confrontés au fait d’utiliser des librairies.\nUne librairie publiée sur npmjs se nomme un paquet, et nous les installons au moyen de npm.\nIls sont principalement là pour nous faciliter le quotidien : un paquet répond à un besoin, ce qui évite d'avoir à sans cesse réinventer la roue.\n\nAujourd’hui nous allons voir ensemble comment développer et publier un paquet sur npmjs.\nL’objectif de cet article est de vous apprendre par l’exemple, nous allons donc développer ensemble un paquet qui permet de générer des données utilisateurs aléatoirement.\n\n## Prérequis :\n\nAvant toute chose, vous aurez besoin pour commencer d’un compte npmjs, que vous pouvez créer [ici](https://www.npmjs.com/signup).\n\n**Note très importante :** confirmez votre compte en cliquant sur le lien du mail de npmjs sinon vous ne pourrez pas publier votre paquet.\n\nNodeJs : pour vérifier que node est bien installé, lancez la commande suivante.\n\n- `node -v`\n\nVous devriez avoir ce résultat (pas forcément la même version)\n\n![node-v capture](/imgs/posts/2021-11-03-publication-npmjs/node-version.png)\n\nL'usage de Git est quant à lui optionnel.\n\n\n## **SOMMAIRE**\n\nPARTIE 1 : **Développer son paquet**\n\nPARTIE 2 : **Tester son paquet**\n\nPARTIE 3 : **Publication du paquet**\n\nPARTIE 4 : **Versioning**\n\nPARTIE 5 : **Conclusion**\n\n\n\n## PARTIE 1 : Développer son paquet\n\n### a/ Rappel des notions de base\n\nNpm permet d’automatiser la gestion des dépendances et des paquets dans les projets javascript.\nUn “package” ou “paquet” ou encore “librairie” est un bloc de code composé de fonctions/classes qui permettent d’effectuer des tâches.\n\nUtiliser un paquet permet de ne pas avoir à réinventer la roue et ne pas coder tout soi-même. Quand d’autres développeurs ont déjà développé une fonctionnalité, pourquoi ne pas la réutiliser ?\n\nUn paquet est généralement accompagné d’une documentation afin que les utilisateurs s’y retrouvent.\n\nÇa, c'était pour la partie théorique, passons maintenant à la partie pratique.\n\n### b/ Développer son paquet\n\n#### Étape 1 :\n\nCréez un dossier avec le nom « tutorial-paquet-npm » et placez-vous dans le dossier.\nPrenez votre terminal et lancez les commandes suivantes :\n\nCréez le dossier : `mkdir tutorial-paquet-npm`\n\nEntrez dans le dossier : `cd tutorial-paquet-npm`\n\n#### Étape 2:\n\nCréez un fichier package.json\n\n`npm init -y`\n\nLe fichier package.json aura comme contenu le nom du projet, la version, son auteur, une description, les dépendances et d’autres informations.\nAjoutez ceci dans votre package.json\n\n````json\n\"type\": \"module\",\n````\n\nVotre package.json devrait ressembler à ceci :\n\n![paquet package.json init](/imgs/posts/2021-11-03-publication-npmjs/paquet-package-init.png)\n\nSi vous ne souhaitez pas publier votre paquet sur github/gitlab passez à l’étape 4.\n\n#### Étape 3 :\n\nCréez un fichier .gitignore.\n\nCe fichier est utile pour ignorer les fichiers, par exemple : les builds ou encore les fichiers compilés en lien avec le langage utilisé.\n\n`touch .gitignore`\n\nAjoutez la ligne suivante dans votre fichier :\n\n`node_modules/`\n\n![paquet .gitignore capture](/imgs/posts/2021-11-03-publication-npmjs/paquet-add-gitignore.png)\n\n\nCela permettra lors du versioning de ne pas envoyer le dossier “node_modules” sur git.\n\nJe vous laisse en autonomie pour publier sur github/gitlab.\n\n#### Étape 4 :\n\nPour définir le nom de votre paquet :\n\nhttps://www.npmjs.com/package/VOTRE_NOM_DE_PAQUAGE\n\nSi vous atterrissez sur une 404, BRAVO le nom est disponible, sinon trouvez-en un autre. ☺\n\nMaintenant que vous avez trouvé un nom de paquet, veuillez le modifier dans le fichier package.json.\n\n![packahe.json maj](/imgs/posts/2021-11-03-publication-npmjs/paquet-package-maj-name.png)\n\n\n#### Étape 5 :\n\nCréons un fichier index.js à la racine du projet, là où est placé le fichier package.json.\n\n`touch index.js`\n\n(Dans notre package.json notre main est index.js, le nom est modifiable)\n\nNous allons aussi installer le paquet node-fetch\n\n`npm i node-fetch`\n\n\n\nDans notre fichier index.js\n\n````js\nimport fetch from \"node-fetch\";\nexport const getRandomUser = async () => (await fetch('https://randomuser.me/api/')).json();\n````\n\n![paquet index.js](/imgs/posts/2021-11-03-publication-npmjs/paquet-index.png)\n\n\nNous exportons getRandomUser pour qu’elle puisse être appelée par nos futurs utilisateurs.\n\n### Partie 2 : Tester son paquet\n\nDans votre terminal à la racine de votre projet faites un :\n\n`npm link`\n\nPour comprendre ce que fait “npm link” je vous invite à lire la [documentation officielle](https://docs.npmjs.com/cli/v7/commands/npm-link).\n\nUne fois le link effectué, vous pouvez utiliser votre package sur n’importe quel projet installé sur votre machine #macOs <3\n\nNous allons maintenant initialiser un projet afin de tester notre paquet pour être sûr d’envoyer quelque chose de fonctionnel ☺\n\nSortez de la racine du projet et créez un nouveau dossier que nous  appellerons test_paquet et placez-vous dedans.\n\n`mkdir test_paquet`\n\n`cd test_paquet`\n\nInitialisons un fichier package.json.\n\n`npm init -y`\n\nAjoutez ceci dans votre package.json comme précédemment.\n\n````json\n\"type\": \"module\",\n````\n\nCréons un fichier index.js car n’oublions pas que c’est le main dans notre fichier package.json qui est généré.\n\n`touch index.js`\n\nMaintenant nous allons importer notre paquet :\n\nnpm link « LE NOM DE VOTRE PAQUET QUE VOUS AVEZ DÉFINI À L’ETAPE 4 »\nExemple : npm link tutorial-paquet-npm\n\n« tutorial-paquet-npm »  fait référence au nom que j’ai défini dans le fichier package.json du paquet développé/\n\nDans notre fichier index.js, ajoutez ceci :\n\n![index.js test](/imgs/posts/2021-11-03-publication-npmjs/test-index.png)\n\n\nNous importons le paquet que nous avons développé.\n\nEnsuite exécutez la commande suivante :\n\n`node index.js`\n\nCela va nous permettre de voir ce que nous renvoie notre paquet.\n\nDans votre console vous devriez avoir un user généré aléatoirement.\n\n![node index.js capture](/imgs/posts/2021-11-03-publication-npmjs/test-log-node.png)\n\nSi c’est le cas vous pouvez publier votre paquet avec la certitude qu’il est fonctionnel ☺\n\n### Partie 3 : Publication du paquet\n\n#### **a/ Publication**\n\nUne fois que vous avez vérifié votre paquet en local, nous allons passer à l’étape cruciale, : la publication sur npmjs ☺\nDans votre fichier package.json, nous allons ajouter des métadonnées pour que sur npmjs l’utilisateur dispose de multiples informations concernant votre paquet.\n\nNous allons ajouter homepage, repository et keywords qui sont optionnels.\nNote : Ajoutez homepage et repository seulement si vous avez publié votre paquet sur Gitlab/Github.\nDans le champ _author_ mettre votre nom et prénom pour informer que c’est vous le développeur du paquet.\n\n![package.json paquet finish](/imgs/posts/2021-11-03-publication-npmjs/paquet-maj-package-data-finish.png)\n\n\nSi vous n’avez pas créé votre compte sur npm, veuillez le faire maintenant et n’oubliez pas de valider votre compte via l’email reçu.\n\nhttps://www.npmjs.com/signup\n\nUne fois votre compte créé, rendez-vous à la racine de votre projet et lancez la commande :\n\n`npm login` (Vous allez devoir entrer votre username, password et mail)\n\n![Login-npmjs-capture](/imgs/posts/2021-11-03-publication-npmjs/login-npmjs.png)\n\n\nMaintenant vous pouvez lancer la commande suivante qui permet de publier votre paquet :\n\n\n`npm publish`\n\n![Npm publish capture](/imgs/posts/2021-11-03-publication-npmjs/npm-publish.png)\n\n\nVotre paquet est maintenant publié ! Vous pouvez aller le vérifier dans vos paquets via votre compte sur https://www.npmjs.com/\n\n#### **b/ Publier une maj de son paquet**\n\nAprès avoir corrigé un bug ou implémenté une fonctionnalité et si vous souhaitez publier vos modifications, c’est très simple.\n\nIl vous suffit simplement de changer la version de votre paquet qui se situe dans le fichier package.json.\n\nPour comprendre la gestion des versions, je vous laisse passer à la partie 4.\n\n\n\n### Partie 4 : Versioning\n\nLa version de votre paquet se situe dans votre fichier package.json\n\n````json\n\"version\": \"1.0.0\",\n````\n\nPour aider les développeurs qui s'appuient sur votre code, nous vous recommandons de démarrer la version de votre package à **1.0.0** et d'incrémenter comme suit :\n\n\n|Statut de code|Organisation|Règle|Exemple de version|\n|---|---|---|---|\n|Sortie de produit|Nouveau produit|La première version du produit commence par 1.0.0|1.0.0|\n|Correction de bug|Correctif|Incrémenter le troisième chiffre|1.0.1|\n|Implémentation d’une nouvelle fonctionnalité|Version mineure|Incrémenter le chiffre du milieu et remettre le dernier chiffre à zéro|1.1.0|\n|Modifications qui rompent la compatibilité descendante|Version majeure|Incrémenter le premier chiffre et réinitialisez les autres à zéro|2.0.0|\n\n**source**: https://docs.npmjs.com/about-semantic-versioning\n\n### PARTIE 5 : Conclusion\n\nMalheureusement en formation, on ne nous montre que la partie émergée de l'iceberg lors de l’utilisation de langage/framework.\nNous faisons appel à des librairies en pensant que c’est magique sans connaître la mécanique derrière.\n\nMaintenant que vous avez saisi la notion de paquet et comment le publier vous êtes fin prêt pour développer des librairies et aider la communauté. ☺\n\n\nSi vous souhaitez en savoir plus, rendez-vous sur la [documentation officielle](https://docs.npmjs.com/getting-started).\n\n"}