{"date":"2017-03-09T00:00:00.000Z","title":"Codeception, Retour d'expérience","excerpt":"Retour d'expérience sur le framework de test Codeception, présentation et exemples d'implémentations dans une application Symfony","readingTime":"9mn","authors":["nkania"],"categories":["php"],"content":"\n![Logo Codeception](/imgs/posts/2017-03-09-retour-experience-codeception/codeception-logo.png)\n\nDans cet article je vous propose un retour d'expérience sur le framework de test Codeception, outil choisi par mon équipe au sein de France Télévisions lors de la refonte de notre stack !\n\n- Contexte\n- Présentation\n- Notre utilisation\n\nContexte\n--------\n\n**Un peu de FitNesse..**\n\nQuand je suis arrivé dans l'équipe, une refonte d'une partie de notre SI était en cours. Des tests fonctionnels (en plus des unitaires bien entendu) étaient donc une obligation (refonte oblige). Le choix de l'époque s'était porté sur FitNesse ([http://fitnesse.org/](http://fitnesse.org/)) un outil qui permet d'écrire des tests de manière \"human friendly\". Le but était donc de laisser le PO écrire les tests fonctionnels. L'équipe technique quant à elle n'avait qu'à écrire les fixtures derrière.\n\nCe choix aurait pu être une bonne idée si dans la réalité des choses le PO avait réellement écrit les tests techniques. En réalité, l'équipe technique se retrouvait à écrire à la fois les tests techniques et fonctionnels. On devait donc utiliser un outil peu intuitif pour un dev (pas d'autocomplétion, utilisation abusive des tableaux...) et écrire les fixtures qui permettaient à ces tests d'interagir avec notre code.\n\nDans le cadre de la refonte d'une autre partie de notre SI nous avons donc décidé de changer d'outil de test fonctionnel, afin de choisir un outil plus adapté aux devs (le fait que les devs aient à réaliser les tests fonctionnels étant acté).\n\n**Pas de déception avec Codeception**\n\nNous avons cherché ce qui se faisait dans le domaine du test fonctionnel. Nos critères étaient d'avoir un outil qui n'est pas forcément \"human friendly\" mais qui ne constitue pas une difficulté pour les devs (PHP en l'occurence). On a de fait écarté tous les outils dans un langage tierce, à cause du temps d'apprentissage.\n\nOn a fini par découvrir Codeception ([http://codeception.com/](http://codeception.com/)) qui est une solution de test écrit en PHP et qui possède beaucoup de modules (AMQP, Doctrine2, Filesystem, MongoDb, REST, Symfony,...){:rel=\"nofollow noreferrer\"}.\n\nPrésentation\n--------\n\nCodeception permet de couvrir votre application entièrement, en effet ils intègrent tout type de tests :\n\n- Acceptance [http://codeception.com/docs/03-AcceptanceTests](http://codeception.com/docs/03-AcceptanceTests){:rel=\"nofollow noreferrer\"}\n- Functional [http://codeception.com/docs/04-FunctionalTests](http://codeception.com/docs/04-FunctionalTests){:rel=\"nofollow noreferrer\"}\n- Unit [http://codeception.com/docs/05-UnitTests](http://codeception.com/docs/05-UnitTests){:rel=\"nofollow noreferrer\"}\n\n**Les tests unitaires **\n\nConcernant les tests unitaires, il se base sur Phpunit (donc pas besoin de tout réapprendre, ne vous inquiétez pas), ils ajoutent juste une couche d'abstraction qui vous fournit quelques outils supplémentaires (notamment l'accès aux modules).\n\n**Les tests fonctionnels**\n\nIci, ce sont les tests fonctionnels qui nous intéressent le plus. Notre équipe n'a pas de front (nous ne fournissons qu'une API). Ils vont nous permettre de la tester de manière complète (nous en discuterons dans la prochaine partie).\n\n**Les tests d'acceptances**\n\nFinalement, pour les tests d'acceptances, plusieurs solutions sont proposées : PHP Browser, un simple crawler qui utilise Guzzle, ou Selenium (PhantomJS est possible aussi). Ces solutions permettent donc toutes de tester votre front.\n\n**Le BDD**\n\nVous pouvez aussi si vous le souhaitez faire du Behavior Driven Development en utilisant Gherkin. Si vous utilisez déjà Behat, vous pouvez aussi migrer vos tests vers Codeception afin d'avoir tous vos tests au même endroit.\n\n**La gestion de data**\nComme indiqué plus haut, plusieurs modules sont proposés pour gérer vos data. Vous pourrez donc facilement configurer une base de données pour vos tests et l'utiliser au travers des différents modules (Doctrine2, MongoDb, Redis, Memcache, ou tout simplement Db si vous souhaitez utiliser votre base SQL directement).\n\n**Et le reste**\n\nIls proposent aussi beaucoup d'helpers permettant de tester des webservices (REST ou SOAP) donc vous pourrez facilement simuler des appels sur vos API dans vos tests fonctionnels.\n\nJe ne l'approfondirai pas ici mais ils vous propose bien entendu des solutions pour tout ce qui est couverture de code, intégration continue,...\n\nNotre utilisation\n--------\n\n Je vais maintenant vous parler de l'utilisation que nous en faisons et donc aller un peu plus dans le détail. Nous avons besoin de couvrir notre code unitairement, pour cela pas de miracle, on utilise Phpunit (à travers Codeception) mais qui reste du test Phpunit classique (ça suffit largement). Le point le plus intéressant est donc la couverture de nos API et Crons fonctionnellement.\n\nTest sur un GET /endpoint (nous utilisons mongodb mais vous pouvez bien entendu utiliser n'importe quelle database !) :\n\nConfiguration :\n\n```yaml\n# api.suite.yml\nclass_name: ApiTester\nmodules:\n    enabled:\n        - Symfony:\n            app_path: '../../app'\n            var_path: '../../var'\n        - REST:\n            url: /\n            depends: Symfony\n        - MongoDb:\n            dsn: 'mongodb://root:root@localhost:27017/endpoint'\n            dump: tests/_data/\n```\n\nTest (attention le code ci-dessous n'est pas fonctionnel en l'état !) :\n\n```php\n# EndpointCest.php\n<?php\n\nuse Codeception\\Util\\HttpCode;\n\nclass EndpointCest\n{\n    protected $collection;\n\n    public function _before(ApiTester $I)\n    {\n        $this->collection = $I->getCollection('app.collection');\n    }\n\n    public function getEndpoint(ApiTester $I)\n    {\n        $I->wantTo('Get endpoint');\n\n        // Create a new Document\n        $document = new Document();\n        $document->setLabel('Label');\n\n        // Persist it in the database\n        $this->collection->save($document);\n\n        // Send the call\n        $I->haveHttpHeader('Content-Type', 'application/json');\n        $I->sendGET('/endpoints/' . $document->getId());\n\n        // Asserts\n        $I->seeResponseCodeIs(HttpCode::OK);\n        $I->seeHttpHeader('Content-Type', 'application/json');\n        $I->seeHttpHeader('Last-Modified');\n        $I->seeHttpHeader('Etag');\n        $I->seeHttpHeader('cache-control', 'no-cache, private');\n        $I->seeResponseContainsJson([ 'label' => 'Label' ]);\n    }\n }\n```\n\nOn vient donc de vérifier que notre API nous retourne bien nos données avec le bon code HTTP et les bon headers. Il existe beaucoup d'helpers qui vous permettent de vérifier un peu tout et n'importe quoi. Et si vous ne trouvez pas votre bonheur, vous pouvez ajoutez les vôtres très simplement !\n\nL'avantage c'est que l'ajout de module se fait très simplement. Imaginons que votre code envoie une notification rabbitMQ lors d'une modification de donnée à travers votre API. Vous devez rajouter la configuration du module rabbitMQ dans codeception :\n\n```yaml\n# api.suite.yml\nclass_name: ApiTester\nmodules:\n    enabled:\n        - symfony:\n            app_path: '../../app'\n            var_path: '../../var'\n        - REST:\n            url: /\n            depends: Symfony\n        - MongoDb:\n            dsn: 'mongodb://root:root@localhost:27017/endpoint'\n            dump: tests/_data/\n        - AMQP:\n            host: 'localhost'\n            port: '5672'\n            username: 'root'\n            password: 'root'\n            vhost: '/'\n            queues: [test]\n```\n\nTest :\n\n```php\n# EndpointCest.php\n<?php\n\nuse Codeception\\Util\\HttpCode;\n\nclass EndpointCest\n{\n    public function postEndpoint(ApiTester $I)\n    {\n        $I->wantTo('Post endpoint');\n\n        // Send the call\n\n        $I->haveHttpHeader('Content-Type', 'application/json');\n        // If you need some authentication through basic auth simply add :\n        $I->amHttpAuthenticated('login', 'password');\n\n        $I->sendPOST('/endpoints', [\n            'label' => 'Label',\n        ]);\n\n        // Asserts REST\n        $I->seeResponseCodeIs(HttpCode::CREATED);\n        $I->seeHttpHeader('Content-Type', 'application/json');\n        $I->seeHttpHeader('cache-control', 'no-cache, private');\n        $I->seeHttpHeader('Location');\n\n        // Imagine we publish a message in RabbitMQ to tell people that a new endpoint was created\n        $I->seeMessageInQueueContainsText('my-queue', 'new endpoint');\n\n        // Assert that the new endpoint is present in the database\n        $I->seeInRepository('Endpoint', ['label' => 'label']);\n    }\n}\n```\n\nJe vous invite à aller lire la [doc de codeception](http://codeception.com/docs/), elle est assez complète et vous pourrez voir qu'ils supportent pas mal de modules :){:rel=\"nofollow noreferrer\"}\n\nJe ne rentre pas plus dans le détail pour le moment, le but était plus de vous faire un retour d'expérience, si vous êtes intéressé pour un article plus poussé sur son utilisation n'hésitez pas à me l'indiquer.\n\nSeeya !\n"}