{"date":"2014-12-01T00:00:00.000Z","title":"Retour sur les MongoDays @Paris","excerpt":"Ayant eu la chance de pouvoir participer a la version Française MongoDB Days qui s'est tenue le 18 Novembre, je vais vous présenter en quelques lignes le déroulement de la journée. Je m'attarderai un peu plus sur les présentations qui selon moi étaient intéressantes techniquement. Vous trouverez aussi le lien vers toutes les présentations des speakers.","readingTime":"6mn","authors":["pouzor"],"categories":[],"content":"\nAyant eu la chance de pouvoir participer a la version Française MongoDB Days qui s'est tenue le 18 Novembre, je vais vous présenter en quelques lignes le déroulement de la journée. Je m'attarderai un peu plus sur les présentations qui selon moi étaient intéressantes techniquement. Vous trouverez aussi le lien vers toutes les présentations des speakers.\n\n**Introduction**\n\n*9h30-10h -* Yann Aubr, Senior Director et Alain Hélaïli, Senior Solutions Architect.\n\nHormis la présentation générael de la société et du produit, certains chiffres intéressants ont été mis en avant afin de mettre en avant la montée de l'utilisation de MongoDb :\n\n- 9 000 000+ de téléchargements\n- 250 000+ participants aux Mongos University (https://university.mongodb.com/)\n- 35 000+ Membres du groupe MongoDb\n- 40 000+ Utilisateurs du service MMS\n- 700+ Services et partenaires\n- 1000+ Clients toutes industries confondues\n\nEnfin, les nouveautés de la futur version 2.8(http://docs.mongodb.org/manual/release-notes/2.8/) de mongoDB ont été presentées. A l'affiche, le \"Document Level Locking\" ainsi que la possibilité de plugger un autre moteur de stockage, notamment dans cette version avec (http://www.wiredtiger.com) wiredtiger comme alternative au moteur MMAPv1 par defaut.\n\n------------------------------------------------------------------------\n\n**Socialite, the Open Source Status Feed**\n10h-11h par Asya Kamsky, Principal Solutions Architect, MongoDB\n\nLa présentation a tourné autour de l'étude d'un cas pratique, en l'occurrence \"[Socialite](https://github.com/10gen-labs/socialite){:rel=\"nofollow noreferrer\"}\" un réseau social proposant des fonctionnalités proches de Twitter.\n\nDe la gestion des Index, du mapping ou du Sharding, en passant par l'architecture même de l'application, tout est passé au crible afin de développer une application scalable et correspondant aux besoins.\n\n*- Retours personnels*\n\nPrésentation intéréssante, repassant sur les bases d'une application Mongo fullstack. Malgré tout, plusieurs pro-tips sont sortis de cette présentation.\nPar exemple, saviez vous que l'objet ObjectId contient une methode getTimestamp() renvoyant le timestamp de l'insertion de la donnée dans la collection (si celui ci na pas été forcé bien evidemment).\n\n[Lien de la présentation](http://fr.slideshare.net/mongodb/socialite-the-open-source-status-feed){:rel=\"nofollow noreferrer\"}\n\n------------------------------------------------------------------------\n\n**Plus de flexibilité et de scalabilité chez Bouygues Télécom grâce à MongoDB**\n\n11h-12h -  par Pierre-Alban Dewitte, Leader d'équipe, Bouygues Télécom\n\nCe talk, présenté par Pierre-Alban Dewitte, a présenté la refonte de l'outil de gestion client chez Bouygues, en partant de la solution initiale, ne correspondant pas aux besoins, jusqu'à la solution \"fait main\" par l'équipe en question, utilisant bien évidemment comme socle mongoDB. Les chiffres annoncés sont vertigineux :\n\n- 99,9% de disponibilité\n- 3000 req/s\n- 2To de RAM\n- 750 de données\n- x noeuds\n\n*- Retours personnels*\n\nPrésentation très interéssante, d'autant plus que travaillant dans un contexte et sur un produit similaire, la possibilité de pouvoir échanger avec eux à été très enrichissante. Surtout quand on sait qu'ils n'avaient aucune connaissance de mongoDB lorsqu'ils ont commencé le poke de la solution, les chiffres annoncés sont impressionnants !\n\n[Lien vers les slides](http://fr.slideshare.net/mongodb/plus-de-flexibilit-et-de-scalabilit-chez-bouygues-tlcom-grce-mongodb){:rel=\"nofollow noreferrer\"}\n\n------------------------------------------------------------------------\n\n\n\n**Scalabilité de MongoDB**\n\n13h-14h - Alain Hélaïli, Senior Solutions Architect, MongoDB\n\nLa présentation d'Alain Hélaïli avait comme sujet \"Comment rendre notre système mongoDb performant, rapide et scalable\". Au travers d'exemples et de cas concrets, le speaker a répondu point par point à ces différentes problématiques avec les différentes solutions dont mongoDB disposent comme le Replica, le Sharding, ou encore la gestion des indexes.\n\nQuelques concepts clés :\n\n-   Bonne gestion des indexes (notamment la gestion des doubles indexes)\n-   Eviter d'ajouter trop de champs lors des updates, quitte a les instancier à NULL lors de la création afin de \"réserver\" la place sur le disque pour de futurs écritures.\n-   Bulk insert\n-   Gestion des chunks et du sharding\n-   MMS, mongoperf, mongostats....\n\n\n\n*- Retours personnels*\n\nCe fut la présentation qui sur le planning m'interessait le plus et ce fut la plus intéressante. L'axe de présentation correspond à l'évolution nécessaire d'une application mongoDB, en partant des \"petites optimisations\" mais quand bien même nécessaire jusqu'à comment construire une architecture a +100 noeuds mongo. Je vous invite à consulter les slides [ici](http://fr.slideshare.net/mongodb/scalabilit-de-mongodb){:rel=\"nofollow noreferrer\"} .\n\n\n\n------------------------------------------------------------------------\n\n**MongoDB et Hadoop**\n14-15h - Tugdual Grall, Partner Technical Services Solutions Architect, MongoDB\n\nPrésentation detaillée sur l'utilisation d'une couche d'application supplémentaire afin de donner une vision 360 sur certains types de données. De la même manière, le speaker a présenté de nombreux cas où l'utilisation des outils comme Hadoop, Spark sont nécessaires et comment les faire interagir avec notre application mongoDB.\n\n[Lien vers les slides](http://fr.slideshare.net/mongodb/mongodb-day-paris2014hadooptgrall-1){:rel=\"nofollow noreferrer\"}\n\n\n\n------------------------------------------------------------------------\n\n15h-16h\nSpeak des sponsors de l’événement par Teradata et Zenika\n\n------------------------------------------------------------------------\n\n**Automatisez votre gestion de MongoDB avec MMS**\n\n16-17h - Alain Hélaïli, Senior Solutions Architect, MongoDB\n\nDernier speak technique de la journée. La nouvelle version de l'outil en ligne MMS a été présenté. En plus de la partie classique de monitoring et de gestion de cluster, cette version intègre la possibilité de provisionner directement grâce a Amazon S3 des clusters de machine et de les configurer.\n\n[Lien de la présentation](http://fr.slideshare.net/mongodb/mongo-db-days-paris-2014-mms-fr){:rel=\"nofollow noreferrer\"}\n\n------------------------------------------------------------------------\n\n**Roadmap produit**\n\n17h-17h30 - Tugdual Grall, Partner Technical Services Solutions Architect, MongoDB\n\nEn forme de conclusion de la journée, Tugdual nous a teasé sur les futures (ou non) fonctionnalités de mongoDB 2.8+.\n\nVoici une liste non exhaustive :\n\n-   Document Level Locking\n-   Mapping Validation\n-   Document Join\n-   De nouveaux moteurs de BDD en plus des deux versions de la 2.8\n-   Service de backup performant et de restauration par filtre\n-   ...\n\n\n\nTugdual a mis en avant les difficultés pour développer ces fonctionnalités ainsi que les potentielles limites. Par exemple pour le join, cela ne pourrait ce faire que sur les clefs de shard afin de pouvoir être scalable et donc de fonctionner avec le sharding de mongoDB.\n\n**En conclusion**\n\nCe fut une journée très instructive. Au-delà d'une mise au point sur les capacités et les nouveautés de MongoDB, beaucoup de petit \"tips\" de performance sont ressortis des différentes conférences. Le genre de petites choses qui misent bout à bout peuvent permettre de gagner pas mal de performance sur des architectures complexes ou sur des gros volumes.\n\nA noter qu'en parallèle des différentes présentations, les architectes et spécialistes mongoDB étaient présents toute la journée pour des entretiens personnels afin de répondre aux questions ou aux problématiques que l'on peut avoir dans nos projets personnels ou professionnels. J'ai trouvé cette initiative très agréable, de pouvoir se rendre disponible aux 'clients' de leurs solutions, surtout que la plupart de ces solutions sont gratuites.\n\nVous pouvez aussi trouver toutes les speaks des précédents événements à cette [adresse](http://www.mongodb.com/presentations/){:rel=\"nofollow noreferrer\"}\n"}