{"date":"2018-12-21T00:00:00.000Z","title":"La rétrospective de sprint, diversifier pour gagner en qualité Partie II","excerpt":"Prêt pour le niveau suivant ? Si vous « masterisez » les principes de base, il est maintenant temps de se pencher sur des versions plus évoluées, qui vous permettront notamment d’aborder des situations différentes et récolter des informations parfois plus pertinentes.","readingTime":"14mn","authors":["pbrenot"],"categories":["agile"],"content":"## INTRODUCTION\n\nJ’avais abordé dans un précédent article (https://blog.eleven-labs.com/fr/retrospective-de-sprint-gagner-en-qualite/) l'intérêt de diversifier les types de rétrospectives de sprint. Pour rappel, il s’agissait essentiellement de gagner en motivation pour gagner en qualité, j’avais alors rappelé quelques recettes « de bases » pour animer cela.\n\nPrêt pour le niveau suivant ? Si vous « masterisez » les principes de base, il est maintenant temps de se pencher sur des versions plus évoluées, qui vous permettront notamment d’aborder des situations différentes et récolter des informations parfois plus pertinentes.\n\n\n**\"TOUT COMME LES POKÉMONS, LES MÉTHODES DOIVENT ÉVOLUER\"**\n\n## LA LISTE D'INGRÉDIENTS POUR CHANGER DE RECETTE, PARTIE II\n\nEncore une fois, il ne s’agit pas d’une liste exhaustive. Les formats de rétrospective de sprint que je souhaite vous faire découvrir ci-après ne sont ici que pour illustrer mon propos (diversifier pour gagner en motivation et en qualité) et vous donner envie de chercher par vous-même des nouveautés.\n\nN’oubliez pas de time-boxer les différentes étapes, et d’essayer de ne pas dépasser 1h au total.\n\n\n## LES FORMATS UN POIL PLUS INNOVANTS\nPassons maintenant à des versions un peu plus « fun » où l’échange peut être facilité et permettra, le plus souvent, de faire un peu plus le focus sur le ressenti de l'équipe et de faire ressortir des signaux faibles que pourra identifier le Scrum Master ou le Product Owner.\n\n### STARFISH\n\n![Starfish_sprint_review]({{site.baseurl}}/assets/2018-12-13-la-retrospective-de-sprint-diversifier-pour-gagner-en-qualite-partie-2/starfish.png \"starfish sprint review\")\n\n**Préparation**\n\n- Des post-it (une seule couleur)\n\n- Un stylo par personne\n\n- Un tableau blanc, ou un paper-board\n\n- Un feutre pour tableau blanc (si tableau blanc)\n\n\n**Déroulement de Starfish**\n**#Etape 1 :**\nLe Scrum master va détailler les 5 espaces du tableau et demander aux différents participants d’écrire ce qu’ils pensent dans chacun de ces espaces (une idée par post-it). On prendra 10 minutes pour que l’équipe puisse écrire ce qu’elle pense en collant ses post-it sur le tableau. Les 5 espaces sont : less, start, stop, keep, more. Le découpage est en forme d’étoile de mer.\n\n\n\n>- **« Less »**, ce que le membre de l’équipe pense qui est toujours fait et est négatif au sein de l’équipe.\n\n>\n\n> - **« More »**, ce que le membre de l’équipe pense qui est fait et qui est positif pour l’équipe.\n\n>\n\n> - **« Stop »**, ce que le membre d’équipe pense qui doit être arrêté.\n\n>\n\n>- **« Start »**, ce que le membre de l’équipe pense qui pourrait être testé ou devrait être commencé.\n\n>\n\n> - **« Keep »**, ce que le membre pense qui ne doit pas être changé.\n\n\n\n**#Etape 2 :**\nLe Scrum master va maintenant réorganiser les post-it (si certains sont identiques), les lire, et demander si besoin des informations à la personne qui l’a écrit. On se gardera 10 minutes pour cette partie.\n\n**#Etape 3 :**\nLe Scrum master va maintenant demander aux membres de l’équipe de prendre 5 minutes pour noter des axes d’améliorations sur des post-it, avec toujours une idée par post-it.\n\n**#Etape 4 :**\nOn terminera par un dot voting afin de voter pour les 3 axes d’améliorations les plus importants et qui devront être mis en action pour le prochain sprint. On donnera donc à chacun des membres 5 points qu’ils devront répartir sur les tickets.\n\nUne fois les 3 axes sélectionnés, on définira des responsables pour chacun des axes, afin de s’assurer qu’ils seront implémentés au cours du prochain sprint.\n\n\n\n**Mon avis**\nOn pourrait tout aussi bien le considérer comme un classique, mais de par sa forme et par le nombre de rubriques qu’il contient, j’ai l’impression qu’il est moins souvent utilisé. On pourra recueillir ici un mix entre le ressenti de l’équipe et identifier des gains de productivité.\n\n\n\n\n### TURN ON THE TABLE\n\n**Préparation**\n- Des post-it de deux couleurs\n\n- Un stylo par personne\n\n\n\n**Déroulement de Turn on the table**\n\n**#Etape 1 :**\nLe Scrum master va demander aux différents membres de l’équipe sur un post-it d’une couleur (et uniquement un) ce qu’ils pensent être la chose la plus positive du sprint, puis sur un post-it d’une autre couleur (et uniquement un) la chose la plus négative du sprint qui se termine. Tout doit rester secret.\n\n**#Etape 2 :**\nLe Scrum master va ensuite demander aux différents participants de donner le post-it positif au voisin de droite et le négatif au voisin de gauche.\n\nChacun devra à tour de rôle expliquer les deux post-it qu’il a en main. Les rédacteurs des post-it pourront bien entendu, à la fin, donner leur avis sur l’interprétation du post-it.\n\n\n\n**#Etape 3 :**\nLe Scrum master va maintenant demander aux membres de l’équipe de prendre 5 minutes pour noter des axes d’améliorations, avec toujours une idée par post-it.\n\n\n\n**#Etape 4 :**\nOn terminera par un dot voting afin de choisir les 3 axes d’améliorations les plus importants qui devront être mis en action pour le prochain sprint. On donnera donc à chacun des membres 5 points qu’ils devront répartir sur les tickets.\n\nUne fois les 3 axes sélectionnés, on définira des responsables pour chacun des axes, afin de s’assurer qu’ils seront implémentés au cours du prochain sprint.\n\n\n\n**Mon avis**\nC’est une variante extrêmement intéressante, car on peut voir comment les différents membres interprètent les post-it des autres et voir si tout est cohérent, s’ils discutent bien entre eux. On mettra donc en valeur les interactions entre les membres de l’équipe.\n\n\n\n### SPEED BOAT\n\n![Speed_boat]({{site.baseurl}}/assets/2018-12-13-la-retrospective-de-sprint-diversifier-pour-gagner-en-qualite-partie-2/boat.png \"speed boat sprint review\")\n\n**Préparation**\n\n- Des post-its (plusieurs couleurs)\n\n- Un stylo par personne\n\n- Un tableau blanc ou un paper-board\n\n- du scotch\n\n- savoir dessiner un bateau, un soleil, une île, un rocher, une ancre et du vent (mais cela devrait aller)\n\n- Un feutre\n\n\n\n**Déroulement du speed boat**\n\n**#Etape 1 :**\nLe Scrum master va commencer par dessiner sur le tableau les images de bateau, de rocher, d’ancre, d’ile, de vent et de soleil et en expliquera le sens à l’équipe. Les participants devront ensuite écrire en dessous de chacun des dessins, sur des post-it, leurs idées et ressentis (une idée par post-it, vous devriez l’avoir compris) qu’ils soient positifs ou négatifs.\n\n\n\n> - **« le bateau »**, il représente l’équipe\n\n>\n\n> - **« l'île »**, elle représente le but à atteindre\n\n>\n\n>- **« le vent »** qui souffle dans la voile, il représente les forces de l’équipe\n\n>\n\n>- **« le soleil »**, qui représente les points positifs du sprint\n\n>\n\n>- **« le rocher »**, qui représente les futurs obstacles que l'équipe pourrait potentiellement rencontrer.\n\n**#Etape 2 :**\nLe Scrum master va maintenant demander aux différents membres de l’équipe d’expliquer leurs post-it\n\n**#Etape 3 :**\nLe Scrum master va maintenant demander aux membres de l’équipe de prendre 5 minutes pour noter des axes d’améliorations sur des post-it, avec toujours une idée par post-it.\n\n**#Etape 4 :**\nOn terminera par un dot voting afin de sélectionner les 3 axes d’améliorations les plus importants et qui devront être mis en action pour le prochain sprint. On donnera donc à chacun des membres 5 points qu’ils devront répartir sur les tickets.\nUne fois les 3 axes sélectionnés, on définira des responsables pour chacun des axes, afin de s’assurer qu’ils seront implémentés au cours du prochain sprint.\n\n\n**Mon avis**\nCe type de rétrospective a un énorme avantage par rapport aux autres : en plus d’être ludique, il permet de mettre en lumière de futurs obstacles, mais aussi les forces de l’équipe. En fonction du nombre de post-it négatif, on pourrait aussi avoir une idée de l’état d’esprit et du ressenti du projet de l’équipe.\n\n\n\n### LES 3 PETITS COCHONS\n\n![les_trois_petits_cochons]({{site.baseurl}}/assets/2018-12-13-la-retrospective-de-sprint-diversifier-pour-gagner-en-qualite-partie-2/3-cochons.png \"les 3 petits cochons sprint review\")\n\n**Préparation**\n\n- Des post-it (une seule couleur)\n\n- Un stylo par personne\n\n- Un tableau blanc ou un paper-board\n\n- Un feutre\n\n\n\n**Déroulement des 3 petits cochons**\n\n**#Etape 1 :**\nLe Scrum master va commencer par dessiner sur le tableau 3 maisons (une par colonne) représentant une maison en paille, une en bois et une en brique.\nAprès avoir expliqué à chacun des membres de l’équipe à quoi correspondent ces maisons, il leur laissera 5 minutes pour écrire une idée par post-it, en fonction des 3 thématiques.\n\n> - **« maison en paille »**, ce que le membre de l’équipe pense être instable au sein de l’équipe\n\n>\n\n>- **« maison en bois »**, ce que le membre de l’équipe pense manquer d'un peu de solidité au sein de l’équipe\n\n>\n\n> - **« maison en brique »**, ce que le membre de l’équipe pense être bien en place (et solide) au sein de l’équipe\n\n**#Etape 2 :**\nLe Scrum master va maintenant demander aux différents membres de l’équipe d’expliquer leurs post-it.\n\n**#Etape 3 :**\nLe Scrum master va maintenant demander aux membres de l’équipe de prendre 5 minutes pour noter des axes d’améliorations sur des post-it, avec toujours une idée par post-it.\n\n**#Etape 4 :**\nOn terminera par un dot voting afin de choisir les 3 axes d’améliorations les plus importants et qui devront être mis en action pour le prochain sprint. On donnera donc à chacun des membres 5 points qu’ils devront répartir sur les tickets.\nUne fois les 3 axes sélectionnés, on définira des responsables pour chacun des axes, afin de s’assurer qu’ils seront implémentés au cours du prochain sprint.\n\n**Mon avis**\nBien que ce type de rétrospective fasse un focus important sur les faiblesses et le négatif, c’est une variante à considérer dans la mesure où elle est simple et rapide et propose des axes de réflexion assez novateurs.\n\n\n## LES SITUATIONNELS\nJe n’en présenterai que 3 ici, que j’aime particulièrement, car ils diffèrent totalement des précédents et ne pourront convenir qu'à des équipes spécifiques ou des « moments » dans la vie du projet. Ils ne fonctionnent qu’avec des équipes habituées à ce type de rétrospectives et souvent après plusieurs sprints.\n\n\n### LES SIX CHAPEAUX (Edward De Bono)\n\n![les_six_chapeaux]({{site.baseurl}}/assets/2018-12-13-la-retrospective-de-sprint-diversifier-pour-gagner-en-qualite-partie-2/chapeaux.png \"les six chapeaux d'Edward De Bono sprint review\")\n\n**Préparation**\n\n- Des post-it (une ou plusieurs couleurs)\n\n- Un stylo par personne\n\n- Un tableau blanc ou un paper-board\n\n- Si possible une feuille imprimée avec les 6 chapeaux de couleurs représentés.\n\n\n\n**Déroulement des Six chapeaux**\n\n**#Etape 1 :**\nLe Scrum master va expliquer à l’équipe la signification de chacun des chapeaux et leur demander de prendre pour chaque chapeau 5 à 10 minutes pour préparer un ensemble de post-it (une idée par post-it) qu’ils viendront ensuite coller sur le tableau et expliquer leurs pensées aux autres.\n\n>- **« chapeau blanc » (neutralité et faits)**, le membre de l’équipe doit se concentrer sur des faits purs, sans interprétations telles que les chiffres, les événements, les dates...\n\n>\n\n>- **« chapeau jaune » (critique positive)**, le membre d’équipe doit se concentrer sur les aspects positifs, sur ce qui a fonctionné.\n\n>\n\n>- **« chapeau noir » (critique négative)**, le membre d’équipe doit lister ici ce qui n’a pas marché, les dangers, les risques.\n\n>\n\n>- **« chapeau vert » (créativité, idées et axes d’améliorations)**, le membre d’équipe doit proposer des solutions d’améliorations, en essayant d’être le plus créatif possible.\n\n>\n\n>- **« chapeau rouge » (émotions et ressenti)**, le membre d’équipe doit se concentrer sur ses sentiments en lien avec ce qui a été énuméré dans le chapeau blanc.\n\n>\n\n>- **« chapeau bleu » (Organisation)**, c’est en quelques sortes la conclusion, le membre d’équipe abordera les solutions à mettre en place.\n\n\n\n**#Etape 2 :**\nOn terminera par un dot voting afin de voter pour les 3 axes d’améliorations (chapeau bleu) les plus importants et qui devront être mis en action pour le prochain sprint. On donnera donc à chacun des membres 5 points qu’ils devront répartir sur les tickets.\nUne fois les 3 axes sélectionnés, on définira des responsables pour chacun des axes, afin de s’assurer qu’ils seront implémentés au cours du prochain sprint.\n\n\n\n**Mon avis**\nLe découpage en 6 thématiques de natures différentes aide bien à se focaliser et à se mettre dans un « mood » de pensée que l’on retrouve rarement dans les autres types de rétrospectives.\n\n\n\n\n### LE LOTUS\n**Préparation**\n\n- Des post-it (une ou plusieurs couleurs)\n\n- Un stylo par personne\n\n- Un tableau blanc, ou un paper-board\n\n\n\n**Déroulement du Lotus**\n\n**#Etape 1 :**\nLe Scrum master va diviser le tableau en 9 cases (un peu comme dans un jeu de morpion) et écrire le problème (préalablement) identifié au centre.\n\n**#Etape 2 :**\nIl va ensuite être demandé aux membres de l’équipe de réfléchir pendant quelques minutes à comment découper ce problème en 8 sous-problèmes. Il les aidera à se mettre d’accord.\n\n\n**#Etape 3 :**\nLe Scrum master va maintenant demander aux membres de l’équipe de prendre 5 minutes pour faire du dot voting sur le découpage des sous-problèmes afin de définir lesquels seront abordés.\n\n**#Etape 4 :**\nSi possible, le Scrum master va diviser l’équipe en sous-équipe ayant chacune un sous-problème à solutionner. La restitution des idées se fera sur un tableau de 9 cases avec le sous-problème au centre, puis les solutions envisagées tout autour.\n\n\n\n**#Etape 5 :**\nOn terminera par une restitution orale des solutions par chacune des sous-équipes puis on définira des responsables de suivi de mise en place des solutions, afin de s’assurer qu’elles seront implémentés au cours du prochain sprint.\n\n**Mon avis**\nTrès particulière, cette rétrospective permet de solutionner un problème de grande ampleur quand ce dernier est identifié en amont, ce qui permet de vraiment creuser un problème sans que le format de la rétrospective ne vienne entraver ce travail (en dispersant les idées).\n\n\n\n### JEOPARDY\n\n**Préparation**\n\n- Des post-it (deux couleurs)\n\n- Un stylo par personne\n\n- Un tableau blanc, ou un paper-board\n\n\n\n**Déroulement de Jeopardy**\n\n**#Etape 1 :**\nLe Scrum master va laisser quelques minutes pour que les membres de l’équipe écrivent chacun au moins un combo de deux post-it contenant : une question concernant les problèmes rencontrés par l’équipe, et la solution à ce problème.\n\n**#Etape 2 :**\nIl va ensuite être demandé aux membres de l’équipe d’aller coller au tableau les réponses (en gardant secrètes leurs questions).\n\n**#Etape 3 :**\nLes membre de l’équipe devront ensuite trouver les questions associées à ces réponses (un post-it à la fois). Le scrum master prendra en note les questions proposées.\nDès qu’il n’y a plus de questions proposées, la personne qui en a écrit la réponse devra prendre la parole et expliquer son combo question/réponse.\n\n**#Etape 4 :**\nLe Scrum master demandera aux membres de l’équipe de prendre 5 minutes pour noter des axes d’amélioration sur des post-it.\n\n\n\n**#Etape 5 :**\nOn terminera par un dot voting des 3 axes d’améliorations les plus importants et qui devront être mis en action pour le prochain sprint. On donnera donc à chacun des membres 5 points qu’ils devront répartir sur les tickets.\n\nUne fois les 3 axes sélectionnés, on définira des responsables pour chacun des axes, afin de s’assurer qu’ils seront implémentés au cours du prochain sprint.\n\n\n**Mon avis**\nLe format est totalement différent des rétrospectives classiques, son côté « gamifié » peut ajouter un peu de fun dans une cérémonie qui peut se retrouver assez répétitive. Il faudra cependant faire attention à son utilisation car il ne se focalise que sur les problèmes et pas du tout sur le positif ou les sentiments de l’équipe.\n\n\n\n## CONCLUSION\n\nJ’espère que cette partie II de mon article vous aura permis de parfaire vos connaissances sur le sujet et vous aura donné envie d’expérimenter ces nouvelles méthodes.\n\nVous verrez, en fonction de l’avancement d’un projet, il se peut que certaines méthodes s’imposent comme une nécessité, inutile donc de se forcer.\n\nBien que nous nous soyions exclusivement concentrés sur du recueil de données avec l’utilisation de post-it, il existe de nombreuses autres méthodes qui viennent jouer sur les autres étapes de la rétrospective (souvenez-vous, au début : ouverture, recueil, génération d’idées, plan d’action, clôture). À ce titre, [un très bon article de Charles-Eric Gorron](https://blog.eleven-labs.com/fr/amelioration-continue-comment-animer-vos-retrospectives-agiles/) en trace les grandes lignes.\n\nEssayez-vous à ces différents formats et venez partager en commentaire vos REX et suggestions de type de rétrospectives !\n\n\n\n## RÉFÉRENCES\n\n-[https://blog.myagilepartner.fr/index.php/2018/09/14/retrospective-la-fleur-de-lotus/](https://blog.myagilepartner.fr/index.php/2018/09/14/retrospective-la-fleur-de-lotus/)\n-[http://coach-agile.com/2014/10/coach-agile-retrospective-scrum-chapeaux/](http://coach-agile.com/2014/10/coach-agile-retrospective-scrum-chapeaux/)\n-[https://blog.myagilepartner.fr/index.php/2018/08/15/retrospective-jeopardy/](https://blog.myagilepartner.fr/index.php/2018/08/15/retrospective-jeopardy/)\n-[http://www.qualitystreet.fr/2017/02/19/retrospective-agile/](http://www.qualitystreet.fr/2017/02/19/retrospective-agile/)\n\n"}