{"date":"2017-12-06T00:00:00.000Z","title":"Soigner ses emails transactionnels","excerpt":"L'année dernière un client nous a demandé que les e-mails envoyés par l'api soient plus esthétiques. N'ayant aucun intégrateur dans l'équipe, personne n'était motivé pour s'occuper de ce genre de ticket. Nous avons donc tiré au sort pour savoir qui s'en chargerait. Bien sûr, c'est tombé sur moi. Le but de la fonctionnalité était d'avoir des emails beaucoup plus soignés et responsives.","readingTime":"3mn","authors":["qneyrat"],"categories":[],"content":"\nL'année dernière un client nous a demandé que les e-mails envoyés par l'api soient plus esthétiques. N'ayant aucun intégrateur dans l'équipe, personne n'était motivé pour s'occuper de ce genre de ticket. Nous avons donc tiré au sort pour savoir qui s'en chargerait.\n\nBien sûr, c'est tombé sur moi (rip).\n\nLe but de la fonctionnalité était d'avoir des emails beaucoup plus soignés et responsives...\n\n> Ah!\n\nNos e-mails n'étaient pas particulièrement compliqués, mais le centrage du logo de l'entreprise et le design étaient problématiques.\nJ'ai donc commencé le ticket avec du HTML 3 et ses fabuleux tableaux, puis au bout de 5 minutes, je me suis dit qu'en 2017, devoir faire ça était vraiment stupide. J'ai donc cherché un moyen plus moderne de pouvoir intégrer ces e-mails.\n\n## solution 1 : un builder drag and drop\n\nLa plupart des services d'e-mails proposent sur leur plateforme un builder avec drag and drop et un système de blocs.\nIntéressant, mais je devais exporter chaque e-mail en HTML 3.\n\nJ'ai donc cherché une solution plus orientée développeur.\nÉtant donné que notre service d'e-mails était [Mailjet](https://fr.mailjet.com/).\n\nIls venaient tout juste de rendre open source un nouveau projet : [MJML](https://github.com/mjmlio/mjml).\n\n## solution 2 : un générateur de HTML\n\nMJML est une application CLI qui utilise des composants React pour générer du HTML 3 responsive.\n\nAprès quelques tests, j'ai choisi cette solution.\n\nOn écrit donc des balises du type `mj-*` qui vont ensuite permettre de générer du HTML 3. Voici un petit exemple :\n\n```xml\n<mjml>\n  <mj-body>\n    <mj-container>\n      <mj-section>\n        <mj-column>\n\n          <mj-image width=\"100\" src=\"/assets/img/logo-small.png\"></mj-image>\n\n          <mj-divider border-color=\"#F45E43\"></mj-divider>\n\n          <mj-text font-size=\"20px\" color=\"#F45E43\" font-family=\"helvetica\">Hello World</mj-text>\n\n        </mj-column>\n      </mj-section>\n    </mj-container>\n  </mj-body>\n</mjml>\n```\n\nVous pouvez essayer ce template ici : [https://mjml.io/try-it-live](https://mjml.io/try-it-live)\n\nBeaucoup de composants sont disponibles notamment au niveau des colonnes, des tableaux, des listes, des images.\nOn retrouve dans l'exemple ci-dessus :\n- les composants `mj-body`, `mj-container`, `mj-section`, `mj-column` qui vont permettre de gérer le placement des blocs de votre template.\n\n- les composants `mj-button`, `mj-text`, `mj-divider`, `mj-table` qui eux vont permettre de gérer le contenu de votre template.\n\n- les composants `mj-accordion`, `mj-carousel`, `mj-navbar`, `mj-invoice`, `mj-location` quant à eux, vont permettre de gérer des contenus plus complexes et exotiques comme une facture ou une localisation grâce à Google Maps.\n\nVous pouvez retrouver l'ensemble des composants sur la documentation de MJML : [https://mjml.io/documentation/#standard-body-components](https://mjml.io/documentation/#standard-body-components)\n\nLe framework permet de gérer son style via le composant directement, comme par exemple :\n```xml\n<mj-image width=\"100\" ...\n```\n\nou directement dans les headers HTML via le composant `mj-style`.\n```xml\n...\n<mj-head>\n    <mj-style inline=\"inline\">\n    .link-nostyle {\n        color: inherit;\n        text-decoration: none\n    }\n    </mj-style>\n</mj-head>\n...\n<mj-text>\n    Hello <a href=\"https://mjml.io\" class=\"link-nostyle\">World</a>\n</mj-text>\n...\n```\n\n## Utilisation\n\nMJML est disponible sous forme de CLI installable comme ceci :\n```\nnpm install -g mjml\n```\n\nMaintenant que MJML est installé, on va créer un fichier `template.mjml`. Vous pouvez trouvez [ici des exemples de template](https://mjml.io/templates) déja tout prêts.\n\nPour générer un template de MJML vers HTML3 il suffit de lancer la commande :\n```\nmjml template.mjml --output my-email.html\n```\n\n## Intégration rapide dans Symfony\n\nUne fois le template réalisé, j'ai remplacé les données par des variables `twig` et lors du déploiement, je génère des fichiers avec l'extension `twig` :\n```\nmjml /path/of/templates/template.mjml --output /path/of/ressources/my-email.html.twig\n```\n\nGrâce à cet outil, un développeur peut réussir sans trop de problèmes à proposer dans son application des emails transactionnels propres. En espérant ne plus voir en 2018 des emails composés uniquement d'un texte et non affichables sur son téléphone...\n"}